{"meta":{"title":"junlegao","subtitle":"道可道，非常道。名可名，非常名。","description":"无为而为之，为而无为也。","author":"樂","url":"http://gorgegao.club"},"pages":[{"title":"分类","date":"2017-06-15T13:28:48.000Z","updated":"2017-06-15T13:29:47.865Z","comments":true,"path":"categories/index.html","permalink":"http://gorgegao.club/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"大数据基础知识","slug":"大数据基础知识学习","date":"2018-05-23T01:00:44.000Z","updated":"2018-05-23T02:37:21.772Z","comments":true,"path":"2018/05/23/大数据基础知识学习/","link":"","permalink":"http://gorgegao.club/2018/05/23/大数据基础知识学习/","excerpt":"了解下大数据是什么，大数据有什么用，大数据设计到哪些技术。","text":"了解下大数据是什么，大数据有什么用，大数据设计到哪些技术。 大数据定义大数据，指的是所涉及的数据资料量规模巨大到无法通过人脑甚至主流软件工具，在合理时间内达到撷取、管理、处理、并整理成为帮助企业经营决策更积极目的的资讯。 from 百度：大数据（big data），指无法在一定时间范围内用常规软件工具进行捕捉、管理和处理的数据集合，是需要新处理模式才能具有更强的决策力、洞察发现力和流程优化能力的海量、高增长率和多样化的信息资产。 from 大数据时代：维克托·迈尔-舍恩伯格及肯尼斯·库克耶编写的《大数据时代》大数据指不用随机分析法（抽样调查）这样捷径，而采用所有数据进行分析处理。大数据的5V特点（IBM提出）：Volume（大量）、Velocity（高速）、Variety（多样）、Value（低价值密度）、Veracity（真实性）。维克托·迈尔-舍恩伯格及肯尼斯·库克耶编写的《大数据时代》 个人理解：大数据就是在计算机环境下产生大量复杂的可用于被挖掘的有价值的数据的集合。 大数据特点5V：Volume(大量)、Velocity(高速)、Variety(多样)、Value(价值密度低)、Veracity(真实性)P：单位关系转换 DB&gt;NB&gt;BB&gt;YB&gt;ZB&gt;EB&gt;PB&gt;TB&gt;GB&gt;MB&gt;MB&gt;KB 大数据相干技术大数据主要为有效地处理大量的数据。相关技术有大规模并行处理(MPP)数据库、数据挖掘电网、分布式文件系统、分布式数据库、云计算平台、互联网和可扩展的存储系统、机器学习、深度学习等。 HadoopMapReduce：Hadoop已经是目前大数据平台中应用率最高的技术，特别是针对诸如文本、社交媒体订阅以及视频等非结构化数据。除分布式文件系统之外，伴随Hadoop一同出现的还有进行大数据集处理MapReduce架构。 NoSQL数据库：oSQL数据库关注关系型数据库引擎的限制，如索引、流媒体和高访问量的网站服务。在这些领域，相较关系型数据库引擎，NoSQL的效率明显更高。 内存分析：内存分析在个人消费电子设备以及其他嵌入式设备中的应用将会得到快速的发展。随着越来越多的价格低廉的内存用到数据中心中，如何利用这一优势对软件进行最大限度的优化成为关键的问题。内存分析以其实时、高性能的特性，成为大数据分析时代下的“新宠儿”。如何让大数据转化为最佳的洞察力，也许内存分析就是答案。 集成设备：随着数据仓库设备(Data Warehouse Appliance)的出现，商业智能以及大数据分析的潜能也被激发出来，许多企业将利用数据仓库新技术的优势提升自身竞争力。集成设备将企业的数据仓库硬件软件整合在一起，提升查询性能、扩充存储空间并获得更多的分析功能，并能够提供同传统数据仓库系统一样的优势。 大数据与云计算的关系 大数据通常形容一个公司创造的大量非结构化数据和半结构化数据，这些数据在下载到关系型数据库时同上使用大量时间，大数据分析常常和云计算联系在一起，因为事实的大型数据集分析需要向MapReduce框架进行分发出库。 小结大数据的意义和前景。总的来说，大数据是对大量、动态、能持续的数据，通过运用新系统、新工具、新模型的挖掘，从而获得具有洞察力和新价值的东西。 附录 大数据处理工具： Hadoop HDFS、HadoopMapReduce, Hbase、Hive 渐次诞生，早期Hadoop生态圈逐步形成。 NoSQL，membase、MongoDB 大数据处理流程 数据采集：使用多种轻型数据库接受来自客户端的数据，并且用户可以根据这些数据库进行简单的查询和处理工作。特点：高并发使用产品：NoSQL，membase、MongoDB 统计分析：将海量数据导入一个集中的大型分布式数据库或者分布式存储集群，利用分布式技术对存储与内部的数据进行查询分类汇总；特点：导入数据量大，设计查询数量大，查询请求多；使用产品及工具：infoBright,Hadoop(Pig和Hive),YunTable,SAP Hana和OrecleExadata，Hadoop主要做离线分析为主。 挖掘数据：基于查询数据进行挖局，满足高级别的数据分析；特点和挑战：算法复杂，计算设计的数据量和计算量都较大；","categories":[],"tags":[]},{"title":"云计算基础知识","slug":"云计算基础知识","date":"2018-05-21T12:20:20.000Z","updated":"2018-05-23T02:39:56.056Z","comments":true,"path":"2018/05/21/云计算基础知识/","link":"","permalink":"http://gorgegao.club/2018/05/21/云计算基础知识/","excerpt":"什么是云计算？云计算提供的服务形式有哪几种？云计算的发展及技术支撑有哪些？云计算涉及到的其他技术有哪些？","text":"什么是云计算？云计算提供的服务形式有哪几种？云计算的发展及技术支撑有哪些？云计算涉及到的其他技术有哪些？ 云计算提出的原因： 科学的进步： 普通的PC服务器的处理能力远远超过以前的小型机，导致系统资源利用率低，并行技术的发展，可以将成千上万台PC服务器处理能力集中起来代替大型机、中型机； 生态意识： 节能环保意识的增强，将大量的PC服务器集中管理起来，暗示按需提供相应的处理能力，需求小的业务划分一部分CPU、内存资源，需求大的业务将多个服务器聚合起来进行使用，使用完即释放资源； 互联网的兴起： 为消费者服务器购买提供便捷途径。 云计算的定义：from 百度：云计算是基于互联网的相关服务的增加、使用和交付模式，通常涉及通过互联网来提供动态易扩展且经常是虚拟化的资源。美国国家标准与技术研究院（NIST）定义：云计算是一种按使用量付费的模式，这种模式提供可用的、便捷的、按需的网络访问， 进入可配置的计算资源共享池（资源包括网络，服务器，存储，应用软件，服务），这些资源能够被快速提供，只需投入很少的管理工作，或与服务供应商进行很少的交互。博客阿里云：云计算是一种按使用量付费的模式，这种模式提供可用的、便捷的、按需的网络访问， 进入可配置的计算资源共享池(资源包括网络，服务器，存储，应用软件，服务，这些资源能够被快速提供，只需投入很少的管理工作，或与服务供应商进行很少的交互。 简单的理解：云计算就是将多台计算机聚合在数据中心，通过虚拟化使其看起来作为一台服务器，随后通特定的API向外界提供服务，使用人员可以按时计费租赁其中的硬件、平台及软件服务，其中的分配空间可以向虚拟机一样弹性分配计算性能。 云计算提供的服务形 IaaS(Infrastructure-as-a-Service):基础设施即服务，将CPU、存储、网络等引荐资源能力云化，作为服务提供给消费者。 PaaS(Platform-as-a-Service)：平台即服务，运行软件的软件能力，作为服务提供给消费者，如阿里和腾讯的开发平台； SaaS(Software-as-a-Service):软件即服务，通过internet提供软件的模式，用户无需购买软件，使用提供商用租用Web的软件，来管理和用作，如阳光云服务器，在线PS，在线各类管理系统等 from:阿里云推荐：云计算揭秘企业实施云计算的核心问题 第1章 什么是云计算1.1 定义云计算的5大原则1.2 迁移到云中带来的效益1.3 导致云计算的IT演变1.4 云的分层：按使用分类1.5 小结 1.1云服务5大原则资源池：任何订阅用户均可使用虚拟化：硬件资产的高效利用弹性：无需资本开支即可动态伸缩自动化：构建、部署、配置、供应和转移，全部无需人工操作度量计费：根据使用量进行收费的业务模型，只为使用部分付费 1.2云服务迁移到云的好处从资本开销转变到运营开销的经济效益不必购买和供应服务器带来的机动性优势云中的安全性更强也更好 1.3云服务发展流程主要计算范式的变迁：从大型主机到客户机-服务器再到Web 20世纪60~80年代的虚拟机 提供空闲的时间给其他的用户使用20世纪90年代：客户机、服务器模型，吧任务分拆到计算网络上的客户机系统和服务器，前者发起请求，后者提供服务2000年：网格和软件即服务 用大型计算任务的廉价引荐大型阵列，复杂的引用开始可以从互联网上开始方位2005年至今：效应模型重生 通过浏览器在网上访问，大众按需消费，从数据中心获取资源。 1.4 云的分类划分云的类型：云分为公有云、私有云、混合云等 第2章 理解云计算分类云计算的支撑技术云的基本技术和基础设施 云运行网络上的服务器，多个服务器的存储位置即数据中心；数据中心提供基础设施，统一构建，减低成本；共同服务，节能减排(用电，能耗，PUE电能利用率) 云的服务需要虚拟化 如同虚拟机将CPU、内存、网卡、硬盘等咋自己本机中可划分为多个，然后每个都通过虚拟化层对其分配各自的CPU等资源，分别在其安装的操作系统上，运行各自的应用。云服务器将多个主机组成的数据中心看成统一的大服务器，根据企业需求为其分配资源，高效使用计算资源。 云需要访问API， 提供服务，供开发者调用。云的用户需要一种方式访问云、供应新的虚拟服务器，让数据进出存储，在服务器上启、停服务，同时释放不在需要的服务器。 云需要某种存储 ，保存虚拟印象、用户的应用和应用所需持久化数据。一般服务器中使用关系数据可RDBMS进行数据存储，但是在云中维护引用完整性难，无法保证多个服务器的副本是一致的。 云应用需要数据库，结构化的数据，对数据进行结构化及存储。使用NOSQL进行存储，新型的非SQL数据库一般是键-值数据库，伸缩性良好。这样的话，以键值对形式存储，可以允许不同的项目间包含数据重复。可以快速进行重连接。关系数据库与NOSql对比 eg：Google的Big table解决方案是开发较简单的存储管理系统，对PB级别数据进行快速访问。 云需要弹性 ，按照需求量收缩eg:网站访问中，如果大规模的同事访问将导致网站宕机，当双十一淘宝的接单中，就是用大数据中心进行处理，以前存在货物刷不出来，付款任务无法交付，消灾通过弹性分配负载，让其更加可靠有效的提高负载均衡，用户更加流畅的使用。 第3章 云计算的商业依据3.1 云计算的经济意义云计算改变了资本支付(CAPEX)和运营开支(OPEX)间的比例。1234CAPEX和OPEXCAPEX是创造未来收益的开支。企业花钱购买固定资产，就导致了资本开支。会计会给一个资产账目增加一项资本开支（对其进行资本化）。一般来讲，CAPEX要求先期投资被分摊（折旧），然后随时间减值。初始的CAPEX购买会导致庞大的现金支出—正是这个原因，让创业公司不约而同地想避免这种购买行为。OPEX是运营产品、业务或系统的持续成本（ongoing cost）。它是一种日常开销，有点像成本费用，如市场营销；因此，它可以更方便地根据业务要求进行增减。这对于CAPEX是不可能的，因为你已经购买了设备。 3.1.1 传统内部IT、共享托管、托管服务和云模型之间的比较 传统内部IT模型IT引用或服务的各方面组成都使用内部资源购买和管理eg：在许多办公室里，IT基础设施 共享托管部署部署应用的可能模型出现于第三方数据中心。公司仍然负责采购服务器硬件，开发或购买运行应用的软件。共享托管设施为这些引荐提供第三方的电能、制冷、机架和网络连通性。这种共享托管设施通常也提供冗余网络连通、备份电源和物理安全性。 托管服务部署托管服务价格外包核心基础设施，电能、网络连通等问题，公司也不再购买服务器和网络硬件，托管服务提供商把它们组个公司，负责管理这些硬件系统和安装操作系统，有些时候还提供团建服务。一般以月收费为主。 云部署与托管一样，但是公司不是租用硬件资源，而且租赁云中时刻动态分配的虚拟化资源。推荐使用，成本上较低，具体对比见（https://yq.aliyun.com/articles/175422?spm=a2c4e.11153940.blogcont175465.18.16c67cafiuqsx8） 3.1.1 云适用和不适用的场合 适用于大中小微型企业为企业提供公司网站托管（低技术含量示例：公司网站）、文件存储备份（中等技术含量示例：备份和文件存储系统）、项目研发部署（高技术含量示例：新产品开发）。为小型企业提供算力，计算各种内容；为大型企业提供数据集存储，高计算场景，高并发计算量的能力 不适用场景 遗留系统，老系统能够中需要或专有软硬件平台上的依旧 涉及实时/关键任务场景的应用，云服务是尽力交付，不能保证百分之百在线交付，而且必须依赖公用互联网的连通性，如果打通运行任务的关键，不建议在云中部署；处理机密数据，不建议在云服务器上部署（因为云服务器中会存在若干备份，在删除时不保证能够干净的全部删除）。 附录：云计算涉及到的技术from：http://www.aboutyun.com/thread-5767-1-1.html云技术可以使用的语言有java,c++等语言开发设计到的技术： HadoopHadoop是由Java实现的处理大数据的框架Hadoop解决问题：处理倒台服务器产生的通信过程功能：Hadoop就是一个解决方案。Hadoop是一个分布式方案，能够把压力分摊到其他服务器。至于如何做到的，可以深入了解Hadoop的maprecude等知识Hadoop详细介绍链接：http://www.aboutyun.com/thread-5199-1-1.html openstackopenstack是搭建云平台技术，可以搭建公有云、私有云和混合云。openstack是开源的云管理平台，用来统一管理多个虚拟化集群的框架。openstack目前分为运维及开发 NOSQLnosql即not only sql。nosaql数据库有Mongodb、Redis、Membase和HBase等nosql数据库是一种比较低级的数据库，关系型数据库是由nosql数据库发展而来。什么是关系型数据库，这里不从概念上区别，常用的SqlServer，mysql,oracle都是关系型数据库。关系型数据库顾名思义，数据库关系明确严谨。而nosql则是一种数据关系不严谨的数据库。一个key和value。","categories":[],"tags":[]},{"title":"互联网热点的一些炒作方法","slug":"热点话题怎么炒","date":"2018-05-18T00:21:19.000Z","updated":"2018-05-23T02:37:04.050Z","comments":true,"path":"2018/05/18/热点话题怎么炒/","link":"","permalink":"http://gorgegao.club/2018/05/18/热点话题怎么炒/","excerpt":"互联网时代，是咨询的时代，利用资讯信息获取流量的开始即拥有一个吸引眼球的热点话题，在有热点话题后需要如何去编辑、炒作呢？在此简单学习，供参考。","text":"互联网时代，是咨询的时代，利用资讯信息获取流量的开始即拥有一个吸引眼球的热点话题，在有热点话题后需要如何去编辑、炒作呢？在此简单学习，供参考。 from： 喜马拉雅听–&gt;36氪商业情报局 流量焦虑时代，热点话题怎么炒流量到利润的转换，流量产生广告等。。流量不是唯一的入口，但是是一个很重要的入口。那么如何获取流量。—&gt;话题 == 流量—&gt; 4个典型和常见的思考方向 某个热点事件人物钥匙有我们这款产品多少，某个热点人物这时候有我们这款产品有多好？eg:太子妃升职记， 粗略的场景及服装、场景设置及特效。思路：捐助公司，以此为话题，发出 站在我们公司的角度上，是不是可以对某个热点事件提供专业的声音。eg：比特币出现时候，教育机构、投资机构对比特币的出现、原理、收益、风险等方式做简单易懂的介绍，或者历史性的介绍，根据热点对其进行解释，从此发掘二次流量 如果某个热点事件的场景特别美妙，用户若是使用我们的产品是否可获得同样的效果。eg：运营人员，提供场景模拟，实现对场景的实现。such as，使用我们的人脸识别产品，你可以对产品进行类似美国大片钢铁侠，人脸识别身份 对某个热点事件进行分析，并提出自己的观点，引起大家的思考或者评论。eg：锤子罗永浩上周在 流量将带来何种利益，流浪变现方式 流量变现——互联网的盈利模式互联网产品的变现方式随着互联网产品的发展成熟，流量变现渠道基本可以举穷，我们列几种主流方式： 广告变现。广告是最基础的变现方式，几乎所有有流量的产品都能通过这种途径变现。对于非流量巨头的一般企业来说，局限或许在于规模化空间不大，稳定性略有欠缺； 电商变现。将用户导向“买买买”的变现方式非常主流、延展性强；但对前端内容和后端供应链要求较高。电商、垂直社区、新媒体甚至部分saas企业都通过这种方式变现。 游戏变现。游戏通过充分利用用户心理激发其付费能动性（用金钱在虚拟世界换得快感），堪称腾讯的一大收入支柱。网游、社交游戏、直播中的网红打赏等都属于这类变现。 用户付费。这类变现主要通过提供相关服务，实现稳定变现，因此对于产品本身要求很高。此法在O2O、数据类、企业服务和金融企业应用较多。2/影响互联网产品变现的因素 IP变现。视频网站最终借制作电视剧、电影的潮流，走向变现之。 from14年阿里：流量变现——互联网的盈利模式最后，补充一下国内常见的使用“流量变现模式”盈利，或者辅助其他产品盈利的互联网产品： ——百度搜索广告、网盟广告 ——去哪儿网搜机票酒店时看到的广告(很多与目的地有关) ——hao123等导航网站 ——360浏览器等各种浏览器 ——豌豆荚、91助手等手机管理软件 ——机锋市场等各种Android市场 ——各种Android ROM","categories":[],"tags":[]},{"title":"余军的PM产品试题","slug":"余军的PM面试题","date":"2018-04-03T12:42:35.000Z","updated":"2018-05-23T02:38:12.132Z","comments":true,"path":"2018/04/03/余军的PM面试题/","link":"","permalink":"http://gorgegao.club/2018/04/03/余军的PM面试题/","excerpt":"早上听点产品~ From:产品方法论-喜马拉雅听 听喜马拉雅听中的一点产品知识，听起来很迷茫，但是其中一点对产品面试题的分析，留下点印象，随记之~ 余军的PM面试题：同理心环视天赋技能，如何提高产品能力。","text":"早上听点产品~ From:产品方法论-喜马拉雅听 听喜马拉雅听中的一点产品知识，听起来很迷茫，但是其中一点对产品面试题的分析，留下点印象，随记之~ 余军的PM面试题：同理心环视天赋技能，如何提高产品能力。 如何在日常生活中，提高上你的产品技能~ 下载小而美的APP来源：APP store: 精品APP、从最美应用、next平台咨询 分析产品功能 大牛： 揣摩目标应用的用户群 可能是什么样的人 核心竞争力 主要功能的用户场景分别是什么 from this:作为一名普通用户进行使用APP，带着接下来几个问题： 这个APP怎么吸引你，为什么下载，是什么，对这个APP的感受，第一印象。 初次体验，有引导么，APP的整体感觉如何，是否感觉到智能高效呢？花费了多少时间呢，给你留下什么印象？ 再次使用，多久用一次，这款与其他APP相比如何，预测它会火么？ 注重把握身边的人 用眼睛去看 在每次应用更新后，去电子应用市场，关注用户评论，是否和自己的想法相同，身边的人如何使用APP，用户习惯如何？ 用耳朵聆听 对每次应用的APP，和周围人讨论它怎么样？ 定义周边的 用一句话给一个从未使用过电脑的人描述鼠标？ 听到：鼠标是人在电脑这个虚拟世界的手，通过它可以与这个世界交互。 From me：鼠标相当于电视上的遥控器，遥控器相当于电脑，可以操纵电视，换台，调设置；鼠标相当于电脑，可以和键盘一起控制电脑，emmmmm，如果了解科幻片的话，其中的点击虚拟屏幕就是现在鼠标控制的元凶。 点评：考察用一句话描述产品定位。产品再用户心智模型的第一反应，根据自己的知识经验进行描述。 如何对产品进行描述，注重以下几个点： 是什么行业，什么类型的产品 目标用户群是谁； 解决用户什么问题 给用户带什么价值 跟竞争对手的差异在哪 如何匹配产品与用户心智模型的链接最简单的方法就是比喻，将与原来的方法比对起来。 说说你平常用的软件，为什么喜欢？ 听到，鲜果阅读， 点评：考察队用户核心需求的把握能力，为什么喜欢，因为其解决一定的问题（需求痛点），给你带来了什么价值？鲜果阅读是聚合阅读，节约用户获取产品的时间价值，这是产品的核心。 如何今天与同学约好买手机，突然导师打电话有事去不了了，这个时候一直打不清楚电话，这个时候你该如何做？ From me: 点评：考察沟通能力与优先级排序能力.具体问题具体分析，一般需要分为几种场景啦讨论。such，导师的事情优先级高么，与同学之间还有其他方式么？ 说说12306不好用的原因。 听到，总的来说，归为用户体验不好，不支持大量订票购票操作，订票购票存在逻辑问题，存在订不到票的问题。 点评：没有解决用户在特定场景急切买到票的需求，用户在很多时候想不通过登录与复杂的流程进行购票，只想简单方便的买到。在票源紧张的时候还可以买到票，这是很多刷票软件诞生的原因。 日常提问综合案例题： 给你喜欢的APP增加一个功能，说明设计思路。 糗事百科，增加基于LBS（基于位置的服务）的发布糗事功能。发现身边的糗事，增加糗友无处不在。 点评： 考察根据产品定位增加产品功能，以及评估一个功能是否该做。评估的标准是产品定位、KANO 模型（对用户需求分类和优先排序的有用工具）、产品的价值。 中式款餐店旁边是肯德基，没有太多资金进行推广，如何进行引流？ 点评：考察是否有产品运营的思维低成本的有事件推广，技术工具、创业推广。技术运营的策略和思维： 开放平台 种子用户 媒介软文 技术工具 产品捆绑 广告植入 合作整合 社区推广 活动策划 创业腿长 事件营销 智能手机与电脑结合，摇一摇，有什么好玩的玩法！考察有木有理解移动互联的本质，即智能手机传感器的应用。手机端的特质，摇一摇AR等在手机中的应用~ 总结：产品职位的面试在于尝试洞悉出题者的动机，如同洞察用户的动机和核心需求，考察在于产品定位、核心需求、需求排序等问题","categories":[],"tags":[]},{"title":"产品经理职责及产品设计流程","slug":"重新分析互联网产品及职责","date":"2018-03-25T12:24:14.000Z","updated":"2018-04-04T07:43:39.369Z","comments":true,"path":"2018/03/25/重新分析互联网产品及职责/","link":"","permalink":"http://gorgegao.club/2018/03/25/重新分析互联网产品及职责/","excerpt":"在最近经历求职简历无回应，准备无从下手之际，重新看下产品经理的职责，设计一个产品需要做什么，从中找点启发，继续我的产品路~ 文章分为两部分，第一部分是来自人人都是产品经理老曹的分析，第二部分来自某培训机构产品经理内容介绍。","text":"在最近经历求职简历无回应，准备无从下手之际，重新看下产品经理的职责，设计一个产品需要做什么，从中找点启发，继续我的产品路~ 文章分为两部分，第一部分是来自人人都是产品经理老曹的分析，第二部分来自某培训机构产品经理内容介绍。 产品经理的主要职责：from：人人都是产品经理，老曹 产品经理岗位职责 市场调研 与用户和潜在用户交流 与直接面对客户的一线同事交流 研究市场分析报告及文章 研究市场分析报告及文章 使用竞争产品 仔细观察用户行为 产品定义及设计 定义产品指产品做什么内容(使用PRD描述) 市场愿景 竞品分析 产品的详细功能描述 产品优先级 产品用例 系统需求 性能需求 销售及技术支持需求 产品外观设计，用户界面设计，交互界面设计及用户体验设计 PRD 产品需求文档撰写 项目管理 沟通不同团队人员(工程师、QA、市场、销售、客服等)，在预算时间内发布产品 确保资源投入 制定项目计划 根据计划跟踪项目进展 辨别关键路劲 必要时真去追加投入 向主管汇报项目进展 产品宣传 向包括老板、销售、客服等沟通产品的优点、功能和目标市场，也可能向外界选厂 产品市场 产品生命周期管理指随着产品经历概念化、发布、成熟、退出整个生命周期中的产品管理活动。 产品定位 产品定价及促销 产品线管理 竞争策略 建立或收购合作伙伴 识别并建立合作关系 产品设计流程from西南科大产品培训的简单过程分析 step1:市场分析/用户分析以抖音、西瓜视频、快手、美拍、秒拍为例进行分析。 竞争对手：快手（竞品分析）特点分析：时间偏长 目标用户，用户群体可分为三类： 核心用户：严重短视频创作、拍摄上传的用户； 重点用户：使用短视频娱乐记录身边的趣事； 普通用户：普通浏览别人的视频。 step2:需求分析、功能设计需求：现代人“杀时间”的需求。 分析短视频的的优点、缺点及用户需求分析； 短视屏 优点 缺点 用户分类 用户需求 1 门槛低、用户多、入口全 质量差异大、运营成本高 拍摄、上推荐 贴纸/特效多，简介功能、多关注 2 直观小巧、耗费少、碎片化 拍摄、剪辑要求高 拍摄、记录生活 制作简单方便 3 信息大、强社交 同质化、创新少 观众 浏览快速简单 针对短视频的优缺点及需求扬弃； 短视屏 发挥优势 避开弱点 用户分类 满足需求 1 / 质量差异大、运营成本高 拍摄、上推荐 / 2 门槛15s 拍摄:倒计时，手机剪辑简洁化 拍摄、记录生活 左右滑动，跟随拍摄选择 3 评价、点赞、关注 小巧、便捷化管理 观众 无广告；全屏幕展示；双击收藏；点击关注，定制化推荐 step3:原型设计分析功能、使用Axure、墨刀等设计软件设计原型图(高保真)； 原型设计的目的： * 告诉程序员要做什么 * 告诉UI需如何设计 * 交互设计如何更美观 step4:项目评审在设计出产品基础上，与开发人员、运营人员、UE、UI、市场人员讨论项目可行性； 目的： 开发人员、UI人员清楚项目目的、规模及主要莫夸 开发、UI对存在漏洞提出补充； 开发、UI与产品规划时间流程； 与运营人员讨论项目是否符合市场预期。 step5 项目上线目的： 审核项目是否达标 准备市场，运营资料 解决问题 较差后台，准备查看数据，密切注意用户反馈 step6 分析数据、不断迭代 将项目分成若干小点 不断根据市场数据就差，快速反应 不断保持其在用户商店的活跃和评级 保持用户活跃度 保持团队活力","categories":[],"tags":[]},{"title":"shell 学习","slug":"shell-学习","date":"2018-03-20T06:57:34.000Z","updated":"2018-04-03T12:36:11.352Z","comments":true,"path":"2018/03/20/shell-学习/","link":"","permalink":"http://gorgegao.club/2018/03/20/shell-学习/","excerpt":"初学Shell脚本语言，了解一点。","text":"初学Shell脚本语言，了解一点。注意事项：1、执行脚本时需要执行的操作123shell #!/bin/bash echo &quot;Hello World !&quot; 2、变量在输出时需要在前加 “$”只读变量 readonly [+变量名]删除变量 unset [+变量名] shell数组 定义使用 数组名=(值1 值2 … 值n)12array_name=(value0 value1 value2 value3)echo $&#123;arry_name[@]&#125; #获取数据中所有值","categories":[],"tags":[]},{"title":"互联网长尾、闭环","slug":"互联网闭环","date":"2018-03-19T00:21:19.000Z","updated":"2018-05-23T02:33:27.907Z","comments":true,"path":"2018/03/19/互联网闭环/","link":"","permalink":"http://gorgegao.club/2018/03/19/互联网闭环/","excerpt":"看人人都是产品经理，学到两个新名词，互联网长尾时代、互联网闭环时代，mark下长尾或者长尾效应，指的是指那些原来不受到重视的销量小但种类多的产品或服务由于总量巨大，累积起来的总收益超过主流产品的现象。互联网内，指产品由引流到体验到反馈的一个闭环现象。闭环就是：引流——体验——反馈——再次引流的循环！","text":"看人人都是产品经理，学到两个新名词，互联网长尾时代、互联网闭环时代，mark下长尾或者长尾效应，指的是指那些原来不受到重视的销量小但种类多的产品或服务由于总量巨大，累积起来的总收益超过主流产品的现象。互联网内，指产品由引流到体验到反馈的一个闭环现象。闭环就是：引流——体验——反馈——再次引流的循环！ 互联网长尾长尾或者长尾效应，指的是指那些原来不受到重视的销量小但种类多的产品或服务由于总量巨大，累积起来的总收益超过主流产品的现象。 eg:以互联网电商企业为利例，即不同于传统的二八效应，传统的二八效应认为80%的销售额来源于20%的用户。而长尾效应表示一半左右的销售量来源于比较热门的商品，另外一半来源于不热门的商品。 淘宝、美团、饿了么这些互联网企业则证实了互联网企业中存在的这些长尾效应，集合零散商家与小额用户，创造超越大规模商家的利益。 因此，淘宝电商、OTO时代应该是典型的互联网长尾时代。 产品经理中看到快手是互联网长尾时代到来的时候， O2O闭环O2O闭环经常被顾名思义地理解为包办整个商业链条的所有环节而不依赖第三方。 闭环，顾名思义，形成一个完成的闭圈。互联网内，指产品由引流到体验到反馈的一个闭环现象。闭环就是：引流——体验——反馈——再次引流的循环！（From :知乎 Firmin Peng） eg:O2O线上线下产品为例，以前的O2O从团购开始，线上购买，线下消费，通过奖励补贴吸引用户继续消费。闭环的核心在于形成对每一单交易的跟踪和记录，其形式上也许不需要封闭，但是订单追踪一定要从开始到获取结束。","categories":[],"tags":[]},{"title":"HTML 复习","slug":"HTML-复习","date":"2018-03-07T11:28:54.000Z","updated":"2018-04-03T12:37:31.486Z","comments":true,"path":"2018/03/07/HTML-复习/","link":"","permalink":"http://gorgegao.club/2018/03/07/HTML-复习/","excerpt":"HTML5 一些忘记的、新加的标签复习哈~","text":"HTML5 一些忘记的、新加的标签复习哈~ 一些少见的HTML标签HTML head 标签 描述 &lt;base&gt; 定义了页面链接标签的默认链接地址 HTML 列表 标签 描述 &lt;ol&gt; 有序列表 &lt;ul&gt; 无序列表 HTML 框架 标签 描述 iframe 通过使用框架，你可以在同一个浏览器窗口中显示不止一个页面。 HTML 字符实体不间断空格(Non-breaking Space)HTML 中的常用字符实体是不间断空格(&amp;nbsp;)。 HTML5 在原生HTML基础上增加很多元素 绘图的 canvas元素 媒体播放的vedio和audio元素 本地可存储 加入新的元素actile、footer、header、nav、section 加入新的表单控件 calendar、date、time、email、url、search HTML5 的改进 新元素 新属性 完全支持 CSS3 Video 和 Audio 2D/3D 制图 本地存储 本地 SQL 数据 Web 应用","categories":[],"tags":[]},{"title":"20171119 有限状态机报告总结","slug":"20171123状态机报告总结","date":"2017-11-23T02:16:35.000Z","updated":"2018-05-23T03:19:14.856Z","comments":true,"path":"2017/11/23/20171123状态机报告总结/","link":"","permalink":"http://gorgegao.club/2017/11/23/20171123状态机报告总结/","excerpt":"找到一篇RFID和状态机的论文，感觉和我们的项目很契合，而且整个建模过程和流程可以借鉴。","text":"找到一篇RFID和状态机的论文，感觉和我们的项目很契合，而且整个建模过程和流程可以借鉴。 文献 ：基于有限状态机的 RFID 流数据过滤与清理技术 罗元剑, 姜建国, 王思叶,等. 基于有限状态机的RFID流数据过滤与清理技术[J]. 软件学报, 2014(8):1713-1728.提出了一种基于有限状态机的 RFID 流数据过滤与清理方法. 该方法利用RFID 标签数据的三元组模型(EPC,Position,Timestamp)与有限状态机理论,一方面根据信号读取位置建立等效的物理空间位置状态模型,对相邻物理空间位置状态进行合并,以降低系统对被监控对象(RFID 标签)的误读;另一方面,通过对RFID 流数据的分析,对同一物理空间位置状态与时间状态内的冗余数据进行过滤与清理. 然后交代数据处理架构及应用场景 在算法描述上 使用有效状态机模型描述阅读器状态 定义标签即状态概念 设计数据过滤与清晰算法仔细看了其算法，就是在多阅读器间读取RFID，然后将物理空间位置隔绝，然后剔除同一读写器相同状态的，更新不同状态的。 实验中 检测RFID天线增加与漏读情况测试 对距离检测进行描述 测试实际情况下的冗余数据与经过清洗后数据对比 保证数据可以有效提取，做实验验证即可 和其它实验方法作比对主要突破，其保证漏读、误读率为0，不过在距离方面其可行性有所损耗及差异。 通过实验表明：本文提出的基于有限状态机的过滤与清理方法能够有效地过滤与清理同一状态下的 RFID 标签数据,提取有效监控数据.与传统的基于时间窗口的 RFID 流数据过滤方法(文献[3,9,10])相比,该方法不仅能够从时间维度上对数据进行过滤与清理,而且能够提取特定监控时间段内的数据,同时可以从物理空间位置维度上对数据进行过滤与清理,提取有效的监控数据,并过滤掉系统外标签数据,即干扰数据。 以文献 ：基于有限状态机的 RFID 流数据过滤与清理技术 罗元剑, 姜建国, 王思叶,等. 基于有限状态机的RFID流数据过滤与清理技术[J]. 软件学报, 2014(8):1713-1728.为启发，做的思路 方向应该是有效可行但是在具体思路也有，但是考虑开题报告问题，不知道能否直接再次修改！思路1题目及方法预备：使用有限状态机对RFID进行数据过滤与清理 也可修改为基于有限状态机多流程数据交互过程 背景：两辆押运车进行转接操作时，有效数据的提取及无效数据的丢弃。对有效RFID数据的可靠性认证。 专利1：可以写基于状态码的有限状态机数据过滤(基于应用场景写)专利2：基于状态码的状态机流程转换方法(基于应用场景写) 基于有限状态创新点： 引入有限状态机对多种不同数据进行建模 引入状态码联合区多模复杂环境下状态 设计有限状态机清理算法 对有限状态机这一模型进行评价 内容思路及初步考虑1、首先将交互数据抽象为原始“三元组”，将此动态转化的流程抽象为时间自动机，然后在此基础上写时间转化与自动机转化的问题。 &lt;!-- 我们的话&lt;位置，时间，状态码&gt; &lt;状态码&gt; &lt;预警，激活状态，物体类别，位置，预警信息，预警 --&gt; 2、单独将其中的数据清理与数据过滤抽象出来， 过程： 1）RFID三元组数据模型抽象出来，我们使用的到的，根据是否为车载(位置)，是否警报(标志)、发出时间(Timestamp)、警报信息(内容)、网络位置(Ip)建立五元组； 2）基于状态码将其统一划分，为其标定各种意义； 3）流数据处理架构：将监控系统抽象为数据监控过程 3、为其建立有限状态机模型 小论文中建立状态机转换模型，对其进行无效数据清理 4、定义 无效标签 有效标签 两类 正常读取标签、错误识别标签、漏读取标签、误读取标签 标签数据有效性及标签数据无效性等定义 5、然后再此过程中建立一种对数据的清理模型！ 算法设计到基于状态码的剔除数据方法 6、扩展 涉及到的算法的话考虑 只考虑合适使用服务器数据与本地数据的替换，对其进行可信处理！(新旧状态替换)，难点在于其中的状态可信及数据延迟问题！ 7、实验 然后，实验做模拟数据处理，在10个标签或者N个标签下其误识别率和正确识别率的过程！ 扩展：相信云端数据还是本地数据！思路2：考虑入车出车过程，抽象为一个RFID状态机转化的过程 考虑入车出车过程，将其抽象为一个RFID状态机转化的过程！然后在此基础上进行数据转换！ 考虑在其中是不是还存在另外一个思路：有限状态机的流程处理基有限状态机的动态流程处理 1)建立RFID多远组模型，然后在模型基础上对数据进行统一规划 2)定义状态码，对不同区域事件类型进行区分 3)状态转换于状态码结合，处理动态地图与物资信息转换 4)在这边建立数据流处理框架！ 5)根据其数据转换建立数据更替交换流程！ 6)尝试抽象出一种数据流模型！ 在交换及运行过程中对数据交换的处理。(使用伪代码实现) 6)实验：以现场数据交互做模型 流程处理方面的话，使用流程处理机制与RFID状态机转换来写 一些其他类似的状态机的处理题目及思路学术： 一种基于有限状态机的RFID数据清理算法 专硕： 有限状态机在RFID多物资预警中的应用 一种基于有限状态机的数据清理的押运管理系统 将其中的数据清理方法加入应用中间加个创新点为引入状态码对时间、空间及数据进行划分，有利于多方面状态管理 一种基于有限状态机的门禁管理系统应用 这样的话是不是可以将有限状态机和门禁系统结合起来。 一种基于有限状态机的读写器确定程序 (其中有专利通过使用信号强度的方式进行判断欧式距离) 小论文(单机情况下(两台读写器)，通过有限状态机的方式进行判断)扩展讨论(联网情况下，使用云端、本地状态码综合使用！)","categories":[],"tags":[]},{"title":"多模活体检测方法验证及人脸识别验证","slug":"2017-11-22多模活体检测方法验证及人脸识别验证","date":"2017-11-22T03:51:09.000Z","updated":"2018-05-23T03:22:42.131Z","comments":true,"path":"2017/11/22/2017-11-22多模活体检测方法验证及人脸识别验证/","link":"","permalink":"http://gorgegao.club/2017/11/22/2017-11-22多模活体检测方法验证及人脸识别验证/","excerpt":"2017-11-18 08:12:15一种多模活体检测方法和评估指标方法说明，在文末附上最近对RFID及人脸识别结合方法的一种考虑；","text":"2017-11-18 08:12:15一种多模活体检测方法和评估指标方法说明，在文末附上最近对RFID及人脸识别结合方法的一种考虑； 一、多模生物特征方法1、最常见的几种生物识别方法： 指纹识别 虹膜识别 视网膜识别 面部识别 手掌几何学识别 DNA识别 声音和签字识别 [1]包桂秋,林喜荣,苏晓生,周兆英. 基于人体生物特征的身份鉴别技术发展概况[J]. 清华大学学报(自然科学版),2001,(Z1):72-76. 2、可以考虑生物特征鉴定方法： 语音身份鉴别方法 根据发声的频率和声音信号的幅值语音识别方法有依赖特定文字识别和不依赖于特定文字识别两种。 静态生物特征身份鉴别通过人脸识别对人的身份进行识别是人们最常用的也是最基本的身份鉴别方法红外感应温度图身份鉴别方法 指纹身份鉴别方法人脸和指纹结合、人脸和语音结合等方向。传统的磁卡、 IC卡、密码等身份鉴别方法面临着严峻的考验。 磁卡、 IC卡容易丢失 ,也容易被不法分子盗用 ;密码容易忘记、也可能被解密。 脉搏、心跳验证方法 启发如果为门禁的话，考虑从RFID的方面进行入手。 3、参考文献及参考内容[2]程嘉奇,谢生,毛陆虹,陈力颖. 基于UHF RFID技术的无线脉搏血氧监测系统设计[J]. 传感器与微系统,2016,35(05):70-73. 对血氧进行检测，但是感觉对生物特征进行识别，没必要那么精确，借鉴其中的检测生理特征的方式即可。使用UHF 半有源标签芯片 工作频段为 860 ～ 960 MHz 但是结构为接触式的，需要传感器直接接在手上(时间较长)，不符合门禁系统中快速便捷无接触的方案，暂时pass。 [3] 刘广伟,毛陆虹,谢生,孟庆斌,张庆荣. 一种光电反射式脉搏血氧监测方法[J]. 光电子.激光,2014,25(03):620-624. 刘广伟等人利用 2.4GHz ＲFID技术，开发出可收集患者体温和位置信息的生命体征定位系统， 可接触式的，暂时放弃。 [4] 郭京京. 基于ZIGBEE+RFID技术对搜救人员信息采集及传输的研究[J]. 中国集成电路,2013,22(08):43-45+84. 基于ZIGBEE与RFID 技术的无线自组织网络生命信息采集和传输系统 备注：ZigBee是基于IEEE802.15.4标准的低功耗局域网协议。根据国际标准规定，ZigBee技术是一种短距离、低功耗的无线通信技术。 思路来源：采用无源待机、有源激活的方式，温度传感器、压电薄膜脉搏传感器和有害气体传感器的RFID标签制成很小体积的芯片，然后做成轻便的腕式标签，无源模块用来接收激活信号，有源模块负责与读写器进行通信。 带来启发 设计一款手腕式RFID芯片与脉搏传感器相结合的方案检测是否为活体。 RFID使用无源RFID+脉搏传感器，在人进行刷脸验证时。进行多模进行验证，RFID读卡器主动识别人体身份，然后通过脉搏传感器进行数据采集，如采集通过，可发送至服务器进行活体验证比对。 方案可能存在问题 延时问题，不知道一次验证过程的时间是多少。 [5] 何芙蓉, 黄荣兵. 融合多生物特征的RFID智能身份识别系统设计[J]. 电脑知识与技术, 2014(19):4535-4537. RFID技术和生物特征识别得到了快速发展，为进一步提高身份识别的精度和效率，该文介绍了一种融合RFID和多生物特征的身份认证系统模型。 方法介绍 整个系统的工作过程描述如下：当一个人准备通过访问控制系统时，他随身携带的 RFID卡首先会被扫描，ID信息首先进行入系统暂存，同时他还需要按指纹，另外视频头拍摄到他的人脸图像将同时存储于系统，系统会对人脸和指纹提取特征并进行融合，最后系统通过 RFID卡的信息和融合的特征信息进行身份验证。 评价 单纯的使用RFID系统与人脸识别设备、指纹识别设备综合的方法，然后将每种信息都传输至主机进行考量。 其中数据流程处理方式如下： 其中数据处理流程只交代是决策层融合的方式，并未详细交代，未提及实现方法，经查证如下 简称，将结果拿出来进行判断的规则： 存在两种规则，就是OR规则和AND规则。 OR就是指 H1拒绝 ,子系统 H2 将对用户再进行一次验证 ,如果通过则确定为真实用户。 AND就是指:在这种系统中用户只有同时被子系统H1和子系统 H2接受 ,方能够被确认为真用户。 [6] 徐新萍,赵鹏,王晓民,高亚兵,彭瑞云,王德文. 基于RFID技术的多模态生物特征识别系统设计[J]. 中国体视学与图像分析,2008,(03):188-192. 采用特征多特征融合的当时进行匹配 借鉴其中方法: 借鉴其中的过程与流程： 借鉴其中的决策判断方法(多模态生物特征信息的融合) 特征层的融合 输入数据经过前端处理后对每种生物特征分别得到其特征描述向量；在进行处理特征的时候就进行决策判读是否可行。(融合效率高)。 匹配层的融合 匹配层融合过程中重要方面之一是对不同系统得出的分数进行归一化。在进行归一化以后 ,不同系统得出的分数就被映射到一个 N维的空间 ,在这个空间里再对所有的点进行分类。(据描述实现比较容易) 决策层的融合不同的单个特征可以分别进行独立的处理 , 然后进行匹配得到匹配分数, 最后通过决策融合的过程 ,将多个匹配结果经过一定的融合算法进行综合 ,得到最终的结果。 [7] 王静然. 结合人脸识别和RFID卡的考生身份认证系统的研究[D].太原理工大学,2013. 提出复合认证技术（相当于多模生物认证技术）:通过RFID卡片、密码、指纹及人脸识别方式进行验证。 采用人脸识别和卡的双重身份验证技术，实现以下三个功能 具有摄像头和读写卡器，可以拍摄人脸图像和检测到RFID卡； 能够实时的处理图像、检测人脸以及是别人脸，并快速的给出识别结果； 能够和数据库进行数据交换、完成提取、保存信息的功能。 研究内容研究了结合人脸识别和卡技术的考生身份认证系统，描述RFID技术和人脸识别技术的主要算法和实现； RFID卡技术在系统中的应用； 在身份认证算法设计上，深入分析和研究了AdaBoost人脸检测算法，通过改进的PCA技术，克服光照对目标的影响。 最后实现内容 人脸检测采用AdaBoost算法进行检测，并在的OpenCV环境下实现了AdaBoost算法，人脸识别详细描述了基本的PCA算法，利用改进的奇异值分解融合PCA算法解决了识别过程中光照的影响及单样本的问题。 最终实现了RFID和人脸识别的考生验证系统 存在备注：简介人脸检测算法的基于特征方法和基于图像方法； 脸识别算法简介： 基于OPenCV的一种人脸检测方法AdaBoost算法 4、总结 结合人脸(背景检测)、RFID、视频体重、监控方法设计一种门禁考察方法。 方法思路：考虑一种多模验证方式，尽量不使用接触式的传统指纹、掌纹等识别方式，考虑使用方式的话即将基于RFID技术的多模态生物特征识别系统设计思路之中进行扩展。 方案一硬件方案 RFID感应(读写器、天线、主机及其它相关线材等)设备一套，RFID定制标签(手环+脉搏感应器)，定制人脸识别设备一套(包括检测人脸等) 安装准备 人脸识别设备安装于门禁外侧 门禁使用单门禁人脸+RFID验证方法 RFID手环安置在员工手腕处 检测流程 进入门禁，通过RFID信息进行识别，并通过脉搏感应器将活体信息发至服务器； 服务器通过数目与RFID信息开启人脸检索RFID认证信息； 通过人脸识别检测与背景检测方法确认人脸门禁识别信息； 通过RFID+(预存)体重检测真实人信息(设置阈值，如上下范围在10kg)； 实现方案信息来源：http://www.elecfans.com/wearable/465477_a.html RFID+脉搏等感应设备 (各类手环已经有应用，但是现在实现方法仅有了解) PPG 光电容积脉搏波描记法原理 简单来说，就是反射而已，利用血液中透光率的脉动变化，折算成电信号，通过软件算法转换，对应的就是心率。 心电信号测量，类似ECG（心电图） 点类似去医院做过的心电图，腕式手表就不需要那么多数据，仅仅心率就够了。 RFID检测信息传输至服务器，只了解我们的的一套，检测信息传输到服务器，通过比对在数据库专门设计字段进行比对！ 人脸识别流程刚清楚，活体检测自己的方法暂时未实现，但是如果真实现的话建议可以直接调取阿里或者百度的库！(但是需要自己建立人脸库等方式实现) 体重检测实现也不难(小米秤等已有实现，少接口数据及设备实验) 然后其余信息交互及验证方式及业务方面实现逻辑不再赘述(也不清楚细节实现) 存在疑惑 实现的话需要以下几点(至少) 简单使用融合方法的话创新点在什么地方，如何支撑起一片论文？； 方法等只需要综合描述？不需要细节实验？ 如果需要实验的话，摊子铺的很大，做不出来的可能性很大； 建库，人脸数据库、体重库、RFID库； 方案二硬件准备 RFID感应(读写器、天线、主机及其它相关线材等)设备一套，RFID定制标签(手环+脉搏感应器)，定制人脸识别设备一套(包括检测人脸等)；视频监控设备一套(用于检测其中人数及动态预警) 安装准备 人脸识别设备安装与门禁外侧 门禁使用双门验证方法 视频监控设备安装于AB双门之间 RFID手环安置在员工手腕处 RFID其余感应设备按照双门思路布置 检测流程 进入门禁，通过RFID信息进行识别，并通过脉搏感应器将活体信息发至服务器； 服务器通过数目与信息开启人脸比对，并通过人脸识别检测与背景检测方法确认认证识别信息； 检测成功，通过A门； 在AB双门中间时，AB门先同时关闭，检测人数，确认预警信息，并通过人数、体重信息再次识别； 检测人数、体重信息成功后，使用RFID门禁卡或者是人脸OR虹膜认证方式打开B门。 难点 除RFID部分我们有思路，其它部分暂时无法实现，只有想法； 范围太大，每一部分点都很多，没有想到好的思路细化； 感觉写专利尚可，但是在论文方面，没想到什么好的点进行实现； 思路扩展(可出专利)可以基于多模生物特征进行防尾随问题检测—- 体重防尾随 —人脸识别防尾随 —-人数检测防尾随 识别思路的话还是一样的，基于上下文检测的防尾随方法使用设备一台人脸识别设备，人脸识别设备双重验证，在其中验证门禁进入人数及是否有尾随人员的确认！然后在刷脸结束后，考虑开门后，按照统计信息，进行人脸识别和比对！进行人脸识别和验证比对！ AB门设计思路，中间的摄像头进行人数统计的思路，并在中间加入地秤等检测体重，按照等级信息设置阈值进行体重人数检测！ 把人脸识别和防尾随集合起来，在人脸识别中加入人数检测算法，在刷脸人数与实际检测人数相匹配，在保证人脸识别的识别成功率。 正好也可以结合背景检测算法进行人脸检测。其完善过程可以考虑使用人脸识别算法中的人数检测和。 采用这种设置方法的话思路讲解是一部分，难点在于多模中RFID双模检测方式的说明及不同角度检测人数目的方法及整个人脸检测的方法暂时都未实现。还有就是现场设施的布置实现方案实时性及可用效率。 没有一个专门精确的点，范围太大， 结果：可较有效保证和解决门禁问题中的防尾随问题思路： 首先使用RFID与人脸识别系统对门禁进行单层验证； 其次，门禁如同枪械库使用双门进行验证，并在其双门中间安装摄像头； 最后，在中间使用摄像头与原人脸识别门禁库中进行比对，首先对人数与进门人数进行比对， 如果检测出人数目与实际人数不相符，则进行报警，实现其防尾随功能； 扩展为通过人脸识别设备建立人脸库，如果有尾随状况，则调取监控摄像头，对人脸库进行比对，获取检测抓取非人脸库的人脸，进行动态预警。 有注释，讲网络上现在存在的人脸识别门禁方法 缺点分析： 如果已经建立人脸库的话，使用单纯的视频检测人脸即可以实现；所以，需要定义应用场景为精密物资管理的门禁系统下的防尾随设计。例如枪械库，银行门禁部门，由于高安全需求及国家安防的必须，必须要求双门多模进行管理。以枪械库为例，传统的多模方式使用指纹、字迹验证人员身份，然后由专管人员进行枪支、弹药等其他关键物资进行领取、操作。在此过程中，耗费人力、物力资源较大，对尾随问题无法有效解决，如果有危险状况的发生，只能通过调取录像的方式进行检测。已经不能满足实时及时监控、实时报警的需求，在此基础上，设计RFID+人脸识别+视频监控的方式进行防尾随跟踪验证！ 人脸识别+RFID活体验证效率未知 二、人脸识别活体检测评价方法[6] 徐新萍,赵鹏,王晓民,高亚兵,彭瑞云,王德文. 基于RFID技术的多模态生物特征识别系统设计[J]. 中国体视学与图像分析,2008,(03):188-192. 借鉴其中的决策判断方法(多模态生物特征信息的融合) 特征层的融合 输入数据经过前端处理后对每种生物特征分别得到其特征描述向量；在进行处理特征的时候就进行决策判读是否可行。(融合效率高)。 匹配层的融合 匹配层融合过程中重要方面之一是对不同系统得出的分数进行归一化。在进行归一化以后 ,不同系统得出的分数就被映射到一个 N维的空间 ,在这个空间里再对所有的点进行分类。(据描述实现比较容易) 决策层的融合不同的单个特征可以分别进行独立的处理 , 然后进行匹配得到匹配分数, 最后通过决策融合的过程 ,将多个匹配结果经过一定的融合算法进行综合 ,得到最终的结果。我们按照其选择应该是选取决策层融合的方案。 人脸识别和活体检测流程概述传统的人脸识别流程： 有活体的人脸识别流程： 备注：图片来源于：[1]许晓. 基于深度学习的活体人脸检测算法研究[D].北京工业大学,2016. 结论： 从认证过程中来看，其是一个有先后顺序的过程，即先活体检测,再人脸相似度比对的过程。 问过搞图像识别的同学(李云师门)。 一般情况下流程需要训练的过程。 流程如下： 按照这一流程走过程中，即一般情况下，可以将活体检测与流程处理放在一起进行处理，如活体检测、人脸识别，即相当于迭代器，从活体检测分类器(二分类法)获得的特征，送到人脸匹配分类器中进行下一步处理。 结论 应该是一种机器学习的过程进行选取，而非是简单的找数学模型公式 探寻三种方法(前两种自己摸索，后一种采用一点机器学习的方法，但是未找到多模的方式)在流程处理过程中，假设我们从人脸中将活体检测分开，或者从多模生物特征进行选取的话，有一些公式可以进行参考，但是也存在着其局限性。 公式1：符号函数 当x&gt;0，sign(x)=1;当x=0，sign(x)=0; 当x&lt;0符号函数的话简单，无脑，但是这种同时需要加几种判断，换言之，直接可以用if else判断来替代！ if (faceDection) if(aliveDetection&gt;=90%) //if(AliveDetection==true) if(FaceMatchSuccess) do others 评价：使用此种方法的话，简单无脑粗暴，但是真的没有创新点，而且还是基于数据时整形的才行，如果是98.5%等比例的话现在考虑的方法只有加阈值判断进行分析，但是阈值现在只有手动去设置，不科学，不符合做研究的标准。 *如果需要去对这个阈值进行比较权威的获取的话，需要采取数据加入到机器学习中进行训练获取* 面临的问题有以下： * 没有数据源 * 暂时没有合适的方法进行训练 * 训练过程不熟悉 * 训练结果准确度未知 公式2：p=λp1+(1-λ)p1 λ为其中的权重评价指标 权重的话也是需要通过训练或者是其他方法去获取这个参数，这个参数如果不是自己定义的话，暂时了解到的方法只有通过大量的数据，然后通过监督学习的方式将其训练出来！ 同理，面对的问题和之前一致，就是将数据，方法找出来，然后通过某种方法(暂时了解到的就是通过机器学习方面训练的方法进行获取) 公式3： 机器学习准确率公式 单指标的时候的准确率与召回率：http://www.cnblogs.com/bluepoint2009/archive/2012/09/18/precision-recall-f_measures.html !--快速理解博客：https://blog.argcv.com/articles/1036.c-- 准确率(accuracy),其定义是: 对于给定的测试数据集，分类器正确分类的样本数与总样本数之比。也就是损失函数是0-1损失时测试数据集上的准确率。 以人脸识别中活体检测为例的话： 假设样本有总样本100个，活体有20个(正类)，非活体80个(负类)。 现在抽取其中50个，检测出其中20个为活体，另外将其他30个非活体也检测出来，进行评估其标准。 准确率：Accuracy=(50+20)/100=70%;(30个判断错误的剔除) 定义正类(相关 TP)，负类(无关 FP)，被检索到(Retrieved FN)，未被检索到(TN) 正类(相关 Relevant) 负类(无关 NonRelevant) 被检索到(Retrieved) true positives(活体) false positives(假冒) 未被检索到(Not Retrieved) false negatives(活体检测为假冒) true negatives(非活体检测为非活体) 正类(相关 Relevant) 负类(无关 NonRelevant) 被检索到(Retrieved) 20(TP) 30(FP) 未被检索到(Not Retrieved) 0(FN) 50(TN) 在单一特征的时候，准确度和召回率：其中精确率 P=TP/(TP+FP)=20/(20+30)=40% 得到结果中，正确的人(也就是活体)占有的比例其中召回率 R=TP/(TP+FN)=20/(20+0)=100% 得到的活体占所有活体的比例 F1值就是精确值和召回率的调和均值 假设对准确率和召回率的比例相等，不设置比例因子的话： F1=2P*R/(P+R)=2TP/(2TP+FP+FN)备注：F1综合评价精确率和召回率。 如果对精确率和召回率要求较高的话，可以考虑设置参数β进行设置。 在我们活体检测中，就需要FN(精确率要高，同时召回率也要高)此处暂时不加以详细讨论。 设计思路如下： if (faceDection) if(aliveDetection&gt;=70%) //通过活体检测的阈值，即可认为为活体 if(FaceMatch&gt;=70%) //通过人脸检测的阈值，即可认为为活体 do P、R、F1公式判断 如果考虑的话，需要从此方面去考虑更加深入和靠谱一点。 但是跟多的方法的话是考虑特征融合方面的知识，在这方面考虑的较少。因为我们这个是一个完整的过程，一般会在分类器中加迭代的方式进行考虑，在这方面的考虑较少，如果真这样做的话，就是相当于在前面做一次机器学习特征选择的过程，后面再做一次机器学习，特征选择，分类器迭代的过程，感觉很冗余。 From:与李云师门的某人经验之谈 总结：这种方法似乎都需要对数学公式，找一种权值、或者是类似的参数进行判断，但是这类参数的获取的话又需要一个机器学习的过程进行，从数据获取–&gt;数据训练方法–&gt;实验训练数据–&gt;获取结果，emmm，总而言之，感觉如果从这一套方法出的话，过程会比较漫长，一个月时间很难出东西出来！一年的话，估计也够呛！ 难点及问题 数据采集上 现在我们只有一台人脸识别设备，只能获取二值化数据(比对成功或者失败)，不能获取其验证的准确率，要数据的话，得从头开始我们自己找方法进行多模特征提取后再做验证。 数据的话现在我了解的话得用监督学习的过程，自己给数据打标签，然后在对数据进行训练处理。(大致了解了下流程，可能是这样，针对一个人，我们需要采集的数据集方面，人脸信息、活体信息情况正确与否打上标签，进行训练的过程) 方法暂时未了解 使用训练方法，之前我都到的几篇文章是SVM方法，那个是一种二分类法！而且是验证错误或者正确的方法。 我们这边需要使用的方法暂时也没有 启发3：物特征数据融合的研究主要集中在决策层上 ,不同的单个特征分别进行独立的处理，然后进行匹配，得到匹配分数，最后经过一定的融合算法综合得到结果。可采用的融合算法有许多种，如多数投票法、加法和乘法法则、K-NN分类器 、SVM、贝叶斯决策 、支持向量机 、决策树等。 工具未配齐emmm,算是深度学习或者是机器学习方面的框架流程吧，现在只是初步了解他们有在用python的pytorch框架和基于C++的caffe深度学习框架，我们自己暂时未定。 pytorch是一个python优先的深度学习框架，基于python的，是一个和tensorflow，Caffe，MXnet一样，非常底层的框架 caffe是一个清晰，可读性高，快速的深度学习框架 一个用C++编写的深度学习框架 对这方面的研究还需要深入 需要从理论知识方面入手，而且初步感觉，图像和机器学习紧密相连，分不开。 在深入方面的话，现在没基础，可以考虑从方法中直接使用稍微难一点的？ 而且有种感觉，现在我们做的这个范围，太大了，是不是需要从刚开始的图像识别开始，一步步的逐渐走下去，直接做检测结果方面的话，没有数据，没有经验，前面一无所知，操作起来困难比较大，如果要真做的话相当于要一个人把所有流程摸一遍，难度很大！ 在时间方面和实力方面有点忧虑！ 时间点的话，想尽早吧论文搞定，按原计划的话，今年年底，按这种方法做的话难度有点大。时间方面，因为暂时无法规划去做，快速出论文的可能性不高！ 实例及积累方面暂时需要再加把劲，暂时积累太少！","categories":[],"tags":[{"name":"一种多模活体检测方法和评估指标方法说明","slug":"一种多模活体检测方法和评估指标方法说明","permalink":"http://gorgegao.club/tags/一种多模活体检测方法和评估指标方法说明/"}]},{"title":"RFID位置感知技术学习","slug":"RFID位置感知技术学习","date":"2017-11-13T00:39:43.000Z","updated":"2018-05-23T03:13:57.094Z","comments":true,"path":"2017/11/13/RFID位置感知技术学习/","link":"","permalink":"http://gorgegao.club/2017/11/13/RFID位置感知技术学习/","excerpt":"RFID 标签位置感知技术综述作者：邱兰馨, 黄樟钦, 梁笑轩摘要总结：位置信息中利用GPS、手机等其他设备可以进行定位，但室内“最后一米”定位采用RFID更为精确。这篇文章从 参数提取 和 位置估计 方面总结RFID标签位置感知技术关键，还介绍RFID的应用及未来发展方向。作者：yacogo链接：http://www.jianshu.com/p/abaff828100d來源：简书著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。 英文名：Indoor location-aware technology for RFID tag:","text":"RFID 标签位置感知技术综述作者：邱兰馨, 黄樟钦, 梁笑轩摘要总结：位置信息中利用GPS、手机等其他设备可以进行定位，但室内“最后一米”定位采用RFID更为精确。这篇文章从 参数提取 和 位置估计 方面总结RFID标签位置感知技术关键，还介绍RFID的应用及未来发展方向。作者：yacogo链接：http://www.jianshu.com/p/abaff828100d來源：简书著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。 英文名：Indoor location-aware technology for RFID tag: 名次解释： 名次 英文释义 解释 基站 base station RFID阅读器 待测目标 target RFID标签 锚节点 anchor 已知位置的标签 内容： 前提条件：基站位置已知（感应出的结果是基站的相对位置） 措施/方法： 基站在全局坐标系位置已知时，标签位置结果转换至全局坐标系下，现有 RFID 位置感知方法，多利用 RFID 系统通信过程中阅读器所接收到的标签响应情况，或是标签反射链路的信道参数来估计和反演标签所处的空间位置，主要包括参数提取和位置估计 参数提取研究概述早期：多采用标签的响应结果作为参数信息，根据 RFID 系统通信距离的有限性来大致估计标签距离。进阶：随着对定位准确度需求的提升，到达时延（ ToA/TDoA）、到达角度（ AoA）、到达信号强度（ RSS）、到达相位（ PoA/PDoA）等反映标签所处环境信息的信道参数陆续被用于反演标签位置。超阶：对多元参数进行综合分析，或是采用多径谱（ mulitpath profile） 作为参数信息的位置感知方法则显示出了更好的抗干扰能力。 最基本，通过判断标签在或者不在进行判断。实例运用：在博物馆内的自动语音导航，通过判断标签在或者不在进行标签相对位置估计。 通过RFID系统为用户提供的信号接收强度、到达相位等通道信息参数，进行更加深入、精准的研究。 2.1 信号到达时间 Bechteler提出 SAW ID-tags 方法利用信号到达时间（ToA). 计算距离： d=cτ&lt;sub&gt;n&lt;/sub&gt; 注：c为光速; τ标签发射信号的时间与该信号到达阅读器的时间差。 Stezer采用标签信号到达多个阅读器之间的相对时间差，分别求出标签到阅读器的相对距离，再根据阅读器之间已知的位置关系求解绝对距离。 评论：此种方法要求时间测量到达纳秒级，而且要实现时钟同步，实际情况中很难实现 2.2 信号接收强度 根据 Friis 电磁波自由空间传播模型，接收信号强度与标签-阅读器之间的距离 d 的四次方呈反比. 根据统计的对数距离路径损耗模型有: P(bB)=P0(dB)+10nlg(d/d0)+Xσ(dB) 评论：基于接收信号强度的位置感知方法是目前最为普遍的 位置估计研究概述由参数信息反演标签位置这一处理过程和相应的处理方法，可以大致归纳为几何估计法、指纹估计法、成本函数最小化和贝叶斯估计法四类。总体思路都是在空间内布置多个读卡器，根据读卡器强度参数确定位置。 几何估计法：计法借助阅读器和标签间的距离或角度关系求解非线性方程组来计算目标位置。 借鉴无线局域网定位原理为 RFID 位置感知提供了研究思路。 成本函数最小化估计法全息图谱方法、为代表。 代价函数最小化，将空间分成W*L个像素点并以Xsub(w,j)代表（w,l)处的位置 贝叶斯估计法:在移动轨迹跟踪中有较为广泛的应用 指纹估计发：建立指纹库，先根据测试数据、信号强度数据建立信号强度、信号强度值的概率分布状况，之后将待测标签的参数信息与待测标签与指纹库的信息进行匹配，在通过选中的参考标签对已知位置估计。 （匹配算法可根据机器学习只能怪的KNN、最大期望估计、支持向量机估计等） 其它相关技术除参数信息提取准确度、位置估计方法的有效性外，RFID位置感应技术还收到技术本省的影响和制约，如防碰撞协议，远距离通信技术和标签技术。 ####### 链路及防碰撞协议RFID是无线通信技术，由阅读器经过天线发送符合协议的电磁波唤醒标签，标签返回数据信息给阅读器。 标签天线的辐射方向往往在某个方向强，其它方向弱；但是一般理论上，都认为读卡器天线是全向的信号强度相同。 多个阅读器同时发送时信号碰撞问题导致信息采样缺失并给环境带来额外的射频干扰。 多个标签在同一时隙向阅读器发送信息，标签间也会产生冲突； 大规模环境下标签防碰撞方法对位置感知效率和精度也有重要影响。 ####### 远距离通信技术 通信距离较近是制约RFID位置感知技术的重要原因（无源的）采用高频10~11.1GHZ作为通信测试平台，影响较小。 ####### 标签技术 有源、无源、半有源标签等。 WISP标签是一种可编程的半有源标签，利用接受到的阅读器信号为自身集成的光学或声学传感器提供所需能量，从而利用可见光或超声波作为辅助信息进行读卡器感知，实现读卡器的感应。 RFID应用前景通过 RFID 位置感知技术获得贴标物体或人员的位置信息能够应用在许多实际场合中，大致可分为基于位置的自动化控制及服务、目标搜索与监控、活动识别与安全、增强现实及人机交互等。在控制方面， Wang 等[56]利用标签信息判断物体形状使机器人实现自动抓取；在服务方面，文献[5]根据 RFID 的响应范围，为靠近相应标签并持有专用 RFID 阅读器的游客自动提供展品的语音介绍。利用货架商品的位置变化，对消费者的行为进行分析挖掘，从而判断消费者对不同商品的偏好程度；在可视化方面， Malla 等[57]借助标签位置感知构建室内空间地图，并结合增强现实技术描绘和重建室内环境。 总结在具体实施过程中，通常根据应用场景的具体情况，从准确度、精确度、实时性、系统成本等方面来综合选择合适的参数及估计方法。","categories":[],"tags":[]},{"title":"活体检测之基于运动一致性的检测方法","slug":"20171019 活体检测","date":"2017-10-18T23:48:46.000Z","updated":"2018-05-23T03:24:06.198Z","comments":true,"path":"2017/10/19/20171019 活体检测/","link":"","permalink":"http://gorgegao.club/2017/10/19/20171019 活体检测/","excerpt":"18号的活体检测论文看了一半，所以在这里补充完整，现在思路在看的时候有所调整，基于背景一致的方法迎合下金老师的口味，然后在庵后现在看的动作方面的活体检测方法感觉一般，不是很偏重于实践，还可以再找找，然后自己想看的傅里叶频谱分析法和静默活体检测还没有开始看，慌张慌张，加油加油，干宽看完背景的，看傅里叶的和静默活体的，然后抽时间再研究下百度接口、阿里接口有木有现成的张嘴、眨眼的检测方式","text":"18号的活体检测论文看了一半，所以在这里补充完整，现在思路在看的时候有所调整，基于背景一致的方法迎合下金老师的口味，然后在庵后现在看的动作方面的活体检测方法感觉一般，不是很偏重于实践，还可以再找找，然后自己想看的傅里叶频谱分析法和静默活体检测还没有开始看，慌张慌张，加油加油，干宽看完背景的，看傅里叶的和静默活体的，然后抽时间再研究下百度接口、阿里接口有木有现成的张嘴、眨眼的检测方式 来源：孙霖. 人脸识别中的活体检测技术研究[D].浙江大学,2010.基于活体人脸的场景上下文线索分析 当假冒视频用其他显示设备再人脸认证系统的摄像头前回放时，摄像头所拍摄的人脸周围的区域将包括假冒视频的背景、部分显示设备等，而对活体检测人脸来说，人脸周围应该是识别系统的工作场所背景，故假冒视频中人脸周围部分的图像和人脸认证系统所在的工作背景图像的不同可作为检测假冒视频的依据。换句话说，一般人脸识别设备将安装在固定的场所进行人脸的识别、检测，其背部主体环境将不会发生改变，而作为攻击的照片或者视频一般很难达到背景与人脸认证系统背景完全相似，所以，可以将背景作为上下文线索，检测是否为伪造攻击手段。 方法概述 系统初始化，拍摄一张图像作为人脸识别系统运行地的参考场景 对输入的脸部视频进行人脸检测 提取场景上下文线索(包括选择上下文线索区域和提取场景特征两个区域) 比对场景上下文线索提取场景上下文线索中包含选择场景上下文线索区域和提取场景特点特征点两个子步骤。 场景上下文线的提取算法 场景上下文线索的选取因为人的上侧脸的左右两侧小区域易受发型影响切局人脸较远的区域，欺骗照片和视频的场景可能不在该区域，所以选取人脸左右两侧的小块区域作为场景的线索。R为上下文线索区域，R高于人脸高相同，宽为人脸宽d的1/4,是人脸周围区域中获取视频假冒攻击线索的关键区域(疑问，脸大怎么办？)。备注：为防止头发、耳朵包括在场景上下文线索区域中，先将人脸区域的宽度分别向左右扩展d/4。 尺度空间极值点检测计算机视觉通过选取图像中物体关键点描述局部特征，广泛地应用在图像匹配、物体识别、图像检索等方面。关键点的局部特赠可以稳定的提取物体的关键信息，快速识别其中的物体。D.G.Lowe提出一种多尺度GAussian函数差的卷积中极值来选择图像中关键点的方法，该方法通过建立重采用图像金字塔，快速有效的选取关键点。 关键点的选取方法(未看懂！！！！)图像I(x,y)的尺度空间L(x,y,σ)定义为多尺度的高斯函数G(x,y,σ)和图像I(x,y)的卷积，D(x,y,σ)中的极值点的检测时将其和周围8个相邻点、尺度增大方向的相邻尺度上的9个点和尺度减小方向上的9个点比较，在数值上都小的话，称为极值点。 场景特征点的提取场景选择减少噪声(光线改变等因素)的干扰，在该篇文章中提取图像中若干个有代表性、信息丰富的关键点来表征场景—-背景特征点。可以降低非关键点对背景比对的影响；降低光线变化对相同背景的影响；减少特征计算。 问题—&gt;寻找区域R中稳定的特征点，方法：使用在图像相邻尺度差上检测局部极值点的方法。(尺度空间上极值点具有尺度不变性、独特性、对三维视点和光线变化有较强的鲁棒性，在10年时就已经成功的应用在图像匹配、物体识别、图像检索方面。) 措施—&gt;1）每一帧检测的极值点数目是不同的，将极值点数目固定为N(减少场景比对的计算量，使其更稳定)。 2）将区域R划分为ΛN* ΛM的网格，在每一个网格的宽度啊和高度为d/2ΛN和d/2ΛM。 3）尺度空间上极值点的搜索时在每个网络上一次。尺度空间上极值点的搜索最多只选择一个特征点。 4）如果所有网格都遍历了，但是特征点的数目少于N，那我们在不含有尺度空间上极值点的网格中选取最大梯度值的点位特征点。特征点选取算法：输入：图像Ii和外部场景图像IR输出：场景特征点Piif 在图像Ii中检测到脸；then 在Ii中检测场景区域与人脸； 初始化所有跟踪标记–false and fiducial 点的标记；fiducial_flagm,n-false for all m=0…ΛN-1 and n=0…ΛN-1 初始化调整全部表格的A&lt;sub&gt;m,n&lt;/sub&gt;， for all all m=0...Λ&lt;sub&gt;N&lt;/sub&gt;-1 and n=0...Λ&lt;sub&gt;N&lt;/sub&gt;-1 while number(Pi","categories":[],"tags":[{"name":"活体检测论文初识","slug":"活体检测论文初识","permalink":"http://gorgegao.club/tags/活体检测论文初识/"}]},{"title":"活体检测论文汇报","slug":"20171015 活体检测汇报","date":"2017-10-16T00:25:43.000Z","updated":"2018-05-23T03:23:36.082Z","comments":true,"path":"2017/10/16/20171015 活体检测汇报/","link":"","permalink":"http://gorgegao.club/2017/10/16/20171015 活体检测汇报/","excerpt":"汇报内容：最近看论文及资料： [1]杨健伟. 面向人脸识别的人脸活体检测方法研究[D].北京邮电大学,2014. [2]陆成学. 人脸认证应用中活体检测技术探讨[J]. 中国金融电脑,2017,(08):89-90. [3]盘海玲. 人脸识别系统中活体检测技术[J]. 科技资讯 [4]孙霖. 人脸识别中的活体检测技术研究[D].浙江大学,2010. [5]甘俊英,刘呈云,李山路. 多颜色空间中三正交平面的WLDLBP活体人脸检测算法[J]. 五邑大学学报(自然科学版),2017,31(02):14-19. 知乎—活体检测资料 对其进行总结，并进行基础知识介绍。","text":"汇报内容：最近看论文及资料： [1]杨健伟. 面向人脸识别的人脸活体检测方法研究[D].北京邮电大学,2014. [2]陆成学. 人脸认证应用中活体检测技术探讨[J]. 中国金融电脑,2017,(08):89-90. [3]盘海玲. 人脸识别系统中活体检测技术[J]. 科技资讯 [4]孙霖. 人脸识别中的活体检测技术研究[D].浙江大学,2010. [5]甘俊英,刘呈云,李山路. 多颜色空间中三正交平面的WLDLBP活体人脸检测算法[J]. 五邑大学学报(自然科学版),2017,31(02):14-19. 知乎—活体检测资料 对其进行总结，并进行基础知识介绍。 活体检测定义： 活体检测技术是基于生物特征识别的人脸识别技术中用于鉴别识别对象是否为活体的重要技术手段，是防范照片、视频、模型等手段破解人脸识别系统的重要保障. 活体检测是用于辨别人脸的真伪，保证人脸识别系统稳定并安全的运行。 活体检测的功能就是辨别其是否为“真实的人脸”，识别假脸，防止他人因盗用他人照片等方式攻击人脸识别系统。 活体检测攻击方式在活体检测中的假冒攻击一般分有 照片攻击; 视频攻击; 3D模型攻击; 通过人+照片处理，视频处理等衍生攻击手段。 注：这些攻击手段部分可以通过现有的人脸识别系统判别，但很多假冒的攻击方式仍不能处理。 存在不足之处 检测方式能识别一道两种不同的手段，综合性一般，检测方式用户体验性不同。 以现在的眨眼为例，能识别正常用户是活体，但是对真脸照片+背后动作无防范； 基于纹理的方法，一般对低质量的照片防范较好，高质量的平板成像等攻击防范较差。 *实例：* 以支付宝人脸登录系统为例进行活体检测功能进行测试，对正常的活体人脸可以正常识别，识别成功率也极高；同时对单纯的照片及无眨眼活动的视频，因无眨眼这一活体检测措施，活体检测未通过；但是对于有眨眼活动合法用户视频、合法用户照片加非合法用户眨眼等方式，活体检测依旧通过。 17年315晚会，人脸识别被曝存在隐患，主持人现场凭借两部手机及一个换脸APP,&quot;攻破&quot;人脸识别系统。 现在有的检测方法 基于微纹理方法： 依据：利用假人脸经过二次采集或多次采集呈现出于真人脸图片在纹理细节上的差异(如真实形状和局部高光的差异等) 方法： (1)傅里叶频谱分析，人脸照片尺寸小于这是人脸尺寸，同时照片是平面的，其在频域中的高频分量比真人脸照片少；打印的照片再时间上不存在局部运动，其在频域上的变化在时域上很小； 傅里叶频谱分析理解：照片是平面的，所以照片的高频分量应该小于活体人脸成像，其次如果照片放置在相机前，因为脸部缺少表情变化，所以频率分量的标准差应该很小，活体检测人脸和普通照片在频域上的差异比较。即在很短的一段时间内局部表情等变化有幅度变化，而照片则没有 (2)考虑图像的空间信息，将频域特征转化为空域特征来分析，真人脸具有三维结构，假人脸(照片)是二维的； (3)真人脸的表面粗糙度和照片的粗糙度不同，提取基于Lambertain反射模型的漫反射区分方法，对输入的图像进行平滑，通过高斯滤波提取图像的DoG特征； (4)利用图像多尺度和多区域的LBP特征进行二元SVM分类的方法区分真伪； 性能描述：比较重要，但是容易受到光照、图像分辨率等的影响，在视频攻击的时候效果也较差。 基于运动信息 依据：从视频中提取人脸的特定的运动信息以判定真假人脸。 方法： (1)利用眨眼运动、嘴部运动，使用常规的动态规划算法完区分推理； (2)通过人脸多个部件的时序运动信息来做帧间人脸的判定，人脸的中心区域要比周边的区域运动幅度更大，用光流法来估计； 邓刚等人提出眨眼检测活体，该方法将眼睛状态分为睁开和闭住连个状态，通过一个睁开和闭住眼睛的二类SVM分类器判断，训练样本是睁眼和闭住的眼睛。如果分类器输出结果为闭住的眼睛，那么系统为活体。 (3)通过分析嘴唇的运动是否和阅读一段文本时的嘴型是否匹配来判断真伪。(需要有一种稳定的人脸及嘴部检测定位算法及用户的配合) (4)通过结合视频和音频一起配合。 (5)基于光流+人脸点头或晃动，光流运动包含平移、旋转、移动、摆动四个基本类型，2D、3D物体在摆动上方面差异很大，所以根据摇头等摆动幅度较大的方式检测。 性能描述：这是目前现有移动端商用技术中应用最广的，大多采用随机指令进行交互；但是只要将合法用户的人脸图片的嘴部、眼部等需要验证的区域掏并在照片后作出相应的动作即可破解。该方法对用户的交互要求较高，而且欺骗成本较低。 基于多光谱 依据：基于皮肤和其它材质在光谱反射率上的差异判断真假人脸。基于多光谱成像的方法旨在从可见光波段之外找到更加有效的波段组合，使真人脸和伪造人脸呈现较大差异，从而进行判断区分。 方法描述： (1)利用红外成像技术，选取两个波段结合可见光成像进行人脸伪装检测； (2)使用850nm的近红外光，排除不可控的可见光，在活体检测同时进行人脸检测； (3)选取多个波段用于人脸采集，并将数据投影到一个二维空间，使用线性判别分析(LDA)区分真伪。 性能描述:检测方法有效，但是对擦剂条件要求比较严格，而且呈现出的多光谱图像用户体验较差，成本高于可见光系统； 基于三维成像恢复 依据：人脸具有三维结构，照片等则无，选取运动中的几帧图片，根据关键点、关键帧，恢复初始人脸结构，然后对人脸结构进行配准，如果是真人脸时，恢复出正常人脸，但是如果是照片时，犹豫在角度上差异等无法直接恢复，视频的话，也由于扁平的图像导致恢复的结构有问题； 基于静默活体检测 依据：在人脸活性检测的同时，面部会有微小的习惯性动作，如眼皮和眼球的律动、眨眼、嘴唇及其周边面颊的伸缩等进行甄别； 性能描述：在人面部无表情动作时检测效率低下，会受光线等其他因素的影响备注：具体方法暂无，通过知乎寻找，在实际应用中，我司人脸识别设备似乎也用的是该种方法 以南京某厂Android活体检测设备为例，疑似采用静默活体检测方式，在人脸无明显表情变化时，同样无法进行有效的人脸识别活动，经常会出现无法检测出人脸的状况。 基于多种特征融合 依据：将上述几种方法融合 方法描述： (1)通过结合运动信息和纹理信息进行检测，因为纹理信息的方法无法处理高质量(高分辨率)的攻击，运动交互方法至少可以保证检测对象是活体; (2)使用非刚体运动–&gt;人脸–&gt;背景一致性+图像条带效应，前背景一致性在伪造的人脸照片比较明显； (3)融合运动相关分析和人脸纹理分析，提取LBP特征通过分数层融合进行最终辨别真伪。 性能描述：这类方法往往在机理上形成互补，检测率较高，但是平均处理时间较大，对硬件的要求较高。 补充：陆成学也提出两种方案： 提出两种扩展方式 基于可见光+近红外双目异质摄像头+眼周微纹理分析法红外直接排除照片视频攻击，(照片和Pad在近红外下成像差甚至无法成像)；眼周包含信息最丰富且辨识度最高，目前的人脸面具，重构时眼部微纹理不易构造。 基于眼纹区域的活体检测技术眼纹：位于眼白区域，指人的眼睛中去除眼睛虹膜和瞳孔的区域，含大量纹理信息。方案：被检测者先录制视频，借助图像增强技术，加强眼白的纹理信息。即获取图像并检测眼睛位置–&gt;眼白分割–&gt;增强眼白的问题信息–&gt;检测眼白中感兴趣的角点–&gt;在角点周围提取特征–&gt;判断是否为活体检测方法：由于图片和预先录制好的视频眼睛纹理信息不清晰，录制相差很多，可防止攻击，而且模型精确到这般精细又提升很大难度。 以后要做的方向要做鲁棒性好的好体检测手段需要注意： 实时处理数据； 受光照、光线等外界影响小； 用户界面自然，交互少； 欺骗代价尽可能搞(不能简单的使用照片等攻击识别，哪怕是用模型也要用昂贵真实度高的来破解)； 在用户配合上尽可能容易；在设备上尽可能简单。 对此，在静默活体方面，现在正在找类似的论文看看，是基于人脸型变化的，感觉可能会更加符合实际检测情况。 存在优势：只要站在面前，就可以进行检测，用户简单，方便； 劣势：如果检测期间，无表情变化，则无反应；能监测照片、简易3d模型，对于视频，还有照片+人脸组合的状况未知。 补充人脸活体检测数据库：南京航空大学的NUAA数据库、Idiap的PRINT-ATTACK数据库、张洪科院自动化研究所的CASIA-FASD数据库、Idiap的新数据库REPLAY-ATTACK。 活体检测技术性能评估度量攻击方法的安全性和活体检测的性能，需要合适的方法，常见的性能度量指标有错误拒绝率(False reject rate,FRR)、错误接受率(False accept rate,FAR)、等错误率(Error equal rate,EER)、获取错误率和平均处理时间等。 活体检测方法(L)指标： L错误拒绝率(LFRR) L错误接受率(LFAR) L获取错误率(Failure to acquire) L平均处理时间(Mean transaction time) 活体检测系统(S)评估的总指标 S错误拒绝率(SFRR) S错误接收率(SFAR) S错误获取率(Failure to acquire) S平均处理时间(Mean transaction time)","categories":[],"tags":[{"name":"活体检测资料","slug":"活体检测资料","permalink":"http://gorgegao.club/tags/活体检测资料/"}]},{"title":"活体检测论文","slug":"20171009 -活体检测1","date":"2017-09-21T01:05:54.000Z","updated":"2017-10-16T00:28:44.497Z","comments":true,"path":"2017/09/21/20171009 -活体检测1/","link":"","permalink":"http://gorgegao.club/2017/09/21/20171009 -活体检测1/","excerpt":"18日，与金老师讨论人脸识别问题，讨论深入点，在尾随问题中的人数识别需要结合人体型识别问题，进行深入的研究，而下一步需要做的就是把设计到在环境中统计人数的论文或者是识别人形的论文全部拿出来研究一番，在看完论文基础上继续进行图像识别，人数检测方面的研究。(此方面设计主要为图像识别方向) 同时，金老师又一次提到人脸识别中的活体检测问题，何为金老师说的活体检测，即在人脸识别中，需要通过眨眨眼、张张嘴等问题证明是个活人，从而避免是照片等产生的攻击。","text":"18日，与金老师讨论人脸识别问题，讨论深入点，在尾随问题中的人数识别需要结合人体型识别问题，进行深入的研究，而下一步需要做的就是把设计到在环境中统计人数的论文或者是识别人形的论文全部拿出来研究一番，在看完论文基础上继续进行图像识别，人数检测方面的研究。(此方面设计主要为图像识别方向) 同时，金老师又一次提到人脸识别中的活体检测问题，何为金老师说的活体检测，即在人脸识别中，需要通过眨眨眼、张张嘴等问题证明是个活人，从而避免是照片等产生的攻击。 人脸识别及活体检测概述人脸识别是一种基于人的脸部特征信息进行身份认证的生物特征识别技术。它集成了人工智能、机器识别、机器学习、模型理论、视频图像处理等多种专业技术。人脸识别用摄像头采集含有人脸的图像或视频流，并自动在图像中检测人脸，进而对检测到的人脸进行脸部识别。人脸识别主要分四步完成：人脸图像采集及检测、人脸图像预处理、人脸图像特征提取、匹配与识别。由于人脸比指纹等视觉辨识度更高，所以“刷脸”的应用前景更广阔。人脸识别具有自然性和非接触性，可以快捷、精准、卫生地进行身份认定，避免个人信息泄露，并能隐蔽使用。人脸识别能够应对复杂的光照并支持多种人脸姿态，可以精确眉毛、眼睛、鼻子、嘴巴、脸部轮廓等面部关键区域位置，制成独一无二的“面具”，以便通过已存“面具”和待识“面具”的快速比对，实现准确识别。 人脸识别也具有不可复制性，能从几百项脸部特征中找出识别对象。人脸识别技术已在智能门禁、门锁、考勤、电脑登录远程认证、人脸支付、特殊人物识别等方面有广泛应用。对此，首先进行百度“人脸活体检测”进行查询。 人脸识别中活体检测是眨眼判别、嘴部张合判别、视差分析方法等区分照片与真实人脸，活体检测技术在于辨别人脸的真伪，保证人脸识别系统稳定并安全的运行。 文章内容来源：杨健伟. 面向人脸识别的人脸活体检测方法研究[D].北京邮电大学,2014. 研究内容：研究如何利用视频图像数据进行有效的活体检测，首先了解伪造人脸的类型及其特点。(真实的人脸是通过摄像头拍摄真人得到，伪造的人脸需要至少假人脸的制作和二次采集)。因此，区分真人和伪造脸的挂架在于找到这两步对采集到的人脸产生了那些影响。主要区别在于以下几个方面： 图像纹理不同：伪造的人脸图像必须经过二次采集甚至多次采集，图像的纹理信息会因为多种因素发生违反常理的变化。变化来源于图像阴影、图像模糊、图像高光 三维结构不同：纸质打印中照片无论如何折叠。都无法模拟出正式的人脸形状。正式人脸和纸质人脸的图像的三维结构便可有效进行活体检测。 运动模式不同：人脸运动模式(各种表情和动作)、人脸和背景之间的相对运动模式。 针对不同的攻击方法，响应的关键技术有差异： 图像纹理： 图像阴影变化 图像模糊 图像高光基于图像纹理的活体检测方法成功与否依赖于两个关键技术：(1)局部差异定位 (2)纹理特征描述。关键点在于找到表达真假人脸在纹理上的差异的描述子 人脸三维结构：三维结构需要从多张不同视角的人脸图像中回复人脸的三维结构，目前三维重建的方法主要分为稠密重建和稀疏重建。对于活体检测应用，使用稀疏重建得到的人脸结构信息足够区分真假人脸，需要的关键技术为(1)人脸的关键定位：需要适应人脸的角度变化，遮挡及表情等因素(2)参数估计：包括摄像机的内参估计及两张人脸图像的变换参数估计，在得打摄像机的内参之后便可以根据两张不同的视角下人脸关键点的位置信息估计出人脸结构变换系数。补充：目前人脸关键定位方法包括主动弯管模型(AAM)、主动形状模型(ASM)、约束局部模型(CLM)等方法，CLM方法效果好，用于检测应用场景。 运动模式：人脸各部位进行精准的定位，然后使用光流法对前背景区域进行运动模式估计，包括运动方向及运动幅值等。 第二章 活体检测回顾分析总结现有方法(2010年前) 人脸活体检测所棉铃的挑战和难点；中昂点分析基于人机交互的方法、基于多光谱的活体检测方法、基于图像纹理分析的方法及基于多线索融合的活体检测方法；介绍现有活体检测数据库。 第三章 基于部件相关描述子的活体检测方法基于部件相关相关描述子的活体检测方法，该方法基于人脸边缘轮廓及不同区域的活体检测判别。首先扩大传统的人脸区域，从其中提取纹理特征，如局部二元模式(LBP)，方向梯度直方图(HOG)，局部相位量化(LPQ)等。在对纹理特征进行编码之后根据费舍尔准则对这些编码结果进行加权池化，从而的到用来表征人脸的特征。该特征与支持向量机结合，得到较好的活体检测方法。 第四章 基于人脸系数三维结构的活体检测方法纹理活体检测方法的弊端基础上，对其补充，对数据的要求不同，采集视频中人脸的方位角的变化幅度，获取精确的人脸三维结构。此方法可以得到精准的人脸三维结构，使用CLM对人脸的68个关键点进行定位，随后使用三角化算法根据两张不同的视角的人脸的三维结构，并用随后的视频帧对该结构进行精细化处理。该方法可以解决基于纹理的方法不能解决的跨设备问题，可以100%确定是否为活体。 第五章 介绍基于运动一致性的活体检测方法在真假人脸都具有很高的质量，同时采集的视频中的人脸方向角变化很微弱，以上方法很实用性较差。基于图像区域运动一致性的活体检测方法，比对人脸前运动模式与背景区域运动模式的不同，有效区分真假人脸视频。 第二章研究一种特定人体活体检测方法训练一个活体检测器识别所有注册人员的真假人脸。这样通用模型很难处理不同注册人员真人脸图像和假人脸图像的类内差异。本章为每一个注册用户专门训练一个活体检测器，消除通用模型中不同人员之间的干扰。 人脸识别遇到挑战有：人脸获取过程简便、人脸伪造方式多样(图像伪造、屏幕图像显示、面具三维模型等)，一般模式的识别方法都依赖于训练样本，并且要求训练样本和测试样本在特征空间中的分布趋于一致。 人脸活体检测方法：(1)基于纹理的方法 同一设备采集伪造人脸和用该设备采集的真人脸相比存在细节丢失或差异。细节上的差异引起图像微纹理上的差异。(以照片为例，在打印时会出现失真；在照相时，也会出现纹理的差异) [4] 使用傅里叶频谱分析的方法来判定人脸图像的真伪思路：人脸照片是平面而且小于真人的人脸尺寸没照片的高频分量必定比真人脸图像的高频分量要少；打印的人脸照片再时间上不存在局部运动，因此频域上的变化在时域上很小。使用二维傅里叶变化将图像转换成到频域并完成人脸真伪的辨别。 [5] 微操的人脸图像中的高频分量不一定比真实人脸的少，同时该方法并没有考虑图像的空间信息。将频域特征转为空域特征，同时对分类器做改进。该方法假定真人脸和伪造的人脸照片在表面的粗糙和人脸的粗糙度不同；基于Lambertian反射模型提出使用LTV方对输入图像进行平滑，随后从图像中提取DoG特征。为图稿活体检测器泛华能。 改文章创建标准数据库NUAA，采集15个用户超过5万张照片。 Peixoto等人结合DoG滤波器和稀疏罗吉斯特回归模型来应对恶劣的光照条件。 (2)基于运动信息的活体检测方法： [17] 利用眨眼定做来进行活体检测，为眨眼建立了一个条件随机场模型，通过建立一个无向图模型，为不同阶段的眨眼动作进行建模。在随后测试中，使用常规的动态规划算法完成推理。 [18] 利用人脸多个部件的时序运动信息作出帧间人脸的判断。该方法假设真人脸有明显的三位姐欧股，在运动过程中，会在图像平面上呈现出特殊的二维运动模式(这种运动模式一大特点就是人脸的中心区域的运动幅度要比周边区域的运动幅度大很多)，而且需要轻微的抬头动作，该方法首先需要使用部件检测定位中心的周边的人脸区域。随后，使用光流方法估计这些区域的运动模式，进而区分真人连和打印照片的区别。 [19] 使用最不动作完成活体检测，该方法通过分析嘴唇的运动是否和阅读一段文本时应有的运动模式匹配来完成人脸的真伪。(但是这样在眼部和嘴部被挖空，他人模拟动作可能会被攻破，可以根据[20]使用多种运动信息金融多线索融合)， [22][23][24][25] 利用视频信息做活体检测，还可以视频+音频结合做活体检测，但是这种方法需要采集数据较多。 (3) 基于多光谱的活体检测方法 出发点在于真人连的皮肤和伪造脸在材质上存在差异。，这种差异在成像系统中就是反射率的差异。然后在非可见光的多光谱成像技术成为人脸活体检测的一种新思路。基于多光谱成像的方法旨在从可见光波段之外找到更加有效的波段组合，使真脸和伪造脸的人脸在成像系统成像响应上的差异变大，从而达到区分的目的。换壳根据无线电波、微波、红外光、紫外光等进行划分。 [26]非可见光成像技术在文章中，利用近红外成像技术和模糊神经元分类器搭建车辆内人员数量统计系统。 [27] 基于近红外成像的人脸识别方法(最具代表性的红外识别文献)，使用850nm的近红外光、 [32] 多光谱成像技术在生物识别特征领域的应用的启发，685nm、850nm的波段你用于人脸采集，随后两个波段采集到数据投影到一个二维空间，在而无为空间中，真假人脸可以容易的使用线性判别分析(LDA)进行区分。(该方法要求采集目标与采集系统之间距离必须保持不变，而且额头不能被遮挡，实际限制较大。) (4) 基于多特征融合的活体检测方法 尝试融合多种不同的线索，如结合运动信息与纹理信息一起检测 [34] Yan使用不同线索进行融合检测 1)非刚体运动2)人脸-背景一致性3)图像条带效应 [35] 使用运动相关性分析和人脸纹理分析实现活体检测。首先将视频分为若干个N帧，相邻的片段之间公共帧为N-1帧，随后在每个片段上提取运动特征，并在每个片段的最后一帧中提取LBP纹理特征，随后两个线索通过分层数融合得到最终的活体检测结果。 人脸活体检测数据库 数据库中采集的数据能够准确切全面地反映应用环境中的实际情况。公开的实体检测数据库主要有四个：南京航空大学的NUAA数据库、Idiap的PRINT-ATTACK数据库、张洪科院自动化研究所的CASIA-FASD数据库、Idiap的新数据库REPLAY-ATTACK。四个数据库第一个静态图片，后面三个为视频，三四两个提供较好的数据源。 第三章 基于纹理的活体检测方法基于双色反射模型的人脸图像成像分析 假人脸和真人脸样本在图像阴影、图像模糊、图像高光 存在差异。 图像阴影：人脸图像显示在照片、屏幕上，会出现不同寻常的阴影； 图像模糊：传感器存在高斯模糊，夹杂各种噪音，每次进行图像处理，都有一些信息损失； 图像高光：人脸高光区域分布在突出部位如鼻尖、嘴唇、额头等位置，伪造的高光分布可能会违背常理。 成像模型基于双色度反射模型(DRM)，采集到的图像由漫反射和镜面反射两部分组成两部分设置，然后建立模型采集数据脸部识别信息；二次采集将第一次处理的数据进行再次采集，使用高斯卷积等方法图像差异分析使用图像纹理，即对二次采集后的彩色图片转化为灰度图像，使用一系列光学公式进行转化，不是很适用。使用高斯核函数对两张图像进行模糊化，高斯核的σ值越大，图像越清晰 基于费舍尔准则的纹理差异分析 二次采集的图像纹理会收到多方面的影响，使用费舍尔准则来度量真实人脸和伪造人脸在纹理上的差异。 首先将人脸归一化带{142,120}尺寸，然后将图像分为20*20块，没两块之间有{15,15}的重叠区域，每个字块中，提取LBP三种类型LBP特征，将特征屏到一起，然后计算字块中的纹理直方图的差异…… 结论： 对于活体检测来说，具有最优区分能力的区域并不是在常规的人脸内部区域，而是在这些区域之外的人脸边缘区域。 验证正确性： 对比了引入人脸图像的边界区域和不引入时的活体检测性能。验证得活体检测的性能随着人脸区域的增大而逐渐提升(这不是废话？！)。 基于人脸部件相关描述子的活体检测方法 假人脸经过二次采集和真人脸在纹理上有较为明显的差异，同时，不同的人脸区域对应的纹理差异也不相同；人脸的外轮廓区域对活体检测的性能具有正面影响。 一种部件相关的描述子用于提取不同人脸区域的纹理特征，使用完整的人脸区域(Holistic Face,H-Face)用于活体检测。 算法框架 首先使用一个普通的人脸检测器来定位人脸，随后按照扩大到人脸区域1.6倍得到H-Face; 随后，H-Face被分成六个部件，包括人脸区域，左右眼，鼻子和嘴，以及剩下的H-Face区域，称为边界区域； 在此基础上，将人脸区域和边界区域分成2*2的子区域，最终将H-face划分成12个区域； 随后，在每个部件中提取MsLBP特征，并使用训练好的码书对特征进行编写；编码后的码字结合费舍尔比值进行加权得最终的中层描述子； 每个部件的中层描述子通过进一步拼接后，被用于训练和测试活体检测分类器 部件纹理特征编码 使用K-means聚类算法训练码书为例简化训练过程，随机的从所有部件的同意不见C中抽取特征向量，然后将其进行抽取特征向量，随后使用VQ算法训练得到码书CB,在获取到所有部件的码书后，得到相应的码书得到的N个像素点的码字A，随后将其扩展成以个向量。 特征池化 使用平均值法将特征进行池化(考虑不同的人脸区域的费舍尔系数，结合费舍尔系数对编码结果进行加权，得到每个像素点的费舍尔系数)，对系数进行高斯平滑，采样获得和H-face同样尺寸的图像。 在特征池化后，所有人脸部件的直方图被凭借成一个特征向量用来进行活体检测的训练。实验： 选取500个MsLBP特征向量，用从所有训练中样本的相应部件随机抽取的MsLBP特征向量为每个部件训练一个码书。总结：两种方法，一种方法基于图像中的颜色，根据图像阴影、图像模糊、图像高光三部分进行活体检测比对，先对对象进行成像模型(根据光线等原因)，在图像基础上进行二次采集，二次采集获得人脸颜色、高光等等参数，比对其中存在的图像阴影、图像模糊及图像高光识别活体； 一种是基于费舍尔方法(个人感觉是机器学习的方向)，将人脸分成不同区块，对不同区块特征进行提取，分析，集合费舍尔比值获得描述子(个人理解为描述脸部特征的向量)，对其进行向量化，人后再向量池化，最后通过将向量池中配费舍尔系数进行特征提取，最后获得人脸的特征向量，进行活体检测。 基于人脸三维结构的活体检测 基于纹理的活体检测方法在二次采集后纹理变化较为微弱的伪造人脸无法识别基于人脸的三维结构进行活体检测，该方法需要视频中人脸视角有一定的变化即可，对视频质量无要求。 基本框架 假定视频或者图像序列中的人脸加测图像存在不同的视角，在给定图像序列中之后，该方法的流程如下： * 关键点检测，使用鼻子、最、严谨轮廓区域等关键点检测； * 关键帧选取：选取哪些帧用于恢复人脸，选取帧图像关键点的差异需要稍微大些，保证在回复人脸三维结构的置信度较高； * 人脸结构恢复：在获取人脸关键帧图像后，使用款苏的股计算法恢复人脸的三维结构； * 活体检测：在得到人脸的关键点的三维空间位置后，对其进行归一化，随后送至已经训练好的活体检测分类器中对输入的视频进行真假人脸视频的判断。 人脸三维结构估计关键点选择 使用有约束的局部模型(CLM)来定位人脸的关键点，检测到的68个关键点散落在眼睛、鼻子、嘴唇、脸颊等部分，在检测带第一章图像的人脸关键点之后，随后可使用关键点跟踪算法对该68个关键点进行跟踪，获取关键点位置。 关键帧选择 关键帧是指能够被用来恢复人脸三维结构的人脸图像；本文选取视角差别较大的帧用于恢复人脸的三维结构；计算两帧人脸关键点之间的距离判定人脸之间的视角差异，将两关键帧图像之间的人脸视角差异较大的，将其加入到关键帧列表中，否则跳转至下一帧图像。 初始结构恢复 介绍使用两张关键帧进行初始人脸三维结构恢复的方法。当设想投诉满足透视成像模型。在该模型中，使用相对内参或者摄像头内参为给定的人内联特征做恢复矩阵，然后根据恢复矩阵做人脸的相对姿态，最后使用矩阵获得平面的投影。 人脸结构精细化 两张人脸图像既可以恢复人脸结构的三维结构，但是精确度不高，给定Ｍ张关键帧图像和投影矩阵P,在最终精细化的人脸三维结构。 人脸结构配准 配准是将不同尺寸、位置、方位的人脸图像归一化到同一参考系中。人脸三维结构配准过程就是估计当前人脸结构和标准人脸结构之间的刚体变换，在经过刚体变换后，使两个人脸的三维结构差异最小。 实验结果 通过此种方法，从真人脸视频序列，平面人脸照片视频序列和弯曲的人脸照片序列恢复出人脸的三维结构，可以看出恢复出的真人脸三维结构与伪造人脸有明显区别。结论：根据人脸若干关键点的位置，即可恢复出人脸的系数三维结构，利用该三维结构可轻易区分真人脸和照片人脸，从而达到方位的目的。该方法缺陷在于对采集图像有视角要求。 基于运动一致性的活体检测 基于纹理的检测方法无法识别高质量的伪造人脸，基于三维结构无法在保证人脸视觉保持不变的情况下的识别；基于运动一致性即在此基础上，加上人脸区域和背景区域的的运动一致性保证活体检测。 前提结论：伪造的人脸视频要么人脸区域和周边的背景区域是运动一致的，要么是人脸区域和背景区域均没有显著的运动；而真人脸视频的人脸区域和背景区域是相互独立的，一般存在不一致的运动模式。因此，可以通过提取人脸视频的人脸和背景之间的相对运动模式来进行活体检测。 本章使用光流方法俩提取视频中的运动信息，利用运动信息的差异进行活体检测。 稠密光流提取 Gibson在1950年首次提出光流的概念，物体在运动时，它在图像上对应点的良多模式也在运动，这种图像亮度模式的表观运动就是光流。 光流场即在图像中所有像素点构成的一种二维瞬时速度场，其中二维速度矢量是景物中可见点的三维速度矢量在成像表面的投影，所以光流不仅包含被观察物体的运动信息，而且还包含有关景物三维结构的丰富信息。 注：光流相当于脸上某一像素点在某时刻的速度变化，理论上来说，在人脸检测时，活体只有脸部变形，头部在运动时和背景相差较大；但是照片在检测时，脸部变化基本没有，和后面背景的变化也基本为；视频在变化时相同，与后侧背景不相容。 一种基于人体区域和背景区域的运动相关性进行活体检测的方法， 首先提运动一致性特征，即将视频帧分成多个区域，人脸6个肩膀分为左中右三个，背景2个，总共11个区域，每个区域内的光矢量求取均值，然后活体光流值的大小，光流序列的频率以及相关性上，最终提取三个特征： * 序列频率：将所有运动序列进行快速傅里叶变换，随后将对应的傅里叶系数的模值进行归一化并拼接成一个特征向量。序列平率可以区分真人脸视频和采集自固定的照片的假人脸视频及来自照片的攻击。 * 光流模值直方图：统计光流模值直方图，大多数真脸的头部运动缓慢，手持拍摄的假人脸运动幅度大，真人脸在北京区域的运动幅度大，假人脸的运动幅度及北京部位变化小。 * 序列相关性：对存在全局运动的视频序列，在任意两个区域的模值序列或者方向序列均有较大的相关性，想比，真人脸视频中的身体区域和背景区域相关性弱。 附录 最新的方案：人脸活体检测 百度已经有成熟的API可以调用，阿里等也有现成的库函数可以使用 面对防止图片等的干扰，腾讯优图做法 针对以上攻击手段，腾讯优图依托多年的技术积累和实际业务运营经验，对人脸识别技术手段进行过多次安全升级：除了315晚会提到的摇头眨眼简单活体模式，我们还实现了更加复杂的多数字随机唇语、语音图像同步检测、人脸纹理分析、面具检测、视频防翻拍等多维度防护手段，并将所有这些手段进行交叉融合，实现移动端+后台的强力防护体系。 天空中，鸟儿飞过， 月下独怜， 远处，我在等你。","categories":[],"tags":[{"name":"活体检测论文初识","slug":"活体检测论文初识","permalink":"http://gorgegao.club/tags/活体检测论文初识/"}]},{"title":"防尾随问题基本理论研究","slug":"20170913防尾随问题 ","date":"2017-09-13T00:39:43.000Z","updated":"2017-09-14T12:50:51.550Z","comments":true,"path":"2017/09/13/20170913防尾随问题 /","link":"","permalink":"http://gorgegao.club/2017/09/13/20170913防尾随问题 /","excerpt":"问题：门禁刷卡进入，存在问题，A、B两人，A有正式门禁卡，A可刷卡进入，B无门禁身份；A刷卡进入后，由于门禁未及时关闭，B尾随进入。此时，门禁系统未录入尾随人员信息，存在安全隐患。","text":"问题：门禁刷卡进入，存在问题，A、B两人，A有正式门禁卡，A可刷卡进入，B无门禁身份；A刷卡进入后，由于门禁未及时关闭，B尾随进入。此时，门禁系统未录入尾随人员信息，存在安全隐患。 现有网络解决方案： 加装速通门(类似南京地铁站，翼闸防尾？)，限制时间，每次只能通过一个人，但是无法阻止两个人同时快速进入； 加装三辊闸防(上海地铁，南京火车站)，加装，每次只能一人通过； AB双门验证，A关闭后B门才开启，保证无法由人员被动方式通过门禁，提高安全系数，但是对刷卡方主动同意尾随也无法实现；案例：银行门禁方案案例说明：https://wenku.baidu.com/view/e09a670abb68a98271fefa62.html AB双门验证+体重验证，确认是否只有一个人； AB双门验证+红外感应，检测是否只有一个人体形状； 单门验证+人脸识别+红外识别。 补充：银行门禁示意图： 银行门禁使用流程： 参考文献：[1]王静. 高安全性门禁系统的研究[D].南京林业大学,2013. 文章分析传统门禁和识别方式的优缺点，根据现代化高安全性门禁的发展要去实现了将AB门安全地毯与卡式识别有机结合。通过刷卡、AB门安全地毯与卡式识别有机结合，刷卡认证、AB门认证、体重脚印认证三重综合管理的方案实现防尾随、反潜回、防胁迫功能。现有门禁系统的身份认证方式单一化和各种认证方式存在的不足，本课题致力于一种准确、安全、可靠、合理的高安全性门禁身份认证系统的研究。 门禁：出入口通道管理系统 门禁需提高部分:与门禁相配套的前端信息采集设备、指纹、掌型、面像、虹膜等前端生物识别设备目前仍需加强其实际应用以保证较高的安全性； 门禁系统发展： 传统门禁：门锁–&gt;机械装置-&gt;电子磁卡锁、电子密码锁。 高安全性门禁： 具备传统门禁的查询、监测、统计、考勤、遥控、卡、用户管理、系统维护；而且实现防尾随、反潜回、防胁迫(胁迫报警)等特殊功能。 识别方式：传统的密码门禁机卡式门禁安全性低，现在安全性逐渐使用唯一不可复制的生物识别方式配合使用，生物特征稳定、便捷、不易伪造；新技术一般使用虹膜、指纹、人脸特诊等； 作为整个安防体系的重要部分，门禁系统主要包括身份识别、认证系统和出入门系统。当今市场门禁系统种类繁多，主要有基于射频卡的，但是控制途经单一，而且多数门禁系统只是完成了基本的进出控制功能，却很少见到专门为大型特种门禁控制系统提供管理的高安全性门禁系统。 采用方法：AB双门+RFID内外门识别+地毯检测+重量检测，较为完善的解决尾随问题，但是实际实施状况还有复杂情况堪忧，有待从软件角度考虑？ P：软件方面的话，从人脸识别设备开始出发，人脸识别红外感应感应人体，感应到后进行预测分析，然后自动识别人脸？AB门识别到一个人脸后允许通过，多个人脸后进行警报处理。单门通过 人脸识别门禁+快速单人闸机，人脸识别如何实现 [2]李兴富,徐有明. 防尾随联动安全门状态监测控制系统的设计[J]. 桂林航天工业学院学报,2015,20(04):488-492. [2017-09-14].防尾随联动安全门状态监测控制系统的设计 针对高安全场所使用的防尾随联动安全门存在的误锁、误开、不能及时关闭，需要集中实时监控的情况和需求，设计了一种防尾随联动安全门状态监测控制系统。 硬件设计(未详细考虑)： 控制电路连接状态检测电路、故障检测电路、电源电路、通信电路、按键电路、显示电路。硬件电路不考虑情况下，安装位置类似银行设备，AB双门，AB门在平常状态只有一个门可以开启，正常状态下有警戒(双锁)、双门开、内门开歪门关、内门关外门开四种正常状态；异常状态包括关门超时、双开超时、不开超时、电源异常；报警状态包括紧急报警、电源报警。 软件设计：设计采用模块化 按键处理模块在调试模式下使按键模拟安全门的内开门、外开门、双锁、双开的控制指令，在征程工作状态仅用于控制显示器的亮灭。门状态处理模块实现检测门状态机警报状态的变化，从相应接口读取门状态机警报状态代码，判断后发给电脑判断，然后进行处理。 ，采用对程序执行循环计数方式的软件延时滤波设计方法，既实现了软件延时滤波，又不影响程序的实时性；利用片内ＲＡＭ 作计数器及定时标志，对单片机片内定时器产生的定时基准计数从而实现了多重定时，解决了单片机片内定时器数量有限及纯软件延时影响程序实时性的问题。 基于有限状态机的防尾随设计？有限状态机的转换？状态机的话 加入状态设计状态码 状态码 转台装换状态码的实施 状态移交 状态机转交的专利？ 状态码的切换 解决思路，在原本基础上加红外感应装置或者是加其他可以识别辨别人数的装置，在装置中统计人数，与人脸识别数目相对应；在单人刷脸成功进入情况下，配置单人人数；如多人刷脸成功，同时进入，则计算其中人员数目，如果数目相一致，则正常运行，如在AB门间检测到人员数目大于刷脸成功数目，即为发生尾随事件，进行尾随报警。 如果是单门的话，暂时无法进行配置，双门时难点问题在于如何进行统计人数，红外识别统计人数？视频监控使用算法计算人数等；待明天研究。","categories":[],"tags":[{"name":"门禁系统防尾随问题概述","slug":"门禁系统防尾随问题概述","permalink":"http://gorgegao.club/tags/门禁系统防尾随问题概述/"}]},{"title":"20170731 软件需求与需求工程","slug":"20170731-软件需求与需求工程","date":"2017-07-31T05:06:33.000Z","updated":"2018-05-23T03:09:58.378Z","comments":true,"path":"2017/07/31/20170731-软件需求与需求工程/","link":"","permalink":"http://gorgegao.club/2017/07/31/20170731-软件需求与需求工程/","excerpt":"什么是软件需求 个人认为软件需求就是业务逻辑+实现方法，也可以认为然间需求是“业务知识+问题列表+其它因素”。","text":"什么是软件需求 个人认为软件需求就是业务逻辑+实现方法，也可以认为然间需求是“业务知识+问题列表+其它因素”。 业务知识：业务事件、业务实体和业务规则； 问题列表：在工作中遇到的困难与故障（软件开发时需要解决的东西）； 其它因素：一些设计约束和非功能性的东西。","categories":[],"tags":[]},{"title":"20170727  不同项目需求视图","slug":"20170727-不同项目需求视图","date":"2017-07-27T01:37:44.000Z","updated":"2017-07-31T05:15:12.104Z","comments":true,"path":"2017/07/27/20170727-不同项目需求视图/","link":"","permalink":"http://gorgegao.club/2017/07/27/20170727-不同项目需求视图/","excerpt":"信息系统需求视图 毫无疑问，不同向项目有不同的需求，但是需求之间有什么共通的东西呢。本章分析下需求中存在的一些能够共通的东西，尤其是在信息管理系统中一些需要注意的部分。","text":"信息系统需求视图 毫无疑问，不同向项目有不同的需求，但是需求之间有什么共通的东西呢。本章分析下需求中存在的一些能够共通的东西，尤其是在信息管理系统中一些需要注意的部分。 信息系统的本质—–数据信息化 namely : 将数据抽象汇总，形成明确的需求。 信息系统类别联机事物处理系统（OLTP）、管理信息系统（MIS）、主管信息系统（EIS）、决策支持系统(DSS)、专家系统、办公自动化系统（OA）等。 OLTP：包含数据输入输出的系统； MIS：查询、分析统计报表的系统； EIS：信息的查看管理系统； 1、联机处理系统—流程电子化构成三要素：人、过程、工具 在实际工作中， 人带着工具进行现实工作，但是需要将信息以输入输出的方式按流程录入系统。 eg:入库操作时，人持手持机带物资入库，将入库物资信息录入ERP系统。 流程分析时OLTP系统的关键线索和主要视图 从业务流程出发，而非是从结构划分开始。 从业务角度定软件操作流程，将软件设计思路一业务并发，而非是拿单个模块实现。 P:懂业务的程序员OR会写代码的PM。 个人建议做一个会写代码的PM，重心在PM中，然后各类代码前后端兼容，可以适应各种需求的程序。 2、管理信息系统—数据信息化 管理信息系统就是将OLCP产生的数据进行报表分析、查询，是数据的消费者，这部分消费信息甚至比报表信息更重要。 报表需求分析什么 在报表分析时考虑客户为什需要这么做，而非是客户要这么做就这么做。 报表需求考虑Why、What、How ##待插入图片 报表需求面向不同对象分析不同内容 面向管理人员：从业务视角出发分析 分析出业务事件视角（进度报表、异常报表）业务实体视角（常规报表及需求报表） 进程日志，对关键活动总结；对异常状况报表；对详细数据报表；对业务具体需求报表； Eg:现在我们系统只有日志，可以作为进度报表，但是极其简单； 异常报表，不太容易实现，现在仅仅只有警报一个方面； 详细数据报表，不太完整。 So：We need 研究实际的报表分析一下啊！！！ 面向决策者：按销售时间、产品维度、销售人员维度进行分析，分析整体数据的自然属性。 其它信息系统 决策支持系统（DSS）、专家系统、办公自动化系统 1). 决策支持系统——决策信息化 结构化问题：可以利用计算机流程直接生成报表解决的问题，（仓储报表、危险品预警等数据报表）； 非结构化问题：不能只通过计算机流程解决，需要人工参与(广告投放、等较复杂的场景)； Eg:非结构化问题举例，图2.9： 2). 专家系统——个人知识转化为企业知识 个人在企业的经验知识经过一定的积累，就成为相关方面的“专家”，专家系统即对专业知识进行统计分析，将其可以快速转化为企业知识的系统。 `专家系统主要是将个人经验高效快速转化为企业经验` 3). 办公自动化—–协同信息化 办公自动化系统，将串行的办公流程并行处理，解决问题。 信息系统多维视图信息系统的线索：人、事（过程）、物（数据）、接口 需求分析人员要具有这种能力：将实现的功能抽象成实际可以见到的管理层效果(如提高项目的什么什么效率，可以为公司带来什么什么效益，可以通过什么报表可以直接让领导层看到什么) P：领导层主要看到的是效益层的，主要通过决策、报表、图标让领导层直接看到效益。 还需要具备这种能力：将业务逻辑向开发或其他人员进行转述分析，让其明白功能；或者是直接将业务划分为不同那个模块进行讲述。 嵌入式系统的需求视图面向直接用户的嵌入式系统如银行ATM机、手机等；在树立需求时，采用层次结构梳理。 eg:手机在接听电话时，需要记录别人的手机号码时，原来需要找纸和笔；可以直接打开便签记录，或者语音识别自动记录； 面向特定设备的嵌入式开发有些嵌入式系统不会直接与用户产生交互，而是先通过与内部系统进行交互，然后在外部进行与用户交互； 如GPS模块、监控模块，先通过显示，然后在于外部的模块进行交互。 分析此类时，需按照对外接口及对内接口进行分析。 先分析对内接口，找到此类设备相互关联的外部系统，然后在分析内部功能及描述。 Eg:监控项目中，先分析内部GPS模块需要实现的额功能，对监控物资进行实时的定位，对GPS信号网络信号进行整理描述。外部接口：通过查看物资信息接口与查看物资信息的具体位置等。 总而言之 需求视图是啥玩意呢，要结合具体业务逻辑及用户对象，根据不同业务逻辑及对象设计或者是为其分类制作不同的产品。 对设计产品时的一些感想： 做产品，提供便利：做一个产品，最初级的要求就是先使用人、工具（过程）、物（数据）、接口理清楚所有的业务逻辑，然后将其以开发人员可以快速理解的代码逻辑形式理出来。 P：对现在最近做的管理系统还是其它的系统，都是首先在业务逻辑基础上，将其实现，如实现基本的CUID及日志、监控功能。 做产品，带去利益：然后呢，在其基础上，划分为数据管理，报表，最好还要对报表做分析，将其产生实时可见的数据、形象化的数据为公司提供改进意见，为其带来效益。 做产品，积累经验：然后呢，在基础上，将操作流程化、产生专家经验，使其可以快速让新员工上手，将企业经验迅速转化为个人经验，快速上手。或者是直接进行自动化管理，设计原来这部分员工。 对需求分析的一些感想： 还是那句话，首先从用户角度出发，多问问用户要的是什么东西，他们为什么要这个东西，要这个东西他们有什么用，如何才能在更加符合他们操作习惯的同时进行设计。 对现在的系统时，进行细微设计，如进行报表分析时。看面相的对象是普通使用人员还是高级管理人员，为普通管理人员则提供基本的便利使用，使其用起来更加的舒服既可以。对于高级管理人员呢，则需要做报表等可以直接见效益或总体直接产生影响的报表或者是系统，从这个角度去分析制作。 在分析具体业务逻辑时，分内部接口与外部接口，内部接口开发人员可见，外部接口具体业务 人员可见，对于外部接口一定要慎重考虑，外部接口和事件分析是要点中的要点！！ 需求视图找出需求分析时应该从哪几个角度分析（用户人员、业务逻辑外部接口、产品类型甚至是产品使用与语言及展现平台形式等）","categories":[],"tags":[]},{"title":"测试用例及测试的基本原则","slug":"20170708 测试用例及测试的基本原则","date":"2017-07-06T01:17:36.000Z","updated":"2017-07-08T09:18:18.676Z","comments":true,"path":"2017/07/06/20170708 测试用例及测试的基本原则/","link":"","permalink":"http://gorgegao.club/2017/07/06/20170708 测试用例及测试的基本原则/","excerpt":"软件测试用例编写规范测试用例准备编写根据需求规格说明书和设计说明书，详细理解用户的真正需求，并且对软件所实现的功能已经准确理解，然后着手制订测试用例。","text":"软件测试用例编写规范测试用例准备编写根据需求规格说明书和设计说明书，详细理解用户的真正需求，并且对软件所实现的功能已经准确理解，然后着手制订测试用例。 测试用例指定的原则测试用例要包括欲测试的功能、应输入的数据和预期的输出结果。测试数据应该选用少量、高效的测试数据进行尽可能完备的测试；基本目标是：设计一组发现某个错误或某类错误的测试数据，测试用例应覆盖方面： 正确性测试：测试用例首先要满足所有功能需求； 容错性测试：正常数据，正常显示数据，完成功能，异常数据，异常提示，非法数据，非法操作，警报处理； 完整（安全）性测试：有权限验证，对于无权限用户无法进行操作 ，或者有保障性操作； 接口间测试：各模块间的关联性需要考虑，数据输入、输出修改具有一致性； 数据库测试：依据数据库设计规范对软件系统的数据库结构、数据表及其之间的数据调用关系进行测试。（不太懂） 边界自分析法： 对边界值数据进行特殊注意，进行处理验证； 压力测试：输入多条记录测试； 等价划分：将数据分类，如正常类、异常类，有效类、无效类； 错误推测：根据直觉推测错误； 效率测试：尤其对数据库操作，进行预计时间测试； 可理解性：理解和使用该系统的难以度进行测试； 可移植性：不同操作系统及硬件环境下的运行情况； 回归测试：测试–修改–再测； 比较测试：将已经开发的产品或同类型的产品进行测试。 模块测试、集成测试： 1、2、6、8、9; 单元测试：重点测试5； 组合(集成)测试：重点测试数据输入输出及逻辑，即4; 系统测试： 3、7、10、11、12、14; 其中压力测试和可移植性测试如果是公司的系列产品，可以选用其中有代表性的产品进行一次代表性测试即可。 GMPS基础测试用例设计完成后，其他的测试项目只编写设计与之不同部分的测试用例。 P: 我司暂时处于初步测试阶段，对于测试，暂时只考虑模块、单元及系统测试，即使用正确性、完整性、接口、边界分析、压力、等价、错误推测及回归测试方法进行测试，别的暂时不考虑。 在后期需要完善阶段，对容错性数据要进行测试，进行修改整合；对数据库进行完善，进行数据库测试；对可理解性进行测试，完善功能； 在装机之后，需要考虑可移植性测试； 在上线之后，进行比较测试，完善产品。","categories":[],"tags":[]},{"title":"Hexo+github 创建注意事项","slug":"first blog","date":"2017-06-15T13:40:36.000Z","updated":"2017-06-17T05:38:26.719Z","comments":true,"path":"2017/06/15/first blog/","link":"","permalink":"http://gorgegao.club/2017/06/15/first blog/","excerpt":"就想说github+hexo配置博客注意几点。","text":"就想说github+hexo配置博客注意几点。 1、仓库命名与用户名一致！仓库命名与用户名一致！仓库命名与用户名一致！ such as: 我的用户名为 junlegao 仓库名为 junlegao.github.io 2、发布时注意需进行对hexo 进行配置 即：npm install hexo-deployer-git –save 也可用 cnpm install hexo-deployer-git –save(淘宝仓配好后才可) 3、补充下hexo写博客流程。 新建博客 hexo new “New Post” 发布到服务 hexo server / hexo s 静态生成 hexo generate / hexo g 发布 hexo deploy / hexo d","categories":[],"tags":[]}]}