{"meta":{"title":"junlegao","subtitle":"道可道，非常道。名可名，非常名。","description":"无为而为之，为而无为也。","author":"樂","url":"http://gorgegao.club"},"pages":[{"title":"分类","date":"2017-06-15T13:28:48.000Z","updated":"2017-06-15T13:29:47.865Z","comments":true,"path":"categories/index.html","permalink":"http://gorgegao.club/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"大数据基础知识","slug":"大数据基础知识学习","date":"2018-05-23T01:00:44.000Z","updated":"2018-05-23T02:37:21.772Z","comments":true,"path":"2018/05/23/大数据基础知识学习/","link":"","permalink":"http://gorgegao.club/2018/05/23/大数据基础知识学习/","excerpt":"了解下大数据是什么，大数据有什么用，大数据设计到哪些技术。","text":"了解下大数据是什么，大数据有什么用，大数据设计到哪些技术。 大数据定义大数据，指的是所涉及的数据资料量规模巨大到无法通过人脑甚至主流软件工具，在合理时间内达到撷取、管理、处理、并整理成为帮助企业经营决策更积极目的的资讯。 from 百度：大数据（big data），指无法在一定时间范围内用常规软件工具进行捕捉、管理和处理的数据集合，是需要新处理模式才能具有更强的决策力、洞察发现力和流程优化能力的海量、高增长率和多样化的信息资产。 from 大数据时代：维克托·迈尔-舍恩伯格及肯尼斯·库克耶编写的《大数据时代》大数据指不用随机分析法（抽样调查）这样捷径，而采用所有数据进行分析处理。大数据的5V特点（IBM提出）：Volume（大量）、Velocity（高速）、Variety（多样）、Value（低价值密度）、Veracity（真实性）。维克托·迈尔-舍恩伯格及肯尼斯·库克耶编写的《大数据时代》 个人理解：大数据就是在计算机环境下产生大量复杂的可用于被挖掘的有价值的数据的集合。 大数据特点5V：Volume(大量)、Velocity(高速)、Variety(多样)、Value(价值密度低)、Veracity(真实性)P：单位关系转换 DB&gt;NB&gt;BB&gt;YB&gt;ZB&gt;EB&gt;PB&gt;TB&gt;GB&gt;MB&gt;MB&gt;KB 大数据相干技术大数据主要为有效地处理大量的数据。相关技术有大规模并行处理(MPP)数据库、数据挖掘电网、分布式文件系统、分布式数据库、云计算平台、互联网和可扩展的存储系统、机器学习、深度学习等。 HadoopMapReduce：Hadoop已经是目前大数据平台中应用率最高的技术，特别是针对诸如文本、社交媒体订阅以及视频等非结构化数据。除分布式文件系统之外，伴随Hadoop一同出现的还有进行大数据集处理MapReduce架构。 NoSQL数据库：oSQL数据库关注关系型数据库引擎的限制，如索引、流媒体和高访问量的网站服务。在这些领域，相较关系型数据库引擎，NoSQL的效率明显更高。 内存分析：内存分析在个人消费电子设备以及其他嵌入式设备中的应用将会得到快速的发展。随着越来越多的价格低廉的内存用到数据中心中，如何利用这一优势对软件进行最大限度的优化成为关键的问题。内存分析以其实时、高性能的特性，成为大数据分析时代下的“新宠儿”。如何让大数据转化为最佳的洞察力，也许内存分析就是答案。 集成设备：随着数据仓库设备(Data Warehouse Appliance)的出现，商业智能以及大数据分析的潜能也被激发出来，许多企业将利用数据仓库新技术的优势提升自身竞争力。集成设备将企业的数据仓库硬件软件整合在一起，提升查询性能、扩充存储空间并获得更多的分析功能，并能够提供同传统数据仓库系统一样的优势。 大数据与云计算的关系 大数据通常形容一个公司创造的大量非结构化数据和半结构化数据，这些数据在下载到关系型数据库时同上使用大量时间，大数据分析常常和云计算联系在一起，因为事实的大型数据集分析需要向MapReduce框架进行分发出库。 小结大数据的意义和前景。总的来说，大数据是对大量、动态、能持续的数据，通过运用新系统、新工具、新模型的挖掘，从而获得具有洞察力和新价值的东西。 附录 大数据处理工具： Hadoop HDFS、HadoopMapReduce, Hbase、Hive 渐次诞生，早期Hadoop生态圈逐步形成。 NoSQL，membase、MongoDB 大数据处理流程 数据采集：使用多种轻型数据库接受来自客户端的数据，并且用户可以根据这些数据库进行简单的查询和处理工作。特点：高并发使用产品：NoSQL，membase、MongoDB 统计分析：将海量数据导入一个集中的大型分布式数据库或者分布式存储集群，利用分布式技术对存储与内部的数据进行查询分类汇总；特点：导入数据量大，设计查询数量大，查询请求多；使用产品及工具：infoBright,Hadoop(Pig和Hive),YunTable,SAP Hana和OrecleExadata，Hadoop主要做离线分析为主。 挖掘数据：基于查询数据进行挖局，满足高级别的数据分析；特点和挑战：算法复杂，计算设计的数据量和计算量都较大；","categories":[],"tags":[]},{"title":"云计算基础知识","slug":"云计算基础知识","date":"2018-05-21T12:20:20.000Z","updated":"2018-05-23T02:39:56.056Z","comments":true,"path":"2018/05/21/云计算基础知识/","link":"","permalink":"http://gorgegao.club/2018/05/21/云计算基础知识/","excerpt":"什么是云计算？云计算提供的服务形式有哪几种？云计算的发展及技术支撑有哪些？云计算涉及到的其他技术有哪些？","text":"什么是云计算？云计算提供的服务形式有哪几种？云计算的发展及技术支撑有哪些？云计算涉及到的其他技术有哪些？ 云计算提出的原因： 科学的进步： 普通的PC服务器的处理能力远远超过以前的小型机，导致系统资源利用率低，并行技术的发展，可以将成千上万台PC服务器处理能力集中起来代替大型机、中型机； 生态意识： 节能环保意识的增强，将大量的PC服务器集中管理起来，暗示按需提供相应的处理能力，需求小的业务划分一部分CPU、内存资源，需求大的业务将多个服务器聚合起来进行使用，使用完即释放资源； 互联网的兴起： 为消费者服务器购买提供便捷途径。 云计算的定义：from 百度：云计算是基于互联网的相关服务的增加、使用和交付模式，通常涉及通过互联网来提供动态易扩展且经常是虚拟化的资源。美国国家标准与技术研究院（NIST）定义：云计算是一种按使用量付费的模式，这种模式提供可用的、便捷的、按需的网络访问， 进入可配置的计算资源共享池（资源包括网络，服务器，存储，应用软件，服务），这些资源能够被快速提供，只需投入很少的管理工作，或与服务供应商进行很少的交互。博客阿里云：云计算是一种按使用量付费的模式，这种模式提供可用的、便捷的、按需的网络访问， 进入可配置的计算资源共享池(资源包括网络，服务器，存储，应用软件，服务，这些资源能够被快速提供，只需投入很少的管理工作，或与服务供应商进行很少的交互。 简单的理解：云计算就是将多台计算机聚合在数据中心，通过虚拟化使其看起来作为一台服务器，随后通特定的API向外界提供服务，使用人员可以按时计费租赁其中的硬件、平台及软件服务，其中的分配空间可以向虚拟机一样弹性分配计算性能。 云计算提供的服务形 IaaS(Infrastructure-as-a-Service):基础设施即服务，将CPU、存储、网络等引荐资源能力云化，作为服务提供给消费者。 PaaS(Platform-as-a-Service)：平台即服务，运行软件的软件能力，作为服务提供给消费者，如阿里和腾讯的开发平台； SaaS(Software-as-a-Service):软件即服务，通过internet提供软件的模式，用户无需购买软件，使用提供商用租用Web的软件，来管理和用作，如阳光云服务器，在线PS，在线各类管理系统等 from:阿里云推荐：云计算揭秘企业实施云计算的核心问题 第1章 什么是云计算1.1 定义云计算的5大原则1.2 迁移到云中带来的效益1.3 导致云计算的IT演变1.4 云的分层：按使用分类1.5 小结 1.1云服务5大原则资源池：任何订阅用户均可使用虚拟化：硬件资产的高效利用弹性：无需资本开支即可动态伸缩自动化：构建、部署、配置、供应和转移，全部无需人工操作度量计费：根据使用量进行收费的业务模型，只为使用部分付费 1.2云服务迁移到云的好处从资本开销转变到运营开销的经济效益不必购买和供应服务器带来的机动性优势云中的安全性更强也更好 1.3云服务发展流程主要计算范式的变迁：从大型主机到客户机-服务器再到Web 20世纪60~80年代的虚拟机 提供空闲的时间给其他的用户使用20世纪90年代：客户机、服务器模型，吧任务分拆到计算网络上的客户机系统和服务器，前者发起请求，后者提供服务2000年：网格和软件即服务 用大型计算任务的廉价引荐大型阵列，复杂的引用开始可以从互联网上开始方位2005年至今：效应模型重生 通过浏览器在网上访问，大众按需消费，从数据中心获取资源。 1.4 云的分类划分云的类型：云分为公有云、私有云、混合云等 第2章 理解云计算分类云计算的支撑技术云的基本技术和基础设施 云运行网络上的服务器，多个服务器的存储位置即数据中心；数据中心提供基础设施，统一构建，减低成本；共同服务，节能减排(用电，能耗，PUE电能利用率) 云的服务需要虚拟化 如同虚拟机将CPU、内存、网卡、硬盘等咋自己本机中可划分为多个，然后每个都通过虚拟化层对其分配各自的CPU等资源，分别在其安装的操作系统上，运行各自的应用。云服务器将多个主机组成的数据中心看成统一的大服务器，根据企业需求为其分配资源，高效使用计算资源。 云需要访问API， 提供服务，供开发者调用。云的用户需要一种方式访问云、供应新的虚拟服务器，让数据进出存储，在服务器上启、停服务，同时释放不在需要的服务器。 云需要某种存储 ，保存虚拟印象、用户的应用和应用所需持久化数据。一般服务器中使用关系数据可RDBMS进行数据存储，但是在云中维护引用完整性难，无法保证多个服务器的副本是一致的。 云应用需要数据库，结构化的数据，对数据进行结构化及存储。使用NOSQL进行存储，新型的非SQL数据库一般是键-值数据库，伸缩性良好。这样的话，以键值对形式存储，可以允许不同的项目间包含数据重复。可以快速进行重连接。关系数据库与NOSql对比 eg：Google的Big table解决方案是开发较简单的存储管理系统，对PB级别数据进行快速访问。 云需要弹性 ，按照需求量收缩eg:网站访问中，如果大规模的同事访问将导致网站宕机，当双十一淘宝的接单中，就是用大数据中心进行处理，以前存在货物刷不出来，付款任务无法交付，消灾通过弹性分配负载，让其更加可靠有效的提高负载均衡，用户更加流畅的使用。 第3章 云计算的商业依据3.1 云计算的经济意义云计算改变了资本支付(CAPEX)和运营开支(OPEX)间的比例。1234CAPEX和OPEXCAPEX是创造未来收益的开支。企业花钱购买固定资产，就导致了资本开支。会计会给一个资产账目增加一项资本开支（对其进行资本化）。一般来讲，CAPEX要求先期投资被分摊（折旧），然后随时间减值。初始的CAPEX购买会导致庞大的现金支出—正是这个原因，让创业公司不约而同地想避免这种购买行为。OPEX是运营产品、业务或系统的持续成本（ongoing cost）。它是一种日常开销，有点像成本费用，如市场营销；因此，它可以更方便地根据业务要求进行增减。这对于CAPEX是不可能的，因为你已经购买了设备。 3.1.1 传统内部IT、共享托管、托管服务和云模型之间的比较 传统内部IT模型IT引用或服务的各方面组成都使用内部资源购买和管理eg：在许多办公室里，IT基础设施 共享托管部署部署应用的可能模型出现于第三方数据中心。公司仍然负责采购服务器硬件，开发或购买运行应用的软件。共享托管设施为这些引荐提供第三方的电能、制冷、机架和网络连通性。这种共享托管设施通常也提供冗余网络连通、备份电源和物理安全性。 托管服务部署托管服务价格外包核心基础设施，电能、网络连通等问题，公司也不再购买服务器和网络硬件，托管服务提供商把它们组个公司，负责管理这些硬件系统和安装操作系统，有些时候还提供团建服务。一般以月收费为主。 云部署与托管一样，但是公司不是租用硬件资源，而且租赁云中时刻动态分配的虚拟化资源。推荐使用，成本上较低，具体对比见（https://yq.aliyun.com/articles/175422?spm=a2c4e.11153940.blogcont175465.18.16c67cafiuqsx8） 3.1.1 云适用和不适用的场合 适用于大中小微型企业为企业提供公司网站托管（低技术含量示例：公司网站）、文件存储备份（中等技术含量示例：备份和文件存储系统）、项目研发部署（高技术含量示例：新产品开发）。为小型企业提供算力，计算各种内容；为大型企业提供数据集存储，高计算场景，高并发计算量的能力 不适用场景 遗留系统，老系统能够中需要或专有软硬件平台上的依旧 涉及实时/关键任务场景的应用，云服务是尽力交付，不能保证百分之百在线交付，而且必须依赖公用互联网的连通性，如果打通运行任务的关键，不建议在云中部署；处理机密数据，不建议在云服务器上部署（因为云服务器中会存在若干备份，在删除时不保证能够干净的全部删除）。 附录：云计算涉及到的技术from：http://www.aboutyun.com/thread-5767-1-1.html云技术可以使用的语言有java,c++等语言开发设计到的技术： HadoopHadoop是由Java实现的处理大数据的框架Hadoop解决问题：处理倒台服务器产生的通信过程功能：Hadoop就是一个解决方案。Hadoop是一个分布式方案，能够把压力分摊到其他服务器。至于如何做到的，可以深入了解Hadoop的maprecude等知识Hadoop详细介绍链接：http://www.aboutyun.com/thread-5199-1-1.html openstackopenstack是搭建云平台技术，可以搭建公有云、私有云和混合云。openstack是开源的云管理平台，用来统一管理多个虚拟化集群的框架。openstack目前分为运维及开发 NOSQLnosql即not only sql。nosaql数据库有Mongodb、Redis、Membase和HBase等nosql数据库是一种比较低级的数据库，关系型数据库是由nosql数据库发展而来。什么是关系型数据库，这里不从概念上区别，常用的SqlServer，mysql,oracle都是关系型数据库。关系型数据库顾名思义，数据库关系明确严谨。而nosql则是一种数据关系不严谨的数据库。一个key和value。","categories":[],"tags":[]},{"title":"互联网热点的一些炒作方法","slug":"热点话题怎么炒","date":"2018-05-18T00:21:19.000Z","updated":"2018-05-23T02:37:04.050Z","comments":true,"path":"2018/05/18/热点话题怎么炒/","link":"","permalink":"http://gorgegao.club/2018/05/18/热点话题怎么炒/","excerpt":"互联网时代，是咨询的时代，利用资讯信息获取流量的开始即拥有一个吸引眼球的热点话题，在有热点话题后需要如何去编辑、炒作呢？在此简单学习，供参考。","text":"互联网时代，是咨询的时代，利用资讯信息获取流量的开始即拥有一个吸引眼球的热点话题，在有热点话题后需要如何去编辑、炒作呢？在此简单学习，供参考。 from： 喜马拉雅听–&gt;36氪商业情报局 流量焦虑时代，热点话题怎么炒流量到利润的转换，流量产生广告等。。流量不是唯一的入口，但是是一个很重要的入口。那么如何获取流量。—&gt;话题 == 流量—&gt; 4个典型和常见的思考方向 某个热点事件人物钥匙有我们这款产品多少，某个热点人物这时候有我们这款产品有多好？eg:太子妃升职记， 粗略的场景及服装、场景设置及特效。思路：捐助公司，以此为话题，发出 站在我们公司的角度上，是不是可以对某个热点事件提供专业的声音。eg：比特币出现时候，教育机构、投资机构对比特币的出现、原理、收益、风险等方式做简单易懂的介绍，或者历史性的介绍，根据热点对其进行解释，从此发掘二次流量 如果某个热点事件的场景特别美妙，用户若是使用我们的产品是否可获得同样的效果。eg：运营人员，提供场景模拟，实现对场景的实现。such as，使用我们的人脸识别产品，你可以对产品进行类似美国大片钢铁侠，人脸识别身份 对某个热点事件进行分析，并提出自己的观点，引起大家的思考或者评论。eg：锤子罗永浩上周在 流量将带来何种利益，流浪变现方式 流量变现——互联网的盈利模式互联网产品的变现方式随着互联网产品的发展成熟，流量变现渠道基本可以举穷，我们列几种主流方式： 广告变现。广告是最基础的变现方式，几乎所有有流量的产品都能通过这种途径变现。对于非流量巨头的一般企业来说，局限或许在于规模化空间不大，稳定性略有欠缺； 电商变现。将用户导向“买买买”的变现方式非常主流、延展性强；但对前端内容和后端供应链要求较高。电商、垂直社区、新媒体甚至部分saas企业都通过这种方式变现。 游戏变现。游戏通过充分利用用户心理激发其付费能动性（用金钱在虚拟世界换得快感），堪称腾讯的一大收入支柱。网游、社交游戏、直播中的网红打赏等都属于这类变现。 用户付费。这类变现主要通过提供相关服务，实现稳定变现，因此对于产品本身要求很高。此法在O2O、数据类、企业服务和金融企业应用较多。2/影响互联网产品变现的因素 IP变现。视频网站最终借制作电视剧、电影的潮流，走向变现之。 from14年阿里：流量变现——互联网的盈利模式最后，补充一下国内常见的使用“流量变现模式”盈利，或者辅助其他产品盈利的互联网产品： ——百度搜索广告、网盟广告 ——去哪儿网搜机票酒店时看到的广告(很多与目的地有关) ——hao123等导航网站 ——360浏览器等各种浏览器 ——豌豆荚、91助手等手机管理软件 ——机锋市场等各种Android市场 ——各种Android ROM","categories":[],"tags":[]},{"title":"余军的PM产品试题","slug":"余军的PM面试题","date":"2018-04-03T12:42:35.000Z","updated":"2018-05-23T02:38:12.132Z","comments":true,"path":"2018/04/03/余军的PM面试题/","link":"","permalink":"http://gorgegao.club/2018/04/03/余军的PM面试题/","excerpt":"早上听点产品~ From:产品方法论-喜马拉雅听 听喜马拉雅听中的一点产品知识，听起来很迷茫，但是其中一点对产品面试题的分析，留下点印象，随记之~ 余军的PM面试题：同理心环视天赋技能，如何提高产品能力。","text":"早上听点产品~ From:产品方法论-喜马拉雅听 听喜马拉雅听中的一点产品知识，听起来很迷茫，但是其中一点对产品面试题的分析，留下点印象，随记之~ 余军的PM面试题：同理心环视天赋技能，如何提高产品能力。 如何在日常生活中，提高上你的产品技能~ 下载小而美的APP来源：APP store: 精品APP、从最美应用、next平台咨询 分析产品功能 大牛： 揣摩目标应用的用户群 可能是什么样的人 核心竞争力 主要功能的用户场景分别是什么 from this:作为一名普通用户进行使用APP，带着接下来几个问题： 这个APP怎么吸引你，为什么下载，是什么，对这个APP的感受，第一印象。 初次体验，有引导么，APP的整体感觉如何，是否感觉到智能高效呢？花费了多少时间呢，给你留下什么印象？ 再次使用，多久用一次，这款与其他APP相比如何，预测它会火么？ 注重把握身边的人 用眼睛去看 在每次应用更新后，去电子应用市场，关注用户评论，是否和自己的想法相同，身边的人如何使用APP，用户习惯如何？ 用耳朵聆听 对每次应用的APP，和周围人讨论它怎么样？ 定义周边的 用一句话给一个从未使用过电脑的人描述鼠标？ 听到：鼠标是人在电脑这个虚拟世界的手，通过它可以与这个世界交互。 From me：鼠标相当于电视上的遥控器，遥控器相当于电脑，可以操纵电视，换台，调设置；鼠标相当于电脑，可以和键盘一起控制电脑，emmmmm，如果了解科幻片的话，其中的点击虚拟屏幕就是现在鼠标控制的元凶。 点评：考察用一句话描述产品定位。产品再用户心智模型的第一反应，根据自己的知识经验进行描述。 如何对产品进行描述，注重以下几个点： 是什么行业，什么类型的产品 目标用户群是谁； 解决用户什么问题 给用户带什么价值 跟竞争对手的差异在哪 如何匹配产品与用户心智模型的链接最简单的方法就是比喻，将与原来的方法比对起来。 说说你平常用的软件，为什么喜欢？ 听到，鲜果阅读， 点评：考察队用户核心需求的把握能力，为什么喜欢，因为其解决一定的问题（需求痛点），给你带来了什么价值？鲜果阅读是聚合阅读，节约用户获取产品的时间价值，这是产品的核心。 如何今天与同学约好买手机，突然导师打电话有事去不了了，这个时候一直打不清楚电话，这个时候你该如何做？ From me: 点评：考察沟通能力与优先级排序能力.具体问题具体分析，一般需要分为几种场景啦讨论。such，导师的事情优先级高么，与同学之间还有其他方式么？ 说说12306不好用的原因。 听到，总的来说，归为用户体验不好，不支持大量订票购票操作，订票购票存在逻辑问题，存在订不到票的问题。 点评：没有解决用户在特定场景急切买到票的需求，用户在很多时候想不通过登录与复杂的流程进行购票，只想简单方便的买到。在票源紧张的时候还可以买到票，这是很多刷票软件诞生的原因。 日常提问综合案例题： 给你喜欢的APP增加一个功能，说明设计思路。 糗事百科，增加基于LBS（基于位置的服务）的发布糗事功能。发现身边的糗事，增加糗友无处不在。 点评： 考察根据产品定位增加产品功能，以及评估一个功能是否该做。评估的标准是产品定位、KANO 模型（对用户需求分类和优先排序的有用工具）、产品的价值。 中式款餐店旁边是肯德基，没有太多资金进行推广，如何进行引流？ 点评：考察是否有产品运营的思维低成本的有事件推广，技术工具、创业推广。技术运营的策略和思维： 开放平台 种子用户 媒介软文 技术工具 产品捆绑 广告植入 合作整合 社区推广 活动策划 创业腿长 事件营销 智能手机与电脑结合，摇一摇，有什么好玩的玩法！考察有木有理解移动互联的本质，即智能手机传感器的应用。手机端的特质，摇一摇AR等在手机中的应用~ 总结：产品职位的面试在于尝试洞悉出题者的动机，如同洞察用户的动机和核心需求，考察在于产品定位、核心需求、需求排序等问题","categories":[],"tags":[]},{"title":"产品经理职责及产品设计流程","slug":"重新分析互联网产品及职责","date":"2018-03-25T12:24:14.000Z","updated":"2018-04-04T07:43:39.369Z","comments":true,"path":"2018/03/25/重新分析互联网产品及职责/","link":"","permalink":"http://gorgegao.club/2018/03/25/重新分析互联网产品及职责/","excerpt":"在最近经历求职简历无回应，准备无从下手之际，重新看下产品经理的职责，设计一个产品需要做什么，从中找点启发，继续我的产品路~ 文章分为两部分，第一部分是来自人人都是产品经理老曹的分析，第二部分来自某培训机构产品经理内容介绍。","text":"在最近经历求职简历无回应，准备无从下手之际，重新看下产品经理的职责，设计一个产品需要做什么，从中找点启发，继续我的产品路~ 文章分为两部分，第一部分是来自人人都是产品经理老曹的分析，第二部分来自某培训机构产品经理内容介绍。 产品经理的主要职责：from：人人都是产品经理，老曹 产品经理岗位职责 市场调研 与用户和潜在用户交流 与直接面对客户的一线同事交流 研究市场分析报告及文章 研究市场分析报告及文章 使用竞争产品 仔细观察用户行为 产品定义及设计 定义产品指产品做什么内容(使用PRD描述) 市场愿景 竞品分析 产品的详细功能描述 产品优先级 产品用例 系统需求 性能需求 销售及技术支持需求 产品外观设计，用户界面设计，交互界面设计及用户体验设计 PRD 产品需求文档撰写 项目管理 沟通不同团队人员(工程师、QA、市场、销售、客服等)，在预算时间内发布产品 确保资源投入 制定项目计划 根据计划跟踪项目进展 辨别关键路劲 必要时真去追加投入 向主管汇报项目进展 产品宣传 向包括老板、销售、客服等沟通产品的优点、功能和目标市场，也可能向外界选厂 产品市场 产品生命周期管理指随着产品经历概念化、发布、成熟、退出整个生命周期中的产品管理活动。 产品定位 产品定价及促销 产品线管理 竞争策略 建立或收购合作伙伴 识别并建立合作关系 产品设计流程from西南科大产品培训的简单过程分析 step1:市场分析/用户分析以抖音、西瓜视频、快手、美拍、秒拍为例进行分析。 竞争对手：快手（竞品分析）特点分析：时间偏长 目标用户，用户群体可分为三类： 核心用户：严重短视频创作、拍摄上传的用户； 重点用户：使用短视频娱乐记录身边的趣事； 普通用户：普通浏览别人的视频。 step2:需求分析、功能设计需求：现代人“杀时间”的需求。 分析短视频的的优点、缺点及用户需求分析； 短视屏 优点 缺点 用户分类 用户需求 1 门槛低、用户多、入口全 质量差异大、运营成本高 拍摄、上推荐 贴纸/特效多，简介功能、多关注 2 直观小巧、耗费少、碎片化 拍摄、剪辑要求高 拍摄、记录生活 制作简单方便 3 信息大、强社交 同质化、创新少 观众 浏览快速简单 针对短视频的优缺点及需求扬弃； 短视屏 发挥优势 避开弱点 用户分类 满足需求 1 / 质量差异大、运营成本高 拍摄、上推荐 / 2 门槛15s 拍摄:倒计时，手机剪辑简洁化 拍摄、记录生活 左右滑动，跟随拍摄选择 3 评价、点赞、关注 小巧、便捷化管理 观众 无广告；全屏幕展示；双击收藏；点击关注，定制化推荐 step3:原型设计分析功能、使用Axure、墨刀等设计软件设计原型图(高保真)； 原型设计的目的： * 告诉程序员要做什么 * 告诉UI需如何设计 * 交互设计如何更美观 step4:项目评审在设计出产品基础上，与开发人员、运营人员、UE、UI、市场人员讨论项目可行性； 目的： 开发人员、UI人员清楚项目目的、规模及主要莫夸 开发、UI对存在漏洞提出补充； 开发、UI与产品规划时间流程； 与运营人员讨论项目是否符合市场预期。 step5 项目上线目的： 审核项目是否达标 准备市场，运营资料 解决问题 较差后台，准备查看数据，密切注意用户反馈 step6 分析数据、不断迭代 将项目分成若干小点 不断根据市场数据就差，快速反应 不断保持其在用户商店的活跃和评级 保持用户活跃度 保持团队活力","categories":[],"tags":[]},{"title":"shell 学习","slug":"shell-学习","date":"2018-03-20T06:57:34.000Z","updated":"2018-04-03T12:36:11.352Z","comments":true,"path":"2018/03/20/shell-学习/","link":"","permalink":"http://gorgegao.club/2018/03/20/shell-学习/","excerpt":"初学Shell脚本语言，了解一点。","text":"初学Shell脚本语言，了解一点。注意事项：1、执行脚本时需要执行的操作123shell #!/bin/bash echo &quot;Hello World !&quot; 2、变量在输出时需要在前加 “$”只读变量 readonly [+变量名]删除变量 unset [+变量名] shell数组 定义使用 数组名=(值1 值2 … 值n)12array_name=(value0 value1 value2 value3)echo $&#123;arry_name[@]&#125; #获取数据中所有值","categories":[],"tags":[]},{"title":"互联网长尾、闭环","slug":"互联网闭环","date":"2018-03-19T00:21:19.000Z","updated":"2018-05-23T02:33:27.907Z","comments":true,"path":"2018/03/19/互联网闭环/","link":"","permalink":"http://gorgegao.club/2018/03/19/互联网闭环/","excerpt":"看人人都是产品经理，学到两个新名词，互联网长尾时代、互联网闭环时代，mark下长尾或者长尾效应，指的是指那些原来不受到重视的销量小但种类多的产品或服务由于总量巨大，累积起来的总收益超过主流产品的现象。互联网内，指产品由引流到体验到反馈的一个闭环现象。闭环就是：引流——体验——反馈——再次引流的循环！","text":"看人人都是产品经理，学到两个新名词，互联网长尾时代、互联网闭环时代，mark下长尾或者长尾效应，指的是指那些原来不受到重视的销量小但种类多的产品或服务由于总量巨大，累积起来的总收益超过主流产品的现象。互联网内，指产品由引流到体验到反馈的一个闭环现象。闭环就是：引流——体验——反馈——再次引流的循环！ 互联网长尾长尾或者长尾效应，指的是指那些原来不受到重视的销量小但种类多的产品或服务由于总量巨大，累积起来的总收益超过主流产品的现象。 eg:以互联网电商企业为利例，即不同于传统的二八效应，传统的二八效应认为80%的销售额来源于20%的用户。而长尾效应表示一半左右的销售量来源于比较热门的商品，另外一半来源于不热门的商品。 淘宝、美团、饿了么这些互联网企业则证实了互联网企业中存在的这些长尾效应，集合零散商家与小额用户，创造超越大规模商家的利益。 因此，淘宝电商、OTO时代应该是典型的互联网长尾时代。 产品经理中看到快手是互联网长尾时代到来的时候， O2O闭环O2O闭环经常被顾名思义地理解为包办整个商业链条的所有环节而不依赖第三方。 闭环，顾名思义，形成一个完成的闭圈。互联网内，指产品由引流到体验到反馈的一个闭环现象。闭环就是：引流——体验——反馈——再次引流的循环！（From :知乎 Firmin Peng） eg:O2O线上线下产品为例，以前的O2O从团购开始，线上购买，线下消费，通过奖励补贴吸引用户继续消费。闭环的核心在于形成对每一单交易的跟踪和记录，其形式上也许不需要封闭，但是订单追踪一定要从开始到获取结束。","categories":[],"tags":[]},{"title":"HTML 复习","slug":"HTML-复习","date":"2018-03-07T11:28:54.000Z","updated":"2018-04-03T12:37:31.486Z","comments":true,"path":"2018/03/07/HTML-复习/","link":"","permalink":"http://gorgegao.club/2018/03/07/HTML-复习/","excerpt":"HTML5 一些忘记的、新加的标签复习哈~","text":"HTML5 一些忘记的、新加的标签复习哈~ 一些少见的HTML标签HTML head 标签 描述 &lt;base&gt; 定义了页面链接标签的默认链接地址 HTML 列表 标签 描述 &lt;ol&gt; 有序列表 &lt;ul&gt; 无序列表 HTML 框架 标签 描述 iframe 通过使用框架，你可以在同一个浏览器窗口中显示不止一个页面。 HTML 字符实体不间断空格(Non-breaking Space)HTML 中的常用字符实体是不间断空格(&amp;nbsp;)。 HTML5 在原生HTML基础上增加很多元素 绘图的 canvas元素 媒体播放的vedio和audio元素 本地可存储 加入新的元素actile、footer、header、nav、section 加入新的表单控件 calendar、date、time、email、url、search HTML5 的改进 新元素 新属性 完全支持 CSS3 Video 和 Audio 2D/3D 制图 本地存储 本地 SQL 数据 Web 应用","categories":[],"tags":[]},{"title":"Hexo+github 创建注意事项","slug":"first blog","date":"2017-06-15T13:40:36.000Z","updated":"2017-06-17T05:38:26.719Z","comments":true,"path":"2017/06/15/first blog/","link":"","permalink":"http://gorgegao.club/2017/06/15/first blog/","excerpt":"就想说github+hexo配置博客注意几点。","text":"就想说github+hexo配置博客注意几点。 1、仓库命名与用户名一致！仓库命名与用户名一致！仓库命名与用户名一致！ such as: 我的用户名为 junlegao 仓库名为 junlegao.github.io 2、发布时注意需进行对hexo 进行配置 即：npm install hexo-deployer-git –save 也可用 cnpm install hexo-deployer-git –save(淘宝仓配好后才可) 3、补充下hexo写博客流程。 新建博客 hexo new “New Post” 发布到服务 hexo server / hexo s 静态生成 hexo generate / hexo g 发布 hexo deploy / hexo d","categories":[],"tags":[]}]}