{"meta":{"title":"junlegao","subtitle":"道可道，非常道。名可名，非常名。","description":"无为而为之，为而无为也。","author":"樂","url":"http://gorgegao.club"},"pages":[{"title":"20170801 项目管理的一些心得体会","date":"2017-08-01T01:37:54.000Z","updated":"2017-09-07T02:11:07.960Z","comments":true,"path":"20170801-项目管理的一些心得体会.html","permalink":"http://gorgegao.club/20170801-项目管理的一些心得体会.html","excerpt":"在实际团队管理中的一些心得体会，个人经历所得，突发感想，想记一记，感觉有用就看看，无用就当笑话翻过。","text":"在实际团队管理中的一些心得体会，个人经历所得，突发感想，想记一记，感觉有用就看看，无用就当笑话翻过。 1. 项目，必须设置项目负责人，由项目负责人指领整个项目，项目负责人必须有正式的会议或者是项目团队讨论统一确定。 （同理，在项目开始，中期及结束开设相应的研讨会或者其他形式的会议讨论方案，确立具体行动等）好处：项目有负责人（责任心较强的人），首先为项目其他人做榜样作用，督促其他人上进，参考不想当将军的士兵不是好士兵，当然，如果团队内都是无上进心的懒散人员，当此条不存在。 项目负责人对项目的了解程度肯定最大，赋予权利，同时承担责任，对项目中的完成度、进度等进行把控，或者项目人员中的冲突调节（技术冲突、人员冲突）进行调控； 对于那些存在的技术达人，只醉心于技术，或者痴迷于一方面的，也可通过更加了解项目的项目负责人去督促监督； 项目负责人可以不是项目经理，也会一定程度上引起一定非议，但是个人认为必不可少。 2. 项目会议不能多，但是各阶段必须的会议不能少项目会议，首先开始的开题，中期的检查及最后的验收及总结避不可少。必要性在于需对项目负责人、进度进行核查，提醒，验收，而且督促。 中间进度会议视不同的项目需求进行定义 其它小会议，按照进程进行安排，有必要则进行。不同会议只设置负责人员及专门员工进行探讨即可，无关人员或非必须人员无需参与；项目技术会议技术人员参与即可，时间安排会议负责人及团队负责人及核心技术员工核心负责人参与即可。 项目会议，进度安排，由总负责人进行项目安排后，小组自行分工，时间安排自由做主，但是务必在总时间内。在把控时间内，不能完成，各自承担各自责任。 3. 项目言出必行，实现不了的话需少说，别人话需认真听项目中发言的话需与项目相关，不同部门或者人员之间提出的话语需进行认真思考，对提及的方案或者是措施必须认真考虑，任务有理由，进行审议，通过则执行，不通过则不执行；但是务必需仔细考虑、尊重对方的话语权，因为这些小的话语不尊重或者是忽略导致的项目运行失败/不完善很多。 eg:需求人员提出问题，开发哦一声不在理会； 开发人员提出难题，业务人员哦一声说继续这样做； 测试人员测试bug，业务、开发哦一声，这不是bug。（是不是应该提前做测试用例？） ... 项目在行，玩笑在私下开就好，正式工作的场合，言出需行，别人言行亦要尊重、认真对待。 …..写累了，其它的带补充，待完善… 4. 消极的话少说项目中，缺陷有，待完善亦很多，一步步逐渐实现即可。消极负面的话永远是阻碍项目向前的鸿沟。 言行出谈，脾气要好，言语要而精确。 最怕，别人的任务，自己承担，无法开口，完成后，来一句，“甩锅成功”。 最怕，投入分析，全新搞定，最后来一句，“哇塞，没有我的事情”，无心话带负极。 最怕，最认真，最投入的人来一句，垃圾项目，无前途，已经完蛋！无心话带负极。"},{"title":"分类","date":"2017-06-15T13:28:48.000Z","updated":"2017-06-15T13:29:47.864Z","comments":true,"path":"categories/index.html","permalink":"http://gorgegao.club/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"活体检测之小结","slug":"隐藏，待整理/20171024 活体检测","date":"2017-10-23T23:20:30.000Z","updated":"2017-10-24T00:01:07.270Z","comments":true,"path":"2017/10/24/隐藏，待整理/20171024 活体检测/","link":"","permalink":"http://gorgegao.club/2017/10/24/隐藏，待整理/20171024 活体检测/","excerpt":"","text":"活体检测方法暂时就告以小段落了，方法的话分为基于运动、基于背景(上下文+光流、基于运动一致性)、基于3d重构、基于纹理法(基于图像模糊、图像高光、图像阴影等 如傅里叶频谱法、二值法等)、基于多光谱的方法(一般使用红外线、现在基本的就是使用红外线检测人脸)今天如果金老师去的话修改下PPT，整合时间给金老师汇报下，时间大概控制在分钟；这些主要是看论文的东西，中间需要提出自己的想法： So，作为活体检测中重要的一部分，大多都对自己的部分方法有做介绍； 所以，做个表格；在PPT中，将已经出现的几种方法做个清晰的对比，然后在对比之上，列出自己想要看的方向，再从这方面比较深入的研究一下。 然后呢，自己对自己的研究方法大概有一定的认识之后，大概罗列一下自己准备怎么去做，做的话就是一样，首先基于OpenCV库吧，已经有活体检测的人在那边做了，但是感觉一般(如基于动作的人脸识别方法，眨眼、张闭嘴+状态机的)；湖南大学的罗浩也有一篇基于眨眼+背景识别(OpenCV)的方法，所以，在理论上来讲，OPenCV做运动活体+背景应该是没有问题；然后其中都有用到SVM方法，应该是即机器学习中的一部分，所以准备自学下机器学习方面的知识补充下自己，然后在搭建的同时进行使用机器学习的方法试一试，(同有一篇基于深度学习的卷积神经网络的人脸识别方法)，在这方面应该可行。 主要方法选取中，准备是使用多特征融合的方式进行使用，将现在需要活体检测需要的要求列一下，要求用户配合少、活体检测灵敏、可靠度高、受光照效应好； emmm，而且由于眨眼运动方法已经有太多实际的应用暂时不予考虑的话，可以尝试看看基于静默活体检测去做(但是这方面的论文在网上暂时没有找到，正在找中)；然后结合活体检测的纹理法有效剔除其中的照片和背景;(考虑原理是脸部有纹路，而实际的照片或者视频则没有，是不是可以3d建模重构？);再结合一种相对背景的话对固定位置进行确认，上下文进行检索。 然后方法及时间规划方面，大致做一个列表吧，在前一个月尝试用OpenCV在学习中尝试下人脸眨眼等的方法；然后在数据库上尝试下再推荐四个开源数据库；在研究方法上采用OpenCV+机器学习方面的知识进行查询搜索吧！ 但是这样一来，方法是有了，在创新点方向不知道该怎么去找，以什么思路去找，找哪方面，需要向金老师请教下； 有一篇基于深度学习的卷积神经网络的人脸识别方法，可以稍微大概研读下，然后更具其内容进行扩展下。","categories":[],"tags":[{"name":"活体检测论文初识","slug":"活体检测论文初识","permalink":"http://gorgegao.club/tags/活体检测论文初识/"}]},{"title":"活体检测之小结","slug":"隐藏，待整理/20171023活体jiance","date":"2017-10-22T23:24:39.000Z","updated":"2017-10-23T23:23:38.867Z","comments":true,"path":"2017/10/23/隐藏，待整理/20171023活体jiance/","link":"","permalink":"http://gorgegao.club/2017/10/23/隐藏，待整理/20171023活体jiance/","excerpt":"","text":"总结来总结去活体检测目前似乎还是那集中方法，所以，今天先做个总结PPT吧，把现在遇到的活体检测的方法大致都介绍一下；主要结合知乎那张图+15号的总结+22号的湖南硕士的总结。总结内容简单点，方法讲清楚，然后细节描述下看的人脸检测的眨眼法的实现；还有光流法；基于运动背景一致性；基于上下文背景检测的方法。 &amp;&amp;&amp;&amp;&amp; 找找国内外研究综述，找不到就写现在研究综述方法吧。做完PPT，然后写综述方法！！ 所以呢，静默活体检测到底是什么方法还没有搞懂，傅里叶频谱分析法感觉就是傅里叶分量不太理解。 北京工业大学许晓做了 基于深度学习的活体人脸检测算法研究 2016 提出一种基于深度学习的活体检测方法，使用人脸图像训练了一个深度神经网络结果用于活体检测。是一个二分类问题，监督信号比较弱，提取特征鲁棒性一般，研究基于微调整策略的方法，用活体检测训练图进行微调整得到高效的网络。 提出基于动态特征的卷积神经网络活体检测算法，使用金字塔LK光流法跟踪视频，得到图像的动态信息，随后对光流运动信息进行分析，计算水平位移和垂直位移，进一步根据两个位移计算位移幅度图，即动态特征图，将动态特征图作为据安居神经网络输入，最后进行特征提取与活体检测 设计具有活体检测功能的人脸识别认证系统，包括人脸图像检测、特征模块提取、人脸检测、活体人脸判别、特征提取i相似度计算模块。 宁波大学 2014 这篇文章使用提取数字照片的纹理统计信息，研究鉴别人脸真实性的方法，文章算法只需要采集单张图片就可以识别是真实的人脸还是欺骗的照片，从获取的人脸图像规律出发，在人脸识别活体检测中取得良好的性能。 1）使用DCT变换将活体真实人脸图像的大部分重要信息映射到DCT域低频部分，而高频部分大多为噪声。(why？从哪来的？)在DTC域将高频噪声因素去除，而低频系数更好的反映真实人脸与翻拍人脸的差异，提出将人脸图像进行均值滤波、直返股均衡后再提取DCT系数低频系数作为特征，用SVM分类器区分真伪人脸。2) 图像纹理特征是场景组织结构的真实反映，不同的纹理算子描绘图像灰度信息的分布规律。本文使用纹理描述算子，选取灰度共生举证，边缘方向直方图，LBP等作为图像特征提取的研究目标，提出基于Tamura纹理特征和LAP为等检测算法，区分活体真实人照片与翻拍照片。 3) 比较真人和假冒的数字图像直方图描述不同色阶在当前图像中的比例，发现两类招牌金直方图呈不同分布，基于HSV颜色直方图的检测方法； 4) 图像的像素灰度值可以构成举证，利用矩阵的奇异值描述图像的内在属性奇异值是对矩阵中数字信息的本质反应，奇异值对矩阵中数字轻微波动不敏感、具有镜像稳定性、比例不变性、旋转不变形等优点，在提取特征时更加鲁棒。 而且！！！！这个有国内玩研究现状！！！！感动！！！待会看 基于多任务CNN的人脸活体多属性检测 传统的交互式活体状态识别中通常先进行关键点检测，再进行人脸活体状态判断，无法利用活体属性之间关联性同时进行多种活体属性检测。 基于多任务卷积神经网络，提出了一种直接从输入人脸中同时判断人脸的眼睛睁闭状态、嘴巴张闭状态、头部点头状态和摇头中左右侧脸提取人脸照片中的特征信息，判断人脸多个活体属性。","categories":[],"tags":[{"name":"活体检测论文初识","slug":"活体检测论文初识","permalink":"http://gorgegao.club/tags/活体检测论文初识/"}]},{"title":"活体检测之基于湖南某硕士","slug":"隐藏，待整理/20171022 活体检测","date":"2017-10-21T23:28:08.000Z","updated":"2017-10-22T14:32:40.997Z","comments":true,"path":"2017/10/22/隐藏，待整理/20171022 活体检测/","link":"","permalink":"http://gorgegao.club/2017/10/22/隐藏，待整理/20171022 活体检测/","excerpt":"昨天终于磕磕绊绊的看人脸活体检上下文检测看完了，对于其中的方法，是有基本的了解了，但是对于其中涉及到的具体的跟踪标记上下文的算法以及其中用到的基于多尺度高斯函数的关键点选取方法细节还有点迷糊。 先总结下所得：基于场景上下文线索分析活体检测技术是一种将人脸识别机器定位在固定位置时的使用方法，该方法首先检测周围环境，选取其中的关键一些特征，(如我们在押运公司时，其可能选取背后的床、可以扫描到后面的电视等作为特征)，然后在检测到人脸的时候，比对后面的关键特征是否存在或者一致，如果存在，切人脸比对，则检测成功。这种方法具体实现方法时首先将系统初始化，选取场景上下文特征，即选取脸高或者宽的1/4作为特征区域(防止发型或其他原因遮挡脸部区域)，使用多尺度的高斯函数差的卷积选取关键点，然后在场景内选取关键点(相当于在背景区域选取如玻璃等关键较为特殊位置的点，去除墙壁等一致性较强的点)，最后使用场景上下文比较，使用LBP描述子/SIFT方法等提取场景特征集合，把场景上下文线索用几何表示没最后带入一种上线问检索比对的算式中，获取其比对得分，与设置的阈值做比较获得结果。 注：多尺度的高斯函数差的卷积选取关键点 未看懂！ LBP描述子，算法数学可以看懂，但有点模糊； 最后比较上，原理懂了点，数学公式未懂。为什么对其平方可得到比较结果。。 emmmmm,这几天陆续看了人脸的眨眼的活体检测方法(提取闭眼特征，SVM+状态机，openCV)，基于运动一致性的(半背景，光流法检测)，基于上下文的(背景中固有位置的检测方法)，中间由于说明书+运动壶耽搁两天，现在看一篇湖南的某硕士的基于OpenCV的硕士论文，看看能不能有点收货，顺便练习一波openCV。","text":"昨天终于磕磕绊绊的看人脸活体检上下文检测看完了，对于其中的方法，是有基本的了解了，但是对于其中涉及到的具体的跟踪标记上下文的算法以及其中用到的基于多尺度高斯函数的关键点选取方法细节还有点迷糊。 先总结下所得：基于场景上下文线索分析活体检测技术是一种将人脸识别机器定位在固定位置时的使用方法，该方法首先检测周围环境，选取其中的关键一些特征，(如我们在押运公司时，其可能选取背后的床、可以扫描到后面的电视等作为特征)，然后在检测到人脸的时候，比对后面的关键特征是否存在或者一致，如果存在，切人脸比对，则检测成功。这种方法具体实现方法时首先将系统初始化，选取场景上下文特征，即选取脸高或者宽的1/4作为特征区域(防止发型或其他原因遮挡脸部区域)，使用多尺度的高斯函数差的卷积选取关键点，然后在场景内选取关键点(相当于在背景区域选取如玻璃等关键较为特殊位置的点，去除墙壁等一致性较强的点)，最后使用场景上下文比较，使用LBP描述子/SIFT方法等提取场景特征集合，把场景上下文线索用几何表示没最后带入一种上线问检索比对的算式中，获取其比对得分，与设置的阈值做比较获得结果。 注：多尺度的高斯函数差的卷积选取关键点 未看懂！ LBP描述子，算法数学可以看懂，但有点模糊； 最后比较上，原理懂了点，数学公式未懂。为什么对其平方可得到比较结果。。 emmmmm,这几天陆续看了人脸的眨眼的活体检测方法(提取闭眼特征，SVM+状态机，openCV)，基于运动一致性的(半背景，光流法检测)，基于上下文的(背景中固有位置的检测方法)，中间由于说明书+运动壶耽搁两天，现在看一篇湖南的某硕士的基于OpenCV的硕士论文，看看能不能有点收货，顺便练习一波openCV。 来源：罗浩. 人脸识别中的活体检测方法研究[D].湖南师范大学,2015.摘要：细讲当前主流的活体人脸检测技术，并分析优缺点；赵忠对背景上下文与眨眼检测的方法分析其取得高识别率的原因及每个检测环节所用的时间，加以改进；搭建新的人脸识别活体检测系统，设计软硬件，实现人脸识别活体检测。 其中对背景检测时间比较长和准确率较低的缺点，给出一种基于图像金字塔的LK光流跟踪背景区域角点的计算方法；通过计算角点唯一改变从而判断背景是否发生改变的方法；改进优化算法6%； 给出基于秒不坐标定位人眼区域方法和基于形态学眼珠检测的眨眼算法判断检测方法，减少检测时间，提高检测速率。注：整个系统使用VC++和OpenCV搭建，由图像获取、图像算法处理和软件界面控制部分组成、 比于其他方法的欺骗行为，照片欺骗具有以下缺点：1）二维平面结构；2）不能产生眨眼、说话等生理行为。使用人脸照片进行伪造攻击，很容易被系统识破。基于高清图片和视频的攻击越来越难防护，各种传统的检测活体人脸的方法的正确率也有所下降，下载主要问题是面对高清图像以及模型的识别方法，或者是三者都适用的一种方法。假如将3D打印技术应用于人脸重建领域，许多传统的基于人脸属性的活体检测方法将会失效。三维人脸模具对人脸认证系统的危害性比照片与视频欺骗更大，以后研究的重点所在。 常见的活体检测方法 三维深度分析原理：人脸是三维的，照片是二维的。[5] De Marsico提出一种基于集合不变形的方法检测三维物体。[6] Andrea Lagorio 等人利用展示人脸与照片人脸的曲度不同进行检测。通过单值分解，或者PCA分解，计算所有点在笛卡尔坐标下的协方差，这些点分布以r为半径，以Ω为球形地区的球面上，定义图像上的像素点p的曲度，其中v是图像矩阵分解下最小特征值对应的特征向量。从人脸的3D曲度只可以明显看出真人脸有凹凸感，照片和视频曲度一眼，只有平面性。 优点:1）无需系统交互，如眨眼、微笑等；2）无需额外设备；3）对头部无方向或姿势要求。 缺点：该方法对照片、视频伪造攻击有很好的辨认效果，但是对三维人脸模型的识别一般 评价：于常见的人脸攻击是照片或视频，所以该方法具有很好的实用价值。 面部光流分析光流是运动跟踪领域中的重要概念，意味着每个特征点在两个不同时刻的位置的变化。原理：头部在摇晃摆动时，由于人脸表面各部分特征点运动不一致产生不同光流，照片或视频由于其集合结构一致，产生光流叫三维不提不同，光流一致性强。[8 Maciej Smiatacz 计算人脸转动时产生的光流，使用分类器对这些光流进行训练分类，通过对活体登记分类，判断人脸是否为活体人脸。 光流法检测不在赘述，粘上总结的算法流程图。 优点：实现原理比较简单，使用分类器，提高系统的自适应性；缺点：对光照比较敏感，在光线过强、过弱或者发生改变的情况下效果较差；而且对视频的检测能力较差。 傅里叶频谱分析傅里叶频谱分析是数字图像处理的基本概念，应用频谱分析可以解决许多时域中不能解决的问题。 当图像清晰时，其高频分量很多。由于图片或者视频攻击时，真实人脸与照片再摄像机成像的清晰度不同，通过分析人脸的高频分量所占比例，从而可以判断是否有伪造人脸攻击行为。 [9] Li等人提出一种结合高频傅里叶描述子(HFD)和动态傅里叶频率描述子(FDD)的方法来分析人脸，该方法原理有二:1)照片是平面结构且比较小，产生的高频分量比真脸少；2)连续图片中无表情变化的行为将使主频分量产生较小的标准差。[10] Junyan Peng等认为，真会人脸包含丰富的特征，其傅里叶频谱能量(HFT)也非常高，通过检测人脸照片的傅里叶频谱能量，可以判断出照片是否为活体；对待高清视频的攻击，可使用动态高频傅里叶描述子(DHFT)来检测人脸。 其中F(u,v)是脸部图像傅里叶变换后的频谱矩阵，fmax是频谱矩阵F(u,v)最大值。最终通过检测动态傅里叶高频描述子判断人脸是否为活体。优点：方法简单，不需要额外辅助硬件检测人脸缺点：准确率不高，随着人脸照片或者视频像素的增加，准确率下降，对光线比较敏感，当外界光线发生变化时，照片亮度也会发生变化，能量随着光照不断的变化。 多光谱成像技术常见活体检测技术是在可见光的条件下实现的，当光照过亮或者过暗发生剧烈变化时，人脸检测率会明显下降，活体检测效果也会降低。[11] Socolinsky比较了可见光波段和8~12nm热红外波段下人脸识别效果，发现热红外波段下的人脸检测有更好的效果，只有活体人脸才能在红外线下成像[12] 热红成像的基础上，采用多光谱成像技术检测人脸，首先通过滤光镜获得不同光照下的人脸集，然后根据不同光照下的反射率，提取人脸照片的梯度特征，最后使用SVM向量机分类器对这些梯度进行训练和分类，辨别活体人脸。优点：可检测的伪造人脸的攻击种类较多，照片、视频都可以；缺点：需要额外的检测环境如窄带滤光等、氖灯光等，并且需要采集很多光谱下的人脸图像样本。 眨眼等行为检测[13] Avinash Kumar Singh等提出一种基于眼睛和嘴巴运动检测活体优点：对伪造图像的检测较好缺点：对高清视频检测率不高，对带孔洞的照片+假人脸识别差。 基于局部二值模型的特征提取基于纹理的方法中的一种[14] 采用纹理和频谱分析进行活体识别[15] Tiago de Freitas Pereira等人提出一种动态纹理检测活体人脸方法。该方法使用三维平面的局部二值模型（LBP-TOP）描述人脸区域，统计彩色人脸图像的红、绿、蓝三个平面的 LBP 直方图，使用支持向量机分类器对所得到的数据训练和分类，最后识别出活体人脸。优点：获取了比较高的正确检测，同时不需要额外的硬件支持，对检测的场景没有较为苛刻的要求，在实际活体检测较为广泛缺点：在这个世界上，连自己都过不好，勿论他人，do my self！ 我是乔治高，我不为自己带盐！对这个世界抱有谦逊~","categories":[],"tags":[{"name":"活体检测论文初识","slug":"活体检测论文初识","permalink":"http://gorgegao.club/tags/活体检测论文初识/"}]},{"title":"活体检测之基于运动一致性的检测方法","slug":"隐藏，待整理/20171019 活体检测","date":"2017-10-18T23:48:46.000Z","updated":"2017-10-22T00:40:51.647Z","comments":true,"path":"2017/10/19/隐藏，待整理/20171019 活体检测/","link":"","permalink":"http://gorgegao.club/2017/10/19/隐藏，待整理/20171019 活体检测/","excerpt":"","text":"18号的活体检测论文看了一半，所以在这里补充完整，现在思路在看的时候有所调整，基于背景一致的方法迎合下金老师的口味，然后在庵后现在看的动作方面的活体检测方法感觉一般，不是很偏重于实践，还可以再找找，然后自己想看的傅里叶频谱分析法和静默活体检测还没有开始看，慌张慌张，加油加油，干宽看完背景的，看傅里叶的和静默活体的，然后抽时间再研究下百度接口、阿里接口有木有现成的张嘴、眨眼的检测方式。&amp;&amp;&amp;&amp;&amp;OpenCV也得抓紧看了，最后可怜下我的JAVA和英语。 来源：孙霖. 人脸识别中的活体检测技术研究[D].浙江大学,2010.基于活体人脸的场景上下文线索分析 当假冒视频用其他显示设备再人脸认证系统的摄像头前回放时，摄像头所拍摄的人脸周围的区域将包括假冒视频的背景、部分显示设备等，而对活体检测人脸来说，人脸周围应该是识别系统的工作场所背景，故假冒视频中人脸周围部分的图像和人脸认证系统所在的工作背景图像的不同可作为检测假冒视频的依据。换句话说，一般人脸识别设备将安装在固定的场所进行人脸的识别、检测，其背部主体环境将不会发生改变，而作为攻击的照片或者视频一般很难达到背景与人脸认证系统背景完全相似，所以，可以将背景作为上下文线索，检测是否为伪造攻击手段。 方法概述 系统初始化，拍摄一张图像作为人脸识别系统运行地的参考场景 对输入的脸部视频进行人脸检测 提取场景上下文线索(包括选择上下文线索区域和提取场景特征两个区域) 比对场景上下文线索提取场景上下文线索中包含选择场景上下文线索区域和提取场景特点特征点两个子步骤。 场景上下文线的提取算法 场景上下文线索的选取因为人的上侧脸的左右两侧小区域易受发型影响切局人脸较远的区域，欺骗照片和视频的场景可能不在该区域，所以选取人脸左右两侧的小块区域作为场景的线索。R为上下文线索区域，R高于人脸高相同，宽为人脸宽d的1/4,是人脸周围区域中获取视频假冒攻击线索的关键区域(疑问，脸大怎么办？)。备注：为防止头发、耳朵包括在场景上下文线索区域中，先将人脸区域的宽度分别向左右扩展d/4。 尺度空间极值点检测计算机视觉通过选取图像中物体关键点描述局部特征，广泛地应用在图像匹配、物体识别、图像检索等方面。关键点的局部特赠可以稳定的提取物体的关键信息，快速识别其中的物体。D.G.Lowe提出一种多尺度GAussian函数差的卷积中极值来选择图像中关键点的方法，该方法通过建立重采用图像金字塔，快速有效的选取关键点。 关键点的选取方法(未看懂！！！！)图像I(x,y)的尺度空间L(x,y,σ)定义为多尺度的高斯函数G(x,y,σ)和图像I(x,y)的卷积，D(x,y,σ)中的极值点的检测时将其和周围8个相邻点、尺度增大方向的相邻尺度上的9个点和尺度减小方向上的9个点比较，在数值上都小的话，称为极值点。 场景特征点的提取场景选择减少噪声(光线改变等因素)的干扰，在该篇文章中提取图像中若干个有代表性、信息丰富的关键点来表征场景—-背景特征点。可以降低非关键点对背景比对的影响；降低光线变化对相同背景的影响；减少特征计算。 问题—&gt;寻找区域R中稳定的特征点，方法：使用在图像相邻尺度差上检测局部极值点的方法。(尺度空间上极值点具有尺度不变性、独特性、对三维视点和光线变化有较强的鲁棒性，在10年时就已经成功的应用在图像匹配、物体识别、图像检索方面。) 措施—&gt;1）每一帧检测的极值点数目是不同的，将极值点数目固定为N(减少场景比对的计算量，使其更稳定)。 2）将区域R划分为ΛN* ΛM的网格，在每一个网格的宽度啊和高度为d/2ΛN和d/2ΛM。 3）尺度空间上极值点的搜索时在每个网络上一次。尺度空间上极值点的搜索最多只选择一个特征点。 4）如果所有网格都遍历了，但是特征点的数目少于N，那我们在不含有尺度空间上极值点的网格中选取最大梯度值的点位特征点。特征点选取算法：输入：图像Ii和外部场景图像IR输出：场景特征点Piif 在图像Ii中检测到脸；then 在Ii中检测场景区域与人脸； 初始化所有跟踪标记–false and fiducial 点的标记；fiducial_flagm,n-false for all m=0…ΛN-1 and n=0…ΛN-1 初始化调整全部表格的A&lt;sub&gt;m,n&lt;/sub&gt;， for all all m=0...Λ&lt;sub&gt;N&lt;/sub&gt;-1 and n=0...Λ&lt;sub&gt;N&lt;/sub&gt;-1 while number(Pi","categories":[],"tags":[{"name":"活体检测论文初识","slug":"活体检测论文初识","permalink":"http://gorgegao.club/tags/活体检测论文初识/"}]},{"title":"活体检测之基于运动一致性的检测方法","slug":"隐藏，待整理/20171018 活体检测","date":"2017-10-18T00:57:39.000Z","updated":"2017-10-18T23:33:09.751Z","comments":true,"path":"2017/10/18/隐藏，待整理/20171018 活体检测/","link":"","permalink":"http://gorgegao.club/2017/10/18/隐藏，待整理/20171018 活体检测/","excerpt":"","text":"一半是17号的，但是在18号，总结的时候按照18号的算吧，活体检测中的一种基于运动一致性的检测方法，该方法利用人脸识别时脸部及背景运动的方法，脸部和背景会有一定的运动，从而会产生光流量及相位角。分析前后关键点的相位角，如果背景与前景一起运动，则为伪造攻击(基于照片的攻击方式将被此类方法破解)。文章在最后说其使用的方法在REPLAY-ATTACK数据库中检测为100%,但是感觉理论上其应该不能识破视频攻击和模型攻击，所以个人感觉可靠性一般，应该结合纹理法(判断图像质量+是否为视频玻璃材质等)+人脸活体检测+前后背景一致方法识别才较为靠谱。emmmmm，现有的动作方法检测的话有好处，但是需要用户配合，适合在支付等精密，有时间去诠释领域，但是在人脸识别的隐秘识别领域还需继续提升。 应该是杨的作品 基于运动一致性的活体检测，及人脸区域和背景区域的运动一致性。 通过对REPLAY-ATTACK数据库的观察，本章提出的算法基于真人脸视频和伪造的视频之间的一个显著差异，即未在的人脸视频要么人脸区域和周边的背景区域的运动时一致的，要么是运动和背景区域均没有显著的运动；而真人脸视频的人脸区域的运动和背景区域是相互独立的，一般存在不一样的运动模式。 —-所以，通过提取人脸视频的人脸和背景之间的相互运动模式来进行人脸活体检测 选取光流矢量的方式对其进行估计，(公式暂时由于Latex插件未尝试安装，中午测试安装先写内容). 运动一致性特征 首先直观的对比不同类型的视频中光流矢量的分布，得到方法： 在人脸设备检测中，一般会得到较大的运动矢量均出现在人的身体区域； 人体存在非刚体变形，运动矢量的方向和大小也存在一些局部差异。 和真人脸相似的假人脸视频序列攻击，摄像头或多或少是运动的，背景区域存在一定幅度的运动矢量，根据背景与前景的运动一致性区分是否是攻击手段。运动矢量尽管不明显，但是背景区域与人体区域的运动矢量有较强的一致性。 和采集自显示频显示的照片的光流分布对比，几乎整张图像的光流矢量非常微弱，区分照片与真人脸采用此种方法。 手持设备进行攻击时，手持设备的运动将导致全局的运动，所以也存在光流一致性的问题，可以根据此种方法进行区分。 方法； 将视频帧图像分成多个区域，包括人脸区域、肩膀区域、背景区域；其中人脸分成额头、眼睛、鼻子、左脸、右脸、下巴六个区域；肩膀区域分为左中右三个区域；背景分为左右两个区域。 通过对每个区域内的光流矢量求平均值，人脸区域获得六个光流模值Fa{1,…,6}，从肩部获得三个模值序列Ta{1,2,3}，背景区域获得两个模值序列Ba{1,2}，各模值方向有其对应的方向Fm{1,…,6}、Tm{1,2,3}、Bm{1,2}。 通过光流矢量的模值、相位角比较，展示不同类型的假人脸的光流序列信息； 真人脸视频的光流序列和假人脸视频的光流序列存在明显差异，主要体现在光流模值的大小，光流序列的频率及相关性中。 序列频率：对22个运动序列进行一维的款苏傅里叶变换，随后，将其中22个序列对应的傅里叶系数进行归一化并拼接成一个特征向量。(对于区分真人脸视频和采集自固定照片的假人脸视频有重要意义) 光流模值直方图：统计11个模值序列的直方图特征，因为大多数的真人脸视频中的头部运动比较缓慢，响应的光流矢量的模值较小，而采用手持拍摄的假人脸的运动幅度较大，并且其中的幅度大于固定拍摄的假人脸视频。采集带固定人脸照片到假人脸视频序列的光流模值很小，Eric其它类型假人脸视频序列的光流矢量模值很大。 序列相关性：对于存在全局运动的视频序列，任意两个区域的模值序列或者方向序列均有较大的相关性。相比而言，真人脸与背景区域相关性较弱。 实验 本章方法主要针对特殊的攻击方法，如伪造的人脸视频的整帧图像均被伪造的人脸照片或者显示屏填充。使用数据库：REPLAY-ATTACK数据库 方法从每个视频序列中提取出运动一致性特征，随后在序列帧中提取MsLBP纹理特征，将两类特征进行组合并训练得到一个SVM分类器。最后根据得分情况得到最终识别的结果。 评估方法按照协议使用半-全错误率(Half-Total Error Rate,HTER)评估标准，扩展集中获取阈值，是的扩展集上的视频序列可最大份，即时错误接受率和错误拒绝率相等，称为等错误率。 实验结果本文算法可以有效检测，在测试集中分类十分明显，本文方法和LNMIIT提出的方法取得的效果较好。","categories":[],"tags":[{"name":"活体检测论文初识","slug":"活体检测论文初识","permalink":"http://gorgegao.club/tags/活体检测论文初识/"}]},{"title":"活体检测之杂谈与基于动作(张嘴)活体检测的研究","slug":"隐藏，待整理/20171017 活体检测","date":"2017-10-17T00:57:39.000Z","updated":"2017-10-23T23:20:20.002Z","comments":true,"path":"2017/10/17/隐藏，待整理/20171017 活体检测/","link":"","permalink":"http://gorgegao.club/2017/10/17/隐藏，待整理/20171017 活体检测/","excerpt":"","text":"17号看的几篇论文，本来想看基于傅里叶频谱的分析方法，前面看了一种人脸识别+唇语模型的检测方法(细微，只了解摘要)；一篇315的报道，基于315的方法及其中提到活体检测方法，但是对其中两种方法都没有深入研究；看到最后。。。。看到一篇基于动作的检测方式，遂即看了下，但是还没有整理成文字，暂时以图片形式发出来。其中主要使用OpenCV进行人脸定位，然后将人脸识别分为活体检测、攻击检测、人脸比对三方面。让后首先使用OpenCV将人脸定位，获取平均人脸特征位置，然后手动甄别真假人脸先进行学习测试，计算出128*128的SIFT特征，最后根据SVM方法训练获取分类器；在文章最后，根据有限状态机列出张闭嘴的状态组合，在人脸活体检测时，根据分类器检测到拥有张闭嘴状态组合的活体即为有效的活体检测方法，为提高精准率，该方法使用眼睛、动作嘴随机组合的方法，进行三次验证，提高精确度，并防止视频验证。最后没有提出实验数据，可能这种方案作者只在理论中提出，而且其验证方法才能够用户体验性及准确度方面堪忧。 知网中搜索 [1]任玉强,田国栋,周祥东,吕江靖,周曦. 高安全性人脸识别系统中的唇语识别算法研究[J]. 计算机应用研究,2017,34(04):1221-1225+1230.一种将人脸识别与口令密码结合，并采用唇语识别技术进行活体检测的高安全身份认证系统。 本文建立CNLIP1和CNLIP2两个较大的汉语唇语数据库； 为保留唇语的时序型，采用堆叠卷积独立子空间分析(ISA)深度神经网络模型实现唇动时序特征的提取； 后提出使用哪个迁移学习算法来训练特定人存储与识别模型。实验证明，唇动时序特征能够更好的表征出数字串唇语，迁移学习训练的特定人唇模型能够那么足活体检测的需求，所构建的高安全性人脸识别系统具有较好的攻防效果。 en….这篇文章是基于唇语与识别的活体检测，与想看的傅里叶频谱差距较大，暂时忽略。 [2]张吉. 央视315上演“换脸术” 刷脸安全吗[N]. 中国城乡金融报,2017-03-24(A04).人脸识别是基于人的脸部特征信息进行身份识别的一种生物识别技术，一般包括三个步骤:活体检测、攻击检测和人脸比对. 注：攻击检测是专门用来预防个别恶意用户通过各类手段进行攻击的一道屏障，它通过更为复杂的算法完成面部立体成像、面部光场分析、局部微细分析等，完成实现攻击行为的识别和阻止。 活体检测作为安全检测第一道门，现在使用方法一般通过判断计算用户的动作与期待动作在动作一致性及连续时间序列上的吻合程度，判断是否为真人。 央视315晚会活体检测案例央视 315 晚会主持人展示了一个手机 APP 刷脸验证过程，主持人用一个手机捕捉自己的动作视频，用攻击程序将视频中的人脸换成另外一张人脸，再将另一个手机的摄像头对着视频进行拍摄，攻破活体检测，又通过了人脸识别比对，成功完成刷脸验证。 提出两种更加安全，不易被攻破的方案： 红外双目活体检测红外双目活体检测是结合红外双目摄像头，同时实时采集近红外和可见光两种图像，并检测是否为活体。 优点：有准确率高、识别时间短、方便快捷、多场景支持等特点，可预防现有的全部人脸攻击，安全性极佳。 缺点：需专用设备、成本较高，不适于移动设备。 静默活体检测静默活体检测是基于单帧图像算法与图像序列算法的活体检测，单帧图像算法以视频中的各单帧图像为单位，分析图像的内容，根据图像的颜色和纹理特征，判断图像中的人脸是否存在照片、视频或面具等攻击方式，图像序列算法是从图像序列中，提取出多帧图像之间相对变化的动态特征，作为识别活体和非活体的重要线索。它们分别提取不同的视觉特征，充分利用有效的图像信息，最终集合成一个功能强大的整体。 优点：适于各种设备，尤其适于移动设备，成本较低，不需专用摄像头。缺点：会受到光照等的影响；面部无表情动作时，亦会受到干扰。这篇文章把人脸识别技术分为活体检测、攻击检测和人脸比对三个阶段，其实就是将面部微纹理、面部立体成像及面部光场分析作为攻击检测，检测是否受到视频、照片的攻击。而仅仅将活体检测技术作为是否证明人使活动生物的一部分；静默活体检测的话看的不是太懂，不过大致意思就是选取一段视频的每一帧进行分析，根据每一帧图片间的动态特征变化判断其是否为真人 黄叶珏. 基于交互式随机动作的人脸活体检测[J]. 软件导刊,2015,14(12):26-28. 针对人脸识别可以通过照片和视频进行攻击的问题，交互式随机动作的活体检测方法。对认证用户发出随机指令运动，通过对视频中人脸检测和按要求动作完成度实现活体检测。人脸检测与人脸对其算法 可采用OpenCV中的AdaBoost人脸检测器实现人脸定位； 获取视频的人脸位置后，利用对其算法[7]定位人脸的特征点位置，给定图像中n个特征点位置Pi∈P ,提取对应位置的SIFT特征[8]、HOG特征[9]或其它特征，根据公式(1)求最小化实验人脸特征点对齐： 注：SIFT(Scale-incariant feature transform)是一种检测局部特征的算法，该算法通过求一幅图中的特征点及其有关的scale和orientation(大小和方向)的描述子得到特征并进行图像特征点匹配。 HOG(Histogram of Oriented Gridients)特征检测算法，是一种解决人体目标检测的图像描述子，是一种用于表征图像局部梯度方向和梯度强度分布特性的描述符。其主要思想是：在边缘具体位置位置的情况下，边缘方向的分布也可以很好的表示行人目标的外形轮廓。 进行行人检测取得成功后，都是以HOG+SVM的思路为主。 HOG特征检测算法的几个步骤：颜色空间归一化—&gt;梯度计算—&gt;梯度方向直方图—&gt;重叠块直方图归一化—&gt;HOG特征 先用人工标注的方式对训练数据集人脸各个特征点的位置进行标注。使用人脸检测器对训练数据集的人脸进行定位，训练最终获得所有特征点的坐标计算器平均值，得到一个训练集的平均人脸特征点位置，作为人脸特征点位置的初始配置。 其它内容已经看完，在纸张中，先附上图片，待晚上回去补充。 获取人脸的关键位置的n个特这鞥点，从其中提取SIFT特征或者HOG特征 首先进行人脸检测与对齐： 训练人脸模型得到对齐模型 迭代获取 各人脸标准特征点的位置 每一帧获取一个人脸框，选其中最大的作为候选 用平均人脸特征位置作为初始配算 根据人脸对其模型进行迭代获取人脸位置特征 为例提高鲁棒性，引入一个评分模型来降低其中的误判断； 用OpenCV人脸检测器对FDDB数据库检测，获取有误的窗口，分成人脸和非人脸； 利用前面的到的人脸对齐模型对人脸和非人脸进行对齐迭代，计算出32*32的128位SIFT特征 连接SIFT特征到SVM训练器中 基于有限状态机的张嘴和眨眼判断 将人脸检测对齐后，得到人脸对齐特征点的位置，根据特征点的位置，只需判断张嘴和眨眼的动作即可； 眼睛处 ，计算眼睛的宽和高；根据高度和宽度的比值确定其是否为张开眼或闭眼 根据比值及状态机判断其是否为眨眼 同理有张嘴和闭嘴的判断。 由于单方面容易被破解，所以选择随机三次，由张闭嘴、眨眼左与眨眼右配合，选择获得结果，提高难度性及视频的把控性，但是其导致用户的行为及匹配多很多，不是很适用。","categories":[],"tags":[{"name":"活体检测论文初识","slug":"活体检测论文初识","permalink":"http://gorgegao.club/tags/活体检测论文初识/"}]},{"title":"活体检测论文汇报","slug":"隐藏，待整理/20171015 活体检测汇报","date":"2017-10-16T00:25:43.000Z","updated":"2017-10-23T14:32:30.236Z","comments":true,"path":"2017/10/16/隐藏，待整理/20171015 活体检测汇报/","link":"","permalink":"http://gorgegao.club/2017/10/16/隐藏，待整理/20171015 活体检测汇报/","excerpt":"","text":"汇报内容：最近看论文及资料： [1]杨健伟. 面向人脸识别的人脸活体检测方法研究[D].北京邮电大学,2014. [2]陆成学. 人脸认证应用中活体检测技术探讨[J]. 中国金融电脑,2017,(08):89-90. [3]盘海玲. 人脸识别系统中活体检测技术[J]. 科技资讯 [4]孙霖. 人脸识别中的活体检测技术研究[D].浙江大学,2010. [5]甘俊英,刘呈云,李山路. 多颜色空间中三正交平面的WLDLBP活体人脸检测算法[J]. 五邑大学学报(自然科学版),2017,31(02):14-19. 知乎—活体检测资料 活体检测定义： 活体检测技术是基于生物特征识别的人脸识别技术中用于鉴别识别对象是否为活体的重要技术手段，是防范照片、视频、模型等手段破解人脸识别系统的重要保障， 活体检测是用于辨别人脸的真伪，保证人脸识别系统稳定并安全的运行。 活体检测的功能就是辨别其是否为“真实的人脸”，识别假脸，防止他人因盗用他人照片等方式攻击人脸识别系统。 活体检测攻击方式在活体检测中的假冒攻击一般分有 照片攻击; 视频攻击; 3D模型攻击; 通过人+照片处理，视频处理等衍生攻击手段。 注：这些攻击手段部分可以通过现有的人脸识别系统判别，但很多假冒的攻击方式仍不能处理。 存在不足之处 检测方式能识别一道两种不同的手段，综合性一般，检测方式用户体验性不同。 以现在的眨眼为例，能识别正常用户是活体，但是对真脸照片+背后动作无防范； 基于纹理的方法，一般对低质量的照片防范较好，高质量的平板成像等攻击防范较差。 *实例：* 以支付宝人脸登录系统为例进行活体检测功能进行测试，对正常的活体人脸可以正常识别，识别成功率也极高；同时对单纯的照片及无眨眼活动的视频，因无眨眼这一活体检测措施，活体检测未通过；但是对于有眨眼活动合法用户视频、合法用户照片加非合法用户眨眼等方式，活体检测依旧通过。 17年315晚会，人脸识别被曝存在隐患，主持人现场凭借两部手机及一个换脸APP,&quot;攻破&quot;人脸识别系统。 现在有的检测方法 基于微纹理方法： 依据：利用假人脸经过二次采集或多次采集呈现出于真人脸图片在纹理细节上的差异(如真实形状和局部高光的差异等) 方法： (1)傅里叶频谱分析，人脸照片尺寸小于这是人脸尺寸，同时照片是平面的，其在频域中的高频分量比真人脸照片少；打印的照片再时间上不存在局部运动，其在频域上的变化在时域上很小； 傅里叶频谱分析理解：照片是平面的，所以照片的高频分量应该小于活体人脸成像，其次如果照片放置在相机前，因为脸部缺少表情变化，所以频率分量的标准差应该很小，活体检测人脸和普通照片在频域上的差异比较。即在很短的一段时间内局部表情等变化有幅度变化，而照片则没有 (2)考虑图像的空间信息，将频域特征转化为空域特征来分析，真人脸具有三维结构，假人脸(照片)是二维的； (3)真人脸的表面粗糙度和照片的粗糙度不同，提取基于Lambertain反射模型的漫反射区分方法，对输入的图像进行平滑，通过高斯滤波提取图像的DoG特征； (4)利用图像多尺度和多区域的LBP特征进行二元SVM分类的方法区分真伪； 性能描述：比较重要，但是容易受到光照、图像分辨率等的影响，在视频攻击的时候效果也较差。 基于运动信息 依据：从视频中提取人脸的特定的运动信息以判定真假人脸。 方法： (1)利用眨眼运动、嘴部运动，使用常规的动态规划算法完区分推理； (2)通过人脸多个部件的时序运动信息来做帧间人脸的判定，人脸的中心区域要比周边的区域运动幅度更大，用光流法来估计； 邓刚等人提出眨眼检测活体，该方法将眼睛状态分为睁开和闭住连个状态，通过一个睁开和闭住眼睛的二类SVM分类器判断，训练样本是睁眼和闭住的眼睛。如果分类器输出结果为闭住的眼睛，那么系统为活体。 (3)通过分析嘴唇的运动是否和阅读一段文本时的嘴型是否匹配来判断真伪。(需要有一种稳定的人脸及嘴部检测定位算法及用户的配合) (4)通过结合视频和音频一起配合。 (5)基于光流+人脸点头或晃动，光流运动包含平移、旋转、移动、摆动四个基本类型，2D、3D物体在摆动上方面差异很大，所以根据摇头等摆动幅度较大的方式检测。 性能描述：这是目前现有移动端商用技术中应用最广的，大多采用随机指令进行交互；但是只要将合法用户的人脸图片的嘴部、眼部等需要验证的区域掏并在照片后作出相应的动作即可破解。该方法对用户的交互要求较高，而且欺骗成本较低。 基于多光谱 依据：基于皮肤和其它材质在光谱反射率上的差异判断真假人脸。基于多光谱成像的方法旨在从可见光波段之外找到更加有效的波段组合，使真人脸和伪造人脸呈现较大差异，从而进行判断区分。 方法描述： (1)利用红外成像技术，选取两个波段结合可见光成像进行人脸伪装检测； (2)使用850nm的近红外光，排除不可控的可见光，在活体检测同时进行人脸检测； (3)选取多个波段用于人脸采集，并将数据投影到一个二维空间，使用线性判别分析(LDA)区分真伪。 性能描述:检测方法有效，但是对擦剂条件要求比较严格，而且呈现出的多光谱图像用户体验较差，成本高于可见光系统； 基于三维成像恢复 依据：人脸具有三维结构，照片等则无，选取运动中的几帧图片，根据关键点、关键帧，恢复初始人脸结构，然后对人脸结构进行配准，如果是真人脸时，恢复出正常人脸，但是如果是照片时，犹豫在角度上差异等无法直接恢复，视频的话，也由于扁平的图像导致恢复的结构有问题； 基于静默活体检测 依据：在人脸活性检测的同时，面部会有微小的习惯性动作，如眼皮和眼球的律动、眨眼、嘴唇及其周边面颊的伸缩等进行甄别； 性能描述：在人面部无表情动作时检测效率低下，会受光线等其他因素的影响备注：具体方法暂无，通过知乎寻找，在实际应用中，我司人脸识别设备似乎也用的是该种方法 以南京某厂Android活体检测设备为例，疑似采用静默活体检测方式，在人脸无明显表情变化时，同样无法进行有效的人脸识别活动，经常会出现无法检测出人脸的状况。 基于多种特征融合 依据：将上述几种方法融合 方法描述： (1)通过结合运动信息和纹理信息进行检测，因为纹理信息的方法无法处理高质量(高分辨率)的攻击，运动交互方法至少可以保证检测对象是活体; (2)使用非刚体运动–&gt;人脸–&gt;背景一致性+图像条带效应，前背景一致性在伪造的人脸照片比较明显； (3)融合运动相关分析和人脸纹理分析，提取LBP特征通过分数层融合进行最终辨别真伪。 性能描述：这类方法往往在机理上形成互补，检测率较高，但是平均处理时间较大，对硬件的要求较高。 补充：陆成学也提出两种方案： 提出两种扩展方式 基于可见光+近红外双目异质摄像头+眼周微纹理分析法红外直接排除照片视频攻击，(照片和Pad在近红外下成像差甚至无法成像)；眼周包含信息最丰富且辨识度最高，目前的人脸面具，重构时眼部微纹理不易构造。 基于眼纹区域的活体检测技术眼纹：位于眼白区域，指人的眼睛中去除眼睛虹膜和瞳孔的区域，含大量纹理信息。方案：被检测者先录制视频，借助图像增强技术，加强眼白的纹理信息。即获取图像并检测眼睛位置–&gt;眼白分割–&gt;增强眼白的问题信息–&gt;检测眼白中感兴趣的角点–&gt;在角点周围提取特征–&gt;判断是否为活体检测方法：由于图片和预先录制好的视频眼睛纹理信息不清晰，录制相差很多，可防止攻击，而且模型精确到这般精细又提升很大难度。 以后要做的方向要做鲁棒性好的好体检测手段需要注意： 实时处理数据； 受光照、光线等外界影响小； 用户界面自然，交互少； 欺骗代价尽可能搞(不能简单的使用照片等攻击识别，哪怕是用模型也要用昂贵真实度高的来破解)； 在用户配合上尽可能容易；在设备上尽可能简单。 对此，在静默活体方面，现在正在找类似的论文看看，是基于人脸型变化的，感觉可能会更加符合实际检测情况。 存在优势：只要站在面前，就可以进行检测，用户简单，方便； 劣势：如果检测期间，无表情变化，则无反应；能监测照片、简易3d模型，对于视频，还有照片+人脸组合的状况未知。 补充人脸活体检测数据库：南京航空大学的NUAA数据库、Idiap的PRINT-ATTACK数据库、张洪科院自动化研究所的CASIA-FASD数据库、Idiap的新数据库REPLAY-ATTACK。 活体检测技术性能评估度量攻击方法的安全性和活体检测的性能，需要合适的方法，常见的性能度量指标有错误拒绝率(False reject rate,FRR)、错误接受率(False accept rate,FAR)、等错误率(Error equal rate,EER)、获取错误率和平均处理时间等。 活体检测方法(L)指标： L错误拒绝率(LFRR) L错误接受率(LFAR) L获取错误率(Failure to acquire) L平均处理时间(Mean transaction time) 活体检测系统(S)评估的总指标 S错误拒绝率(SFRR) S错误接收率(SFAR) S错误获取率(Failure to acquire) S平均处理时间(Mean transaction time)","categories":[],"tags":[{"name":"活体检测资料","slug":"活体检测资料","permalink":"http://gorgegao.club/tags/活体检测资料/"}]},{"title":"活体检测资论文综述及学习","slug":"隐藏，待整理/20171014 活体检测","date":"2017-10-13T23:53:34.000Z","updated":"2017-10-17T02:28:54.411Z","comments":true,"path":"2017/10/14/隐藏，待整理/20171014 活体检测/","link":"","permalink":"http://gorgegao.club/2017/10/14/隐藏，待整理/20171014 活体检测/","excerpt":"","text":"今天首先看看傅里叶频谱分析，然后在看一到两篇小期刊，了解下是否还有其它技术做活体检测的。看陆学成的人脸认证应用中活体检测技术探讨。 补充 孙霖 活体检测 傅里叶频谱分析[60] Jiangwei提出用傅里叶频谱分析方法区分活体检测人脸和照片 原理：照片是平面的，所以照片的高频分量应该小于活体人脸成像，其次如果照片放在相机前，因为脸部缺少表情变化，所以频率分量的标准差应该很小。 定义高频描述子(HDF)，在活体中，由于面部表情等原因，有变化则高频描述子较高，反之，图片等由于无面部表情运动，其高频描述子为0.引入频率动态描述子(FDD)，表示脸部能量的时态变化。活体人脸在检测时会存在脸部能量的动态变化，所以其能量变化值较大，假冒的照片人脸缺少能量的动态变化，FDD接近0. 14号第一篇期刊 人脸认证应用能够中活体检测技术探讨 来源：陆成学. 人脸认证应用中活体检测技术探讨[J]. 中国金融电脑,2017,(08):89-90.来源于中国金融电脑，被引0，下载17次，当做跨界了解迅速看下就OK。 金融行业将人脸识别技术作为身份确认的一种手段，即在使用传统密码识别、卡片识别时，加人脸、指纹等生物特征识别。陆认为“人脸识别是实现线上远程生物特征鉴权的最易行和友好的技术手段”。 人脸识别认证身份需要两点，一为人脸比对，二为活体检测。 将攻击方式总结为四种人脸照片攻击、人脸合成攻击、人脸食品攻击、3D模型攻击或者面具攻击。 将解决方案总结为四种 基于交互式活体检测(人脸左右转、张嘴、眨眼等)问题是用户体验不佳+易被攻破 基于3D物体和2D物体光流的差异进行活体检测光流运动包含平移、旋转、移动、摆动那那个四个基本类型，2D、3D物体在摆动上方面差异很大，所以根据摇头等摆动幅度较大的方式检测。 基于二次成像原理的活体检测(等同于基于纹理)二次成像在分辨率、人表面反射、正常阴影等纹理差异。纹理中的图像高光、图像模糊、图像阴影等 基于三维成像基于人脸两个或多个角度的照片，合成3D模型判断。(无法搞定视频、面具攻击手段)提出两种扩展方式 基于可见光+近红外双目异质摄像头+眼周微纹理分析法红外直接排除照片视频攻击，(照片和Pad在近红外下成像差甚至无法成像)；眼周包含信息最丰富且辨识度最高，目前的人脸面具，重构时眼部微纹理不易构造。 基于眼纹区域的活体检测技术眼纹：位于眼白区域，指人的眼睛中去除眼睛虹膜和瞳孔的区域，含大量纹理信息。方案：被检测者先录制视频，借助图像增强技术，加强眼白的纹理信息。即获取图像并检测眼睛位置–&gt;眼白分割–&gt;增强眼白的问题信息–&gt;检测眼白中感兴趣的角点–&gt;在角点周围提取特征–&gt;判断是否为活体检测方法：由于图片和预先录制好的视频眼睛纹理信息不清晰，录制相差很多，可防止攻击，而且模型精确到这般精细又提升很大难度。 ####来源2 甘俊英,刘呈云,李山路. 多颜色空间中三正交平面的WLDLBP活体人脸检测算法[J]. 五邑大学学报(自然科学版),2017,31(02):14-19. 摘要：基于动态纹理分析，在传统纹理检测中，一半利用灰度视频进行检测，在颜色纹理方向检验较少，导致检测识别率偏低。该文章提出多颜色空间中三正交平面的动态局部纹理特征算法WLDLBPTOP，分析视频帧数不同对活体人脸检测的准确率影响，其EER为2.69%,HTER为3.24%，识别率更高。 这种方法基于动态纹理处理活体，暂时与想于现在使用的运动活体检测与傅里叶频谱活体检测暂时无关，暂时先放在一边不去看。","categories":[],"tags":[{"name":"活体检测资料","slug":"活体检测资料","permalink":"http://gorgegao.club/tags/活体检测资料/"}]},{"title":"活体检测论文观看","slug":"隐藏，待整理/20171011 活体检测1","date":"2017-10-11T01:18:52.000Z","updated":"2017-10-16T00:31:50.518Z","comments":true,"path":"2017/10/11/隐藏，待整理/20171011 活体检测1/","link":"","permalink":"http://gorgegao.club/2017/10/11/隐藏，待整理/20171011 活体检测1/","excerpt":"emmmmmm，昨天在知乎上找到一些资料，活体检测方面算是对人脸识别攻击的一项重要把控方式，攻击手段依旧是那三种，照片、视频、模型(加了一种照片后加动作的，也算是照片吧)。对人脸识别，这是一项十分钟呀的技术，决定着人脸是否能够通过比对。 在解决这种问题的方法上，昨天知乎介绍中也通俗易懂的介绍大概方法..emmmm，照片呢，用加动作来完成；照片+扣动做动作，基于纹理分析图片，基于运用一致性分析边界图像变化；基于视频呢，可以根据纹理+视频光学是否存在模糊进行判定，对摩尔纹之类的进行判定判定，总体也是基于纹理法进处理；基于模型呢，可以直接简单粗暴的使用红外感应判断。其中还提出一种关于静默活体判断的方法。 静默活体，个人感觉就是判断你在照片前的几秒内，微表情有无变化，如眼睛自然眨眼，脸部嘴唇抖动等(反正就是人的正常自然生理活体)，这种的话可以进行建模，然后获得人脸的模型，最后判断在检测的几秒内有无产生这些活动，这个也可以通过机器学习的方法进行构建，先建立模型，然后学习这些动作，学习，分析获取关键的特征，对关键的特征进行处理，最终获得想要数据。。P:机器学习获取关键特征之后该怎么办，母鸡，回去找本机器学习的书重新开始看吧，把这个什么特征向量，什么鬼流程回头要搞清楚。 今天的工作，看浙大博士孙霖的人脸识别中的活体检测技术研究，10年的一篇论文，可能会有点老，但是希望给自己帮助，come on , go ~","text":"emmmmmm，昨天在知乎上找到一些资料，活体检测方面算是对人脸识别攻击的一项重要把控方式，攻击手段依旧是那三种，照片、视频、模型(加了一种照片后加动作的，也算是照片吧)。对人脸识别，这是一项十分钟呀的技术，决定着人脸是否能够通过比对。 在解决这种问题的方法上，昨天知乎介绍中也通俗易懂的介绍大概方法..emmmm，照片呢，用加动作来完成；照片+扣动做动作，基于纹理分析图片，基于运用一致性分析边界图像变化；基于视频呢，可以根据纹理+视频光学是否存在模糊进行判定，对摩尔纹之类的进行判定判定，总体也是基于纹理法进处理；基于模型呢，可以直接简单粗暴的使用红外感应判断。其中还提出一种关于静默活体判断的方法。 静默活体，个人感觉就是判断你在照片前的几秒内，微表情有无变化，如眼睛自然眨眼，脸部嘴唇抖动等(反正就是人的正常自然生理活体)，这种的话可以进行建模，然后获得人脸的模型，最后判断在检测的几秒内有无产生这些活动，这个也可以通过机器学习的方法进行构建，先建立模型，然后学习这些动作，学习，分析获取关键的特征，对关键的特征进行处理，最终获得想要数据。。P:机器学习获取关键特征之后该怎么办，母鸡，回去找本机器学习的书重新开始看吧，把这个什么特征向量，什么鬼流程回头要搞清楚。 今天的工作，看浙大博士孙霖的人脸识别中的活体检测技术研究，10年的一篇论文，可能会有点老，但是希望给自己帮助，come on , go ~ 来源 知网 孙霖. 人脸识别中的活体检测技术研究[D].浙江大学,2010.摘要 人脸识别技术日趋成熟，商业化应用愈加广泛，攻击方法多样，近年来，活体检测技术取得一些进展，但是在实际应用中现有的方法安全可靠性还不高(这是10年的，现在已经有部分技术应对活体检测，但是也不是很完善)。该文章从活体生理行为、活体环境特征和活体红外特性三个角度，深入研究活体检测技术。1、讲述活体研究的主要框架，阐述活体人脸的重要生命特征，综述现状，分析优劣性。 人脸特征是生物认证技术中生理特征认证的一种重要特征，生物特征因其固有的属性不容易被仿制、盗用，使其安全性大大提高。近年来，随着指纹识别、虹膜识别、人脸识别等生理特征认证技术的发展，生物认证系统逐渐走出实验室，走进人们的生活。早在2010年(时间待考证)，指纹认证、虹膜认证就已经融入我们的生活，人脸特征作为生理非接触型特征的一种，侵犯性低，容易被用户接受；隐蔽性好，不仅适合门禁等监控，也适合安全防范、犯罪监控等领域；自然性好，单纯刷脸，更符合人类的识别习惯。随着人脸识别技术的发展，人脸识别已经开始在各种行业进行试点，支付宝等支付软件已经开启刷脸认证登录；北京西站人员过闸机，需要进行人脸认证；天坛公园的公厕需要刷脸过后几十秒才能再次取厕纸，来限制厕纸的取用量。这些人脸识别已经投入在使用当中，但是，其中面对的假冒攻击问题仍旧存在，使用照片视频等即可攻破人脸识别的防线。尽管现在的一些人脸识别系统中已经加入了简单的生理动作活体检测认证，如张张嘴，点点头等行为认证方式，但是正如315晚会中展示出的，使用一些处理软件与静态图片，即可破解人脸识别系统，伪造他人身份。假冒攻击仍然是人脸识别认证系统中的重大威胁。 在人脸识别中的假冒攻击一般分有照片攻击、视频攻击及3D模型攻击三种主要攻击手段，还有通过人+照片处理，视频处理等衍生攻击手段，这些攻击手段部分可以通过现有的人脸识别系统判别，但很多假冒的攻击方式仍不能处理。实例：以支付宝人脸登录系统为例进行活体检测功能进行测试，对正常的活体人脸可以正常识别，识别成功率也极高；同时对单纯的照片及无眨眼活动的视频，因无眨眼这一活体检测措施，活体检测未通过；但是对于有眨眼活动合法用户视频、合法用户照片加非合法用户眨眼等方式，活体检测依旧通过。 现在活体检测方法主要分基于微纹理、基于运动信息、基于多光谱和多种特征融合的方法。在目前市场应用中国，大多使用基于运动信息的检测方式，即在视频中提取人脸区域特定的运动信息以判定真假人脸。实例以支付宝为例，其活体检测要求其产品使用者按其提示配合系统做出一些交互性动作，如眨眼，张嘴等行为(目前支付宝的活体检测只有单一的眨眼判断)判断是否为伪造攻击行为；另外还利用三维建模技术加强其对伪造攻击的辨别。 提到四种方法，在此对四种方法重新认识，根据知乎上提供信息进行总结，在此再次感谢高新科技的岑雨 基于微纹理方法： 依据：利用假人脸经过二次采集或多次采集呈现出于真人脸图片在纹理细节上的差异(如真实形状和局部高光的差异等) 方法： (1)傅里叶频谱分析，人脸照片尺寸小于这是人脸尺寸，同时照片是平面的，其在频域中的高频分量比真人脸照片少；打印的照片再时间上不存在局部运动，其在频域上的变化在时域上很小； (2)考虑图像的空间信息，将频域特征转化为空域特征来分析，真人脸具有三维结构，假人脸(照片)是二维的； (3)真人脸的表面粗糙度和照片的粗糙度不同，提取基于Lambertain反射模型的漫反射区分方法，对输入的图像进行平滑，通过高斯滤波提取图像的DoG特征； (4)。。。。 性能描述：比较重要，但是容易受到光照、图像分辨率等的影响，在视频攻击的时候效果也较差。 基于运动信息 依据：从视频中提取人脸的特定的运动信息以判定真假人脸。 方法： (1)利用眨眼运动、嘴部运动，使用常规的动态规划算法完区分推理； (2)通过人脸多个部件的时序运动信息来做帧间人脸的判定，人脸的中心区域要比周边的区域运动幅度更大，用光流法来估计； (3)通过分析嘴唇的运动是否和阅读一段文本时的嘴型是否匹配来判断真伪。(需要有一种稳定的人脸及嘴部检测定位算法及用户的配合) (4)通过结合视频和音频一起配合。 性能描述：这是目前现有移动端商用技术中应用最广的，大多采用随机指令进行交互；但是只要将合法用户的人脸图片的嘴部、眼部等需要验证的区域掏并在照片后作出相应的动作即可破解。该方法对用户的交互要求较高，而且欺骗成本较低。 基于多光谱 依据：基于皮肤和其它材质在光谱反射率上的差异判断真假人脸。基于多光谱成像的方法旨在从可见光波段之外找到更加有效的波段组合，使真人脸和伪造人脸呈现较大差异，从而进行判断区分。 方法描述： (1)利用红外成像技术，选取两个波段结合可见光成像进行人脸伪装检测； (2)使用850nm的近红外光，排除不可控的可见光，在活体检测同时进行人脸检测； (3)选取多个波段用于人脸采集，并将数据投影到一个二维空间，使用线性判别分析(LDA)区分真伪。 性能描述:检测方法有效，但是对擦剂条件要求比较严格，而且呈现出的多光谱图像用户体验较差，成本高于可见光系统； 基于三维成像恢复依据：人脸具有三维结构，照片等则无，选取运动中的几帧图片，根据关键点、关键帧，恢复初始人脸结构，然后对人脸结构进行配准，如果是真人脸时，恢复出正常人脸，但是如果是照片时，犹豫在角度上差异等无法直接恢复，视频的话，也由于扁平的图像导致恢复的结构有问题；备注：来源于论文 杨健伟. 面向人脸识别的人脸活体检测方法研究[D].北京邮电大学,2014. 基于静默活体检测依据：在人脸活性检测的同时，面部会有微小的习惯性动作，如眼皮和眼球的律动、眨眼、嘴唇及其周边面颊的伸缩等进行甄别；性能描述：在人面部无表情动作时检测效率低下，会受光线等其他因素的影响备注：具体方法暂无，通过知乎寻找，在实际应用中，我司人脸识别设备似乎也用的是该种方法 以南京某厂Android活体检测设备为例，疑似采用静默活体检测方式，在人脸无明显表情变化时，同样无法进行有效的人脸识别活动，经常会出现无法检测出人脸的状况。 基于多种特征融合依据：将上述几种方法融合方法描述：(1)通过结合运动信息和纹理信息进行检测，因为纹理信息的方法无法处理高质量(高分辨率)的攻击，运动交互方法至少可以保证检测对象是活体;(2)使用非刚体运动–&gt;人脸–&gt;背景一致性+图像条带效应，前背景一致性在伪造的人脸照片比较明显；(3)融合运动相关分析和人脸纹理分析，提取LBP特征通过分数层融合进行最终辨别真伪。性能描述：这类方法往往在机理上形成互补，检测率较高，但是平均处理时间较大，对硬件的要求较高。 目前的活体检测技术大多使用基于运动信息的活体检测方法，能够有效的区分伪造照片的攻击，但是对视频攻击及3D模型等较复杂的攻击仍未能有效防范。 // 本文从人脸识别活体检测静默活体出发，根据人脸识别的有效防范措施搞定解决非法用户的视频操作。 P:现在有了这些方法，那么我应该去做些什么呢？从其中什么点出发，找到什么东西去做，需要找一种新的活体检测的方法？需要在原来的活体检测的方法中找到点去改进？需要在活体检测中提出一种更有用的、更可靠的方法！！！ 知乎上有一个活体检测从用户配合、光照影响、设备及抵挡攻击等建立应用较多的方法对表格，拿出来供参考，也是以后研究方向的一种确认： 所以，从市场角度，从光线对抗欺骗技术性能的影响看，三维深度信息、脸部运动估计、傅里叶频谱分析受光线影响较大。 所以，鲁棒性好的人脸活体检测技术需要以下条件，在接下来的研究中需要注意： 在线实时处理； 受光照、光线等外界影响小； 用户界面自然，交互少； 欺骗代价尽可能搞(不能简单的使用照片等攻击识别，哪怕是用模型也要用昂贵真实度高的来破解)； 对欺骗有着优异的检测能力，同时对人脸识别特征提取起辅助作用； 在用户配合上尽可能容易；在设备上尽可能简单。 论文主要内容： 阐述人脸活体问题的研究扩家，较全面的综述人脸识别活体检测技术现状； 研究眨眼活体生理行为，提出基于眨眼的活体检测； 研究火腿的环境特征，提出基于场景上下文的活体检测方法； 活体红外特性，提出红外线与可见光关联的活体检测方法。 活体特征可从生物学、物理学、化学、心理学等方面定义，目前主要是通过物理学及生物学的方式进行判定，物理学方法通过热辐射成像，生理学通过眨眼，(emmmmm，还有通过呼吸检测是否为活体，哈哈哈哈哈哈哈)；然后根据心理学的情况的确是比较难以量化吧！！许多需要使用哪个人工智能、计算机视觉交互、人机交互、图像分析等技术自动识别，如眨眼检测等等 活体人脸的生物学特征1、新陈代谢 (呼吸、PH值等，不好检测？用机器得提取相应的特征，暂时无思路)2、人脸的内环境稳态3、人脸的应激性活体的化学成分检测 活体人脸的热辐射物理特性人力心理过程有其外部表现形式。包括面部、身体和语言的表达。面部主要以肌肉活动为主；言语以声调、节奏、速度、转折、口误等表现。 活体检测中的生理来源一般来源于三个方面： 从生物特征中提取 从生物特征信息的后处理提取 从额外设备中获取 其中，指纹、虹膜、人脸技术已经处于比较成熟的阶段，已经逐渐投入应用之中。从人脸特征中提取数据进行活体检测的方法，也已经有很多种，大致分为以下六类：…… 其中，以人脸特征为活体检测技术主要受到以下几种类型的攻击： 人脸活体检测方法多样，但在实际应用中，需要满足易用、易采集、抗欺骗性能力好等特征，具体来说，有以下几个方面：1、易用：在设计活体检测方法时，要考虑用户在认证是能够方便使用，交互简单，而且交互效果要好，在BioID多模系统中，通过人脸、语音、嘴唇认证，该系统要求在摄像头前说出自己的名字；某公司(我司)使用的活体检测设备，(疑似为静默活体检测)只有在设备前站几秒，即可获取人脸检测结果。2、易采集：活体检测时，采集数据要能简单便捷的采集，较少的受环境如光线、人脸着妆程度等的影响。3、抗欺骗性：不易被照片、视频及模型等攻击措施攻破。4、普遍性：活体检测需在一次录入情况下，检测到多种不同状况下的活体。如需考虑到戴眼镜、化妆等因素。 人脸识别活体检测技术现状(2010年)1、眨眼检测方法[91]邓刚等人提出眨眼检测活体，该方法将眼睛状态分为睁开和闭住连个状态，通过一个睁开和闭住眼睛的二类SVM分类器判断，训练样本是睁眼和闭住的眼睛。如果分类器输出结果为闭住的眼睛，那么系统为活体。 2、热红成像人脸识别，10年时还处于实验阶段，于可见光不同，热红成像反应了人脸辐射的情况，但是这会受到室内温度变化、酒精、玻璃的影响。热红成像仪的价格也很昂贵。 3、人机交互方法，人机交互的方法通过要求活体人脸做出某些实时响应来判断活体，如头部姿态、读数字。 [46]R.W.Frischol和A.Werner的交互检测方法，通过估计用户头部姿势，如向某个方向点头是否一致来判断活体，用以抵抗照片和视频重放攻击。 [47]K.Kollreider等人要求用户读0~9之间的数字，通过唇部的运动来识别读出数字和提示的数字是否一致来判断活体。 思路：将唇部分6个区域，每个区域对应一个投影方向，将速度投影值在图3.7中右图所示的四个部分用模糊C-means聚类，得到20个中心店和对应面积，用聚类描述，然后识别是否为数字4、三维深度分析，用SfM(Sructure from Motion)模型估计出人脸中若干特征点在三维坐标系中的深度坐标。 [49]T.Choudhary等人将眼睛、鼻子和嘴巴作为特征点，从头部运动中估计这些特征点的三维深度坐标。照片是平面的，所以其特征点三维深度坐标接近，活体人脸特征点三维深度坐标各不相同。所以使用扩展卡尔曼滤波器(EKF，Extended Kalman filter)模型跌倒估计三维坐标深度。5、脸部运动的光流估计，用光流分析了活动人脸不同部分的运动情况。 [65]对3D人脸，鼻子产生2D运动相对于人脸外部区域(如耳朵)要大一点，，对于照片来说，脸部不同区域运动大小相同。6、多模生物认证系统，是采用多种生物特征(如人脸、语音、指纹】唇动、手型)同时进行身份识别。 [78][79][80][83]贝叶斯决策 [71][82]加权求和 [81]多层感知器 [77]HyperBF网络 [82]决策树 [82]线性判决 [84]G.Chetty和M.Wagner提出以唇部运动和语音结合的方法，建立BMF模型，语音用MFCC描述，唇部视觉信息用特征唇表示，与MFCC特征 组成一个语音-视觉融合的特征向量，然后用高斯混合模型GMM训练识别活体。(MDZZ，方法讲的很清楚，一个都捕获，哭瞎状) [87]在BMF模型基础啊上建立CMF模型和3MF进行活体检测。。将其进行完善7、傅里叶频谱分析，照片是平面的，所以照片的高频分量应该小于活体人脸成像，其次如果照片放置在相机前，因为脸部缺少表情变化，所以频率分量的标准差应该很小，图3.5表示活体检测人脸和普通照片再频域上的差异比较。 活体检测技术性能评估度量攻击方法的安全性和活体检测的性能，需要合适的方法，常见的性能度量指标有错误拒绝率(False reject rate,FRR)、错误接受率(False accept rate,FAR)、等错误率(Error equal rate,EER)、获取错误率和平均处理时间等。 活体检测方法(L)的这些指标： L错误拒绝率(LFRR) L错误接受率(LFAR) L获取错误率(Failure to acquire) L平均处理时间(Mean transaction time)活体检测系统(S)评估的总指标 S错误拒绝率(SFRR) S错误接收率(SFAR) S错误获取率(Failure to acquire) S平均处理时间(Mean transaction time) 细节将活体检测眨眼行为建模分析邓刚 等人 训练鼻炎和开眼的SVM分类器，通过SVM分类器检测鼻炎来检测眨眼行为，在低分辨率和一般光条件下也可以有效实现。 基于条件随机场的眨眼检测模型活体人脸的场景上下文线索分析活体人脸的红外特性检测恩，本篇论文详细讲述了这些内容，在本次中部详细深入展开(P:对稍微专业的名次略带恐慌，数学公式繁杂……)，现在先从方法中找还有什么其它方法，看的差不多了再进行逐个方法的去仔细了解。","categories":[],"tags":[{"name":"活体检测资料--源自10年博士论文","slug":"活体检测资料-源自10年博士论文","permalink":"http://gorgegao.club/tags/活体检测资料-源自10年博士论文/"}]},{"title":"活体检测资料补充","slug":"隐藏，待整理/20171010 活体检测2","date":"2017-10-10T12:05:54.000Z","updated":"2017-10-16T00:28:56.829Z","comments":true,"path":"2017/10/10/隐藏，待整理/20171010 活体检测2/","link":"","permalink":"http://gorgegao.club/2017/10/10/隐藏，待整理/20171010 活体检测2/","excerpt":"中午休息，刷波知乎，在知乎中看到一些有关活体检测的知识，以17年315打假中破解人脸识别技术为引子讲述出来的，两篇，讲的浅显易懂，遂记之。来源有二，皆出自知乎，其一浅显易懂介绍人脸识别，从表层介绍活体检测方法及应对措施，并未深及理论；其二人脸识别活体检测，初步观摩下，理论太深，看不懂，得等以后再仔细观摩。","text":"中午休息，刷波知乎，在知乎中看到一些有关活体检测的知识，以17年315打假中破解人脸识别技术为引子讲述出来的，两篇，讲的浅显易懂，遂记之。来源有二，皆出自知乎，其一浅显易懂介绍人脸识别，从表层介绍活体检测方法及应对措施，并未深及理论；其二人脸识别活体检测，初步观摩下，理论太深，看不懂，得等以后再仔细观摩。 1、人脸活体检测技术简介来源 https://zhuanlan.zhihu.com/p/26112838 首发于机器之眼 感谢风雨兼程的总结事件缘由：17年315晚会，人脸识别被曝存在隐患，主持人现场凭借两部手机及一个换脸APP,”攻破”人脸识别系统。 人脸识别已经已经广泛在机场安检、上班考勤、银行开户、网上支付等场合应用，人脸识别在对人脸的识别上，准确率已经高达90%以上。但是安全问题也随之而来，如那照片伪造人脸，拿视频伪造人脸运动信息及拿模型伪造人脸模型等。其中，在人脸识别身份认证系统中存在的一项关键技术————活体检测技术。 活体检测的功能就是辨别其是否为“真实的人脸”，识别假脸，防止他人因盗用他人照片等方式攻击人脸识别系统。 人脸识别常见的攻击手段：照片攻击、视频攻击、模型攻击。一些应对措施 照片攻击的应对措施：下达指令，做相应的动作，即初步的交互式动作活体检测。 照片掏空、真人背后做动作的应对措施：使用算法解决，如基于纹理法，基于运动一致性等解决； 视频回放攻击：PC、屏幕播放有摩尔纹，不清晰，用pad或者高清屏幕时，也会存在反光、倒影、失真的现状，可以使用算法完善； 立体面具攻击：低成本塑料、纸张等可以直接使用纹理特征区别，加入纹理区别算法，高仿真如硅胶、乳胶等材料使用机器学习算法完善，也可以根据红外感应方式来甄别； 其它甄别方式： 静默活体：正对摄像头几秒即可，通过检测眼皮和眼球的律动、眨眼、嘴唇及其周边面颊的伸缩等进行甄别； 红外活体：真实人脸和纸片、屏幕、立体面具等攻击媒介的反射特性都是不同的，所以成像也不同，而这种差异在红外波反射方面会更加明显。 人脸识别中的活体检测来源 https://zhuanlan.zhihu.com/p/25401788 首发于 人面桃花 知乎 岑雨发前言：人脸识别技术迈向更高层次的一大障碍：活体检测 该文章从学术论文方面、专利发明方面及企业研发三方面进行调查研究人脸识别的活性检测技术，本文着重看学术论文方面的研究 人脸活体检测的学术研究机构主要有中科院自动化所李子青团队、瑞士IDAIP研究室高级研究员Sebastien Marcel主导的Biometrics group、英国南安普顿大学机器视觉系教授Mark S. Nixon所属的视觉学习与控制研究组和国际生物特征识别著名专家Anil K. Jain所在的密歇根州立大学生物特征识别研究组。 emmmm,接下来主要从学术方向、专利方向及企业应用三个方面讲解活体检测的应用和现状，等待探索中……文章内容比较深入，需要再将理论基础打深一点之后才能明白，现在表完全看不懂其概述中说的种种方法. so，今天先到这里，明天继续从中文论文出发，逐渐抽离活体检测的一些国内外研究现状及综述的点出来，然后在从其中找一些自己想做方向的点。emmmmmm，然后进行开题呗。 P:目前，准备从活体检测的静默检测入手，不知道有没有相关的点及文章&amp;&amp;记得找找哦关于那个团队的知识，看看有没有适合的。。。 [12] 李冀，石燕，谭晓阳.一种应用于人脸识别的活体检测方法及系统:中国,101999900.2013-04-17.","categories":[],"tags":[{"name":"活体检测资料--源自知乎","slug":"活体检测资料-源自知乎","permalink":"http://gorgegao.club/tags/活体检测资料-源自知乎/"}]},{"title":"活体检测论文","slug":"隐藏，待整理/20171010-活体检测","date":"2017-10-10T01:05:54.000Z","updated":"2017-10-16T00:29:41.840Z","comments":true,"path":"2017/10/10/隐藏，待整理/20171010-活体检测/","link":"","permalink":"http://gorgegao.club/2017/10/10/隐藏，待整理/20171010-活体检测/","excerpt":"复习：上一章初识活体检测方法，方法有三，纹理检测、基于运动一致性检测、基于人脸三维结构检验； 纹理方法(1)基于图像中的颜色，根据图像阴影、图像模糊、图像高光三部分进行活体检测比对，先对对象进行成像模型(根据光线等原因)，在图像基础上进行二次采集，二次采集获得人脸颜色、高光等等参数，比对其中存在的图像阴影、图像模糊及图像高光识别活体；(2)另一种是基于费舍尔方法(个人感觉是机器学习的方向)，将人脸分成不同区块，对不同区块特征进行提取，分析，集合费舍尔比值获得描述子(个人理解为描述脸部特征的向量)，对其进行向量化，人后再向量池化，最后通过将向量池中配费舍尔系数进行特征提取，最后获得人脸的特征向量，进行活体检测； 人脸三维结构即通过两次相位角的差异，，选取关键点、关键帧，恢复初始人脸结构，然后对人脸结构进行配准，如果是真人脸时，恢复出正常人脸，但是如果是照片时，犹豫在角度上差异等无法直接恢复，视频的话，也由于扁平的图像导致恢复的结构有问题； 基于运动一致性的活体检测方法，及将人体分为11个区域，根据区域划分为区域，提取其光流(某时刻该像素点的位置变化速率)及光流域，然后计算其光流模值和变化角度，最终提取出序列频率、光流模值直方图、序列相关性 三个参数，比较其前景、背景变化程度；脸部变形程度、运动背景变形程度等参数。 今天读 盘海玲. 人脸识别系统中活体检测技术[J]. 科技资讯，先大致重新了解下人脸识别中的活体检测技术，希望对活体检测技术有新一步的了解，然后再继续进行研读，在研读之后，近两三天研读人脸识别，做一份简单的计划，做好计划之后，开始按计划进行继续解读人脸识别技术。 本章博客首先解读来自2015年的一篇期刊，论文影响不是很高，但略有小记，仅供个人参考理解。","text":"复习：上一章初识活体检测方法，方法有三，纹理检测、基于运动一致性检测、基于人脸三维结构检验； 纹理方法(1)基于图像中的颜色，根据图像阴影、图像模糊、图像高光三部分进行活体检测比对，先对对象进行成像模型(根据光线等原因)，在图像基础上进行二次采集，二次采集获得人脸颜色、高光等等参数，比对其中存在的图像阴影、图像模糊及图像高光识别活体；(2)另一种是基于费舍尔方法(个人感觉是机器学习的方向)，将人脸分成不同区块，对不同区块特征进行提取，分析，集合费舍尔比值获得描述子(个人理解为描述脸部特征的向量)，对其进行向量化，人后再向量池化，最后通过将向量池中配费舍尔系数进行特征提取，最后获得人脸的特征向量，进行活体检测； 人脸三维结构即通过两次相位角的差异，，选取关键点、关键帧，恢复初始人脸结构，然后对人脸结构进行配准，如果是真人脸时，恢复出正常人脸，但是如果是照片时，犹豫在角度上差异等无法直接恢复，视频的话，也由于扁平的图像导致恢复的结构有问题； 基于运动一致性的活体检测方法，及将人体分为11个区域，根据区域划分为区域，提取其光流(某时刻该像素点的位置变化速率)及光流域，然后计算其光流模值和变化角度，最终提取出序列频率、光流模值直方图、序列相关性 三个参数，比较其前景、背景变化程度；脸部变形程度、运动背景变形程度等参数。 今天读 盘海玲. 人脸识别系统中活体检测技术[J]. 科技资讯，先大致重新了解下人脸识别中的活体检测技术，希望对活体检测技术有新一步的了解，然后再继续进行研读，在研读之后，近两三天研读人脸识别，做一份简单的计划，做好计划之后，开始按计划进行继续解读人脸识别技术。 本章博客首先解读来自2015年的一篇期刊，论文影响不是很高，但略有小记，仅供个人参考理解。 来源 盘海玲. 人脸识别系统中活体检测技术[J]. 科技资讯 摘要 人脸识别技术是生物识别技术领域内的一个分支，是目前最受关注的一项生物技术之一，人脸识别技术已经有具体应用，但是在处理人脸识别的三大攻击方式：照片、视频、人脸模型方式进行攻击人脸识别系统时，对其攻击处理，不同系统有其特有的应对措施，本篇论文总结三个方向人脸的细微运动、3D人脸重建、红外人体检测 三方面领域原理分析。 细节介绍1、人脸细微动作：适用于照片及模型攻击的应对。原理：照片和模型无法和真脸一般做出一些细微动作线索，可以根据判断是否做出眨眼、张嘴、甚至是说出固定数字等方法判断其是否为真脸。 方法： 采用人脸经典算法(霍夫变换法、变形模板法、边缘特征分析法、对称变换法等)进行特征值提取和判断； 从较大的特征集中选取少量的关键特征，产生高效的强分类器； 用瀑布算法将多个强分类器合成复杂分类器，快速去除背景、选择关键部位 (论文中无，不过接下来应该是用得到的特征值进行比对，看是否符合微变形的特征吧) 2、3D人脸重建：适用于图片、视频攻击。原理：将人脸看作一个坐标系下由若干个点(几百个)组成的形状，根据方法提取其中获取的点，对其进行人脸重新构建，视频或照片由于提取方法的原因，可能会导致无法识别，之后验证其活体性？(自我理解) 方法： 人脸标准化到一个统一的标准方向和位置，人脸由其中数百个点组成； 均匀采样顶点，使用球面谐波函数算法，对形状和纹理进行区分处理； 人脸的姿态只和其中关键点的特征位置相关，稀疏统计模型建立； n个顶点获取3D形状，按照给定的2D图像点上的坐标恢复3D形状顶点，得到人脸精细的3D图像； 结合人的纹理图像、姿态的校正获取精确人脸模型。 3、红外活体检测：适合照片、视频及模型原理：图片、视频、模型表面无温度，根据人体温度产生的红外感应会被皮肤发散，从而使皮下血液系统呈现独特的面部信号，获取面部热像图。 方法：产生同温线而形成的特征提取实现识别 每张脸包含数百个或者更多封闭的同温线； 提取同温特征，用包含该特征的区域的标准模板进行提取； 用几何分析方法分析同温线形状； 分析的结果产生的值就用于人脸活体检测。","categories":[],"tags":[{"name":"活体检测论文二","slug":"活体检测论文二","permalink":"http://gorgegao.club/tags/活体检测论文二/"}]},{"title":"活体检测论文","slug":"隐藏，待整理/20171009 -活体检测1","date":"2017-09-21T01:05:54.000Z","updated":"2017-10-16T00:28:44.497Z","comments":true,"path":"2017/09/21/隐藏，待整理/20171009 -活体检测1/","link":"","permalink":"http://gorgegao.club/2017/09/21/隐藏，待整理/20171009 -活体检测1/","excerpt":"18日，与金老师讨论人脸识别问题，讨论深入点，在尾随问题中的人数识别需要结合人体型识别问题，进行深入的研究，而下一步需要做的就是把设计到在环境中统计人数的论文或者是识别人形的论文全部拿出来研究一番，在看完论文基础上继续进行图像识别，人数检测方面的研究。(此方面设计主要为图像识别方向) 同时，金老师又一次提到人脸识别中的活体检测问题，何为金老师说的活体检测，即在人脸识别中，需要通过眨眨眼、张张嘴等问题证明是个活人，从而避免是照片等产生的攻击。","text":"18日，与金老师讨论人脸识别问题，讨论深入点，在尾随问题中的人数识别需要结合人体型识别问题，进行深入的研究，而下一步需要做的就是把设计到在环境中统计人数的论文或者是识别人形的论文全部拿出来研究一番，在看完论文基础上继续进行图像识别，人数检测方面的研究。(此方面设计主要为图像识别方向) 同时，金老师又一次提到人脸识别中的活体检测问题，何为金老师说的活体检测，即在人脸识别中，需要通过眨眨眼、张张嘴等问题证明是个活人，从而避免是照片等产生的攻击。 人脸识别及活体检测概述人脸识别是一种基于人的脸部特征信息进行身份认证的生物特征识别技术。它集成了人工智能、机器识别、机器学习、模型理论、视频图像处理等多种专业技术。人脸识别用摄像头采集含有人脸的图像或视频流，并自动在图像中检测人脸，进而对检测到的人脸进行脸部识别。人脸识别主要分四步完成：人脸图像采集及检测、人脸图像预处理、人脸图像特征提取、匹配与识别。由于人脸比指纹等视觉辨识度更高，所以“刷脸”的应用前景更广阔。人脸识别具有自然性和非接触性，可以快捷、精准、卫生地进行身份认定，避免个人信息泄露，并能隐蔽使用。人脸识别能够应对复杂的光照并支持多种人脸姿态，可以精确眉毛、眼睛、鼻子、嘴巴、脸部轮廓等面部关键区域位置，制成独一无二的“面具”，以便通过已存“面具”和待识“面具”的快速比对，实现准确识别。 人脸识别也具有不可复制性，能从几百项脸部特征中找出识别对象。人脸识别技术已在智能门禁、门锁、考勤、电脑登录远程认证、人脸支付、特殊人物识别等方面有广泛应用。对此，首先进行百度“人脸活体检测”进行查询。 人脸识别中活体检测是眨眼判别、嘴部张合判别、视差分析方法等区分照片与真实人脸，活体检测技术在于辨别人脸的真伪，保证人脸识别系统稳定并安全的运行。 文章内容来源：杨健伟. 面向人脸识别的人脸活体检测方法研究[D].北京邮电大学,2014. 研究内容：研究如何利用视频图像数据进行有效的活体检测，首先了解伪造人脸的类型及其特点。(真实的人脸是通过摄像头拍摄真人得到，伪造的人脸需要至少假人脸的制作和二次采集)。因此，区分真人和伪造脸的挂架在于找到这两步对采集到的人脸产生了那些影响。主要区别在于以下几个方面： 图像纹理不同：伪造的人脸图像必须经过二次采集甚至多次采集，图像的纹理信息会因为多种因素发生违反常理的变化。变化来源于图像阴影、图像模糊、图像高光 三维结构不同：纸质打印中照片无论如何折叠。都无法模拟出正式的人脸形状。正式人脸和纸质人脸的图像的三维结构便可有效进行活体检测。 运动模式不同：人脸运动模式(各种表情和动作)、人脸和背景之间的相对运动模式。 针对不同的攻击方法，响应的关键技术有差异： 图像纹理： 图像阴影变化 图像模糊 图像高光基于图像纹理的活体检测方法成功与否依赖于两个关键技术：(1)局部差异定位 (2)纹理特征描述。关键点在于找到表达真假人脸在纹理上的差异的描述子 人脸三维结构：三维结构需要从多张不同视角的人脸图像中回复人脸的三维结构，目前三维重建的方法主要分为稠密重建和稀疏重建。对于活体检测应用，使用稀疏重建得到的人脸结构信息足够区分真假人脸，需要的关键技术为(1)人脸的关键定位：需要适应人脸的角度变化，遮挡及表情等因素(2)参数估计：包括摄像机的内参估计及两张人脸图像的变换参数估计，在得打摄像机的内参之后便可以根据两张不同的视角下人脸关键点的位置信息估计出人脸结构变换系数。补充：目前人脸关键定位方法包括主动弯管模型(AAM)、主动形状模型(ASM)、约束局部模型(CLM)等方法，CLM方法效果好，用于检测应用场景。 运动模式：人脸各部位进行精准的定位，然后使用光流法对前背景区域进行运动模式估计，包括运动方向及运动幅值等。 第二章 活体检测回顾分析总结现有方法(2010年前) 人脸活体检测所棉铃的挑战和难点；中昂点分析基于人机交互的方法、基于多光谱的活体检测方法、基于图像纹理分析的方法及基于多线索融合的活体检测方法；介绍现有活体检测数据库。 第三章 基于部件相关描述子的活体检测方法基于部件相关相关描述子的活体检测方法，该方法基于人脸边缘轮廓及不同区域的活体检测判别。首先扩大传统的人脸区域，从其中提取纹理特征，如局部二元模式(LBP)，方向梯度直方图(HOG)，局部相位量化(LPQ)等。在对纹理特征进行编码之后根据费舍尔准则对这些编码结果进行加权池化，从而的到用来表征人脸的特征。该特征与支持向量机结合，得到较好的活体检测方法。 第四章 基于人脸系数三维结构的活体检测方法纹理活体检测方法的弊端基础上，对其补充，对数据的要求不同，采集视频中人脸的方位角的变化幅度，获取精确的人脸三维结构。此方法可以得到精准的人脸三维结构，使用CLM对人脸的68个关键点进行定位，随后使用三角化算法根据两张不同的视角的人脸的三维结构，并用随后的视频帧对该结构进行精细化处理。该方法可以解决基于纹理的方法不能解决的跨设备问题，可以100%确定是否为活体。 第五章 介绍基于运动一致性的活体检测方法在真假人脸都具有很高的质量，同时采集的视频中的人脸方向角变化很微弱，以上方法很实用性较差。基于图像区域运动一致性的活体检测方法，比对人脸前运动模式与背景区域运动模式的不同，有效区分真假人脸视频。 第二章研究一种特定人体活体检测方法训练一个活体检测器识别所有注册人员的真假人脸。这样通用模型很难处理不同注册人员真人脸图像和假人脸图像的类内差异。本章为每一个注册用户专门训练一个活体检测器，消除通用模型中不同人员之间的干扰。 人脸识别遇到挑战有：人脸获取过程简便、人脸伪造方式多样(图像伪造、屏幕图像显示、面具三维模型等)，一般模式的识别方法都依赖于训练样本，并且要求训练样本和测试样本在特征空间中的分布趋于一致。 人脸活体检测方法：(1)基于纹理的方法 同一设备采集伪造人脸和用该设备采集的真人脸相比存在细节丢失或差异。细节上的差异引起图像微纹理上的差异。(以照片为例，在打印时会出现失真；在照相时，也会出现纹理的差异) [4] 使用傅里叶频谱分析的方法来判定人脸图像的真伪思路：人脸照片是平面而且小于真人的人脸尺寸没照片的高频分量必定比真人脸图像的高频分量要少；打印的人脸照片再时间上不存在局部运动，因此频域上的变化在时域上很小。使用二维傅里叶变化将图像转换成到频域并完成人脸真伪的辨别。 [5] 微操的人脸图像中的高频分量不一定比真实人脸的少，同时该方法并没有考虑图像的空间信息。将频域特征转为空域特征，同时对分类器做改进。该方法假定真人脸和伪造的人脸照片在表面的粗糙和人脸的粗糙度不同；基于Lambertian反射模型提出使用LTV方对输入图像进行平滑，随后从图像中提取DoG特征。为图稿活体检测器泛华能。 改文章创建标准数据库NUAA，采集15个用户超过5万张照片。 Peixoto等人结合DoG滤波器和稀疏罗吉斯特回归模型来应对恶劣的光照条件。 (2)基于运动信息的活体检测方法： [17] 利用眨眼定做来进行活体检测，为眨眼建立了一个条件随机场模型，通过建立一个无向图模型，为不同阶段的眨眼动作进行建模。在随后测试中，使用常规的动态规划算法完成推理。 [18] 利用人脸多个部件的时序运动信息作出帧间人脸的判断。该方法假设真人脸有明显的三位姐欧股，在运动过程中，会在图像平面上呈现出特殊的二维运动模式(这种运动模式一大特点就是人脸的中心区域的运动幅度要比周边区域的运动幅度大很多)，而且需要轻微的抬头动作，该方法首先需要使用部件检测定位中心的周边的人脸区域。随后，使用光流方法估计这些区域的运动模式，进而区分真人连和打印照片的区别。 [19] 使用最不动作完成活体检测，该方法通过分析嘴唇的运动是否和阅读一段文本时应有的运动模式匹配来完成人脸的真伪。(但是这样在眼部和嘴部被挖空，他人模拟动作可能会被攻破，可以根据[20]使用多种运动信息金融多线索融合)， [22][23][24][25] 利用视频信息做活体检测，还可以视频+音频结合做活体检测，但是这种方法需要采集数据较多。 (3) 基于多光谱的活体检测方法 出发点在于真人连的皮肤和伪造脸在材质上存在差异。，这种差异在成像系统中就是反射率的差异。然后在非可见光的多光谱成像技术成为人脸活体检测的一种新思路。基于多光谱成像的方法旨在从可见光波段之外找到更加有效的波段组合，使真脸和伪造脸的人脸在成像系统成像响应上的差异变大，从而达到区分的目的。换壳根据无线电波、微波、红外光、紫外光等进行划分。 [26]非可见光成像技术在文章中，利用近红外成像技术和模糊神经元分类器搭建车辆内人员数量统计系统。 [27] 基于近红外成像的人脸识别方法(最具代表性的红外识别文献)，使用850nm的近红外光、 [32] 多光谱成像技术在生物识别特征领域的应用的启发，685nm、850nm的波段你用于人脸采集，随后两个波段采集到数据投影到一个二维空间，在而无为空间中，真假人脸可以容易的使用线性判别分析(LDA)进行区分。(该方法要求采集目标与采集系统之间距离必须保持不变，而且额头不能被遮挡，实际限制较大。) (4) 基于多特征融合的活体检测方法 尝试融合多种不同的线索，如结合运动信息与纹理信息一起检测 [34] Yan使用不同线索进行融合检测 1)非刚体运动2)人脸-背景一致性3)图像条带效应 [35] 使用运动相关性分析和人脸纹理分析实现活体检测。首先将视频分为若干个N帧，相邻的片段之间公共帧为N-1帧，随后在每个片段上提取运动特征，并在每个片段的最后一帧中提取LBP纹理特征，随后两个线索通过分层数融合得到最终的活体检测结果。 人脸活体检测数据库 数据库中采集的数据能够准确切全面地反映应用环境中的实际情况。公开的实体检测数据库主要有四个：南京航空大学的NUAA数据库、Idiap的PRINT-ATTACK数据库、张洪科院自动化研究所的CASIA-FASD数据库、Idiap的新数据库REPLAY-ATTACK。四个数据库第一个静态图片，后面三个为视频，三四两个提供较好的数据源。 第三章 基于纹理的活体检测方法基于双色反射模型的人脸图像成像分析 假人脸和真人脸样本在图像阴影、图像模糊、图像高光 存在差异。 图像阴影：人脸图像显示在照片、屏幕上，会出现不同寻常的阴影； 图像模糊：传感器存在高斯模糊，夹杂各种噪音，每次进行图像处理，都有一些信息损失； 图像高光：人脸高光区域分布在突出部位如鼻尖、嘴唇、额头等位置，伪造的高光分布可能会违背常理。 成像模型基于双色度反射模型(DRM)，采集到的图像由漫反射和镜面反射两部分组成两部分设置，然后建立模型采集数据脸部识别信息；二次采集将第一次处理的数据进行再次采集，使用高斯卷积等方法图像差异分析使用图像纹理，即对二次采集后的彩色图片转化为灰度图像，使用一系列光学公式进行转化，不是很适用。使用高斯核函数对两张图像进行模糊化，高斯核的σ值越大，图像越清晰 基于费舍尔准则的纹理差异分析 二次采集的图像纹理会收到多方面的影响，使用费舍尔准则来度量真实人脸和伪造人脸在纹理上的差异。 首先将人脸归一化带{142,120}尺寸，然后将图像分为20*20块，没两块之间有{15,15}的重叠区域，每个字块中，提取LBP三种类型LBP特征，将特征屏到一起，然后计算字块中的纹理直方图的差异…… 结论： 对于活体检测来说，具有最优区分能力的区域并不是在常规的人脸内部区域，而是在这些区域之外的人脸边缘区域。 验证正确性： 对比了引入人脸图像的边界区域和不引入时的活体检测性能。验证得活体检测的性能随着人脸区域的增大而逐渐提升(这不是废话？！)。 基于人脸部件相关描述子的活体检测方法 假人脸经过二次采集和真人脸在纹理上有较为明显的差异，同时，不同的人脸区域对应的纹理差异也不相同；人脸的外轮廓区域对活体检测的性能具有正面影响。 一种部件相关的描述子用于提取不同人脸区域的纹理特征，使用完整的人脸区域(Holistic Face,H-Face)用于活体检测。 算法框架 首先使用一个普通的人脸检测器来定位人脸，随后按照扩大到人脸区域1.6倍得到H-Face; 随后，H-Face被分成六个部件，包括人脸区域，左右眼，鼻子和嘴，以及剩下的H-Face区域，称为边界区域； 在此基础上，将人脸区域和边界区域分成2*2的子区域，最终将H-face划分成12个区域； 随后，在每个部件中提取MsLBP特征，并使用训练好的码书对特征进行编写；编码后的码字结合费舍尔比值进行加权得最终的中层描述子； 每个部件的中层描述子通过进一步拼接后，被用于训练和测试活体检测分类器 部件纹理特征编码 使用K-means聚类算法训练码书为例简化训练过程，随机的从所有部件的同意不见C中抽取特征向量，然后将其进行抽取特征向量，随后使用VQ算法训练得到码书CB,在获取到所有部件的码书后，得到相应的码书得到的N个像素点的码字A，随后将其扩展成以个向量。 特征池化 使用平均值法将特征进行池化(考虑不同的人脸区域的费舍尔系数，结合费舍尔系数对编码结果进行加权，得到每个像素点的费舍尔系数)，对系数进行高斯平滑，采样获得和H-face同样尺寸的图像。 在特征池化后，所有人脸部件的直方图被凭借成一个特征向量用来进行活体检测的训练。实验： 选取500个MsLBP特征向量，用从所有训练中样本的相应部件随机抽取的MsLBP特征向量为每个部件训练一个码书。总结：两种方法，一种方法基于图像中的颜色，根据图像阴影、图像模糊、图像高光三部分进行活体检测比对，先对对象进行成像模型(根据光线等原因)，在图像基础上进行二次采集，二次采集获得人脸颜色、高光等等参数，比对其中存在的图像阴影、图像模糊及图像高光识别活体； 一种是基于费舍尔方法(个人感觉是机器学习的方向)，将人脸分成不同区块，对不同区块特征进行提取，分析，集合费舍尔比值获得描述子(个人理解为描述脸部特征的向量)，对其进行向量化，人后再向量池化，最后通过将向量池中配费舍尔系数进行特征提取，最后获得人脸的特征向量，进行活体检测。 基于人脸三维结构的活体检测 基于纹理的活体检测方法在二次采集后纹理变化较为微弱的伪造人脸无法识别基于人脸的三维结构进行活体检测，该方法需要视频中人脸视角有一定的变化即可，对视频质量无要求。 基本框架 假定视频或者图像序列中的人脸加测图像存在不同的视角，在给定图像序列中之后，该方法的流程如下： * 关键点检测，使用鼻子、最、严谨轮廓区域等关键点检测； * 关键帧选取：选取哪些帧用于恢复人脸，选取帧图像关键点的差异需要稍微大些，保证在回复人脸三维结构的置信度较高； * 人脸结构恢复：在获取人脸关键帧图像后，使用款苏的股计算法恢复人脸的三维结构； * 活体检测：在得到人脸的关键点的三维空间位置后，对其进行归一化，随后送至已经训练好的活体检测分类器中对输入的视频进行真假人脸视频的判断。 人脸三维结构估计关键点选择 使用有约束的局部模型(CLM)来定位人脸的关键点，检测到的68个关键点散落在眼睛、鼻子、嘴唇、脸颊等部分，在检测带第一章图像的人脸关键点之后，随后可使用关键点跟踪算法对该68个关键点进行跟踪，获取关键点位置。 关键帧选择 关键帧是指能够被用来恢复人脸三维结构的人脸图像；本文选取视角差别较大的帧用于恢复人脸的三维结构；计算两帧人脸关键点之间的距离判定人脸之间的视角差异，将两关键帧图像之间的人脸视角差异较大的，将其加入到关键帧列表中，否则跳转至下一帧图像。 初始结构恢复 介绍使用两张关键帧进行初始人脸三维结构恢复的方法。当设想投诉满足透视成像模型。在该模型中，使用相对内参或者摄像头内参为给定的人内联特征做恢复矩阵，然后根据恢复矩阵做人脸的相对姿态，最后使用矩阵获得平面的投影。 人脸结构精细化 两张人脸图像既可以恢复人脸结构的三维结构，但是精确度不高，给定Ｍ张关键帧图像和投影矩阵P,在最终精细化的人脸三维结构。 人脸结构配准 配准是将不同尺寸、位置、方位的人脸图像归一化到同一参考系中。人脸三维结构配准过程就是估计当前人脸结构和标准人脸结构之间的刚体变换，在经过刚体变换后，使两个人脸的三维结构差异最小。 实验结果 通过此种方法，从真人脸视频序列，平面人脸照片视频序列和弯曲的人脸照片序列恢复出人脸的三维结构，可以看出恢复出的真人脸三维结构与伪造人脸有明显区别。结论：根据人脸若干关键点的位置，即可恢复出人脸的系数三维结构，利用该三维结构可轻易区分真人脸和照片人脸，从而达到方位的目的。该方法缺陷在于对采集图像有视角要求。 基于运动一致性的活体检测 基于纹理的检测方法无法识别高质量的伪造人脸，基于三维结构无法在保证人脸视觉保持不变的情况下的识别；基于运动一致性即在此基础上，加上人脸区域和背景区域的的运动一致性保证活体检测。 前提结论：伪造的人脸视频要么人脸区域和周边的背景区域是运动一致的，要么是人脸区域和背景区域均没有显著的运动；而真人脸视频的人脸区域和背景区域是相互独立的，一般存在不一致的运动模式。因此，可以通过提取人脸视频的人脸和背景之间的相对运动模式来进行活体检测。 本章使用光流方法俩提取视频中的运动信息，利用运动信息的差异进行活体检测。 稠密光流提取 Gibson在1950年首次提出光流的概念，物体在运动时，它在图像上对应点的良多模式也在运动，这种图像亮度模式的表观运动就是光流。 光流场即在图像中所有像素点构成的一种二维瞬时速度场，其中二维速度矢量是景物中可见点的三维速度矢量在成像表面的投影，所以光流不仅包含被观察物体的运动信息，而且还包含有关景物三维结构的丰富信息。 注：光流相当于脸上某一像素点在某时刻的速度变化，理论上来说，在人脸检测时，活体只有脸部变形，头部在运动时和背景相差较大；但是照片在检测时，脸部变化基本没有，和后面背景的变化也基本为；视频在变化时相同，与后侧背景不相容。 一种基于人体区域和背景区域的运动相关性进行活体检测的方法， 首先提运动一致性特征，即将视频帧分成多个区域，人脸6个肩膀分为左中右三个，背景2个，总共11个区域，每个区域内的光矢量求取均值，然后活体光流值的大小，光流序列的频率以及相关性上，最终提取三个特征： * 序列频率：将所有运动序列进行快速傅里叶变换，随后将对应的傅里叶系数的模值进行归一化并拼接成一个特征向量。序列平率可以区分真人脸视频和采集自固定的照片的假人脸视频及来自照片的攻击。 * 光流模值直方图：统计光流模值直方图，大多数真脸的头部运动缓慢，手持拍摄的假人脸运动幅度大，真人脸在北京区域的运动幅度大，假人脸的运动幅度及北京部位变化小。 * 序列相关性：对存在全局运动的视频序列，在任意两个区域的模值序列或者方向序列均有较大的相关性，想比，真人脸视频中的身体区域和背景区域相关性弱。 附录 最新的方案：人脸活体检测 百度已经有成熟的API可以调用，阿里等也有现成的库函数可以使用 面对防止图片等的干扰，腾讯优图做法 针对以上攻击手段，腾讯优图依托多年的技术积累和实际业务运营经验，对人脸识别技术手段进行过多次安全升级：除了315晚会提到的摇头眨眼简单活体模式，我们还实现了更加复杂的多数字随机唇语、语音图像同步检测、人脸纹理分析、面具检测、视频防翻拍等多维度防护手段，并将所有这些手段进行交叉融合，实现移动端+后台的强力防护体系。 天空中，鸟儿飞过， 月下独怜， 远处，我在等你。","categories":[],"tags":[{"name":"活体检测论文初识","slug":"活体检测论文初识","permalink":"http://gorgegao.club/tags/活体检测论文初识/"}]},{"title":"","slug":"20170801-项目管理的一些心得体会","date":"2017-09-14T12:49:54.865Z","updated":"2017-09-14T12:49:54.865Z","comments":true,"path":"2017/09/14/20170801-项目管理的一些心得体会/","link":"","permalink":"http://gorgegao.club/2017/09/14/20170801-项目管理的一些心得体会/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"防尾随问题基本理论研究","slug":"隐藏，待整理/20170913防尾随问题 ","date":"2017-09-13T00:39:43.000Z","updated":"2017-09-14T12:50:51.550Z","comments":true,"path":"2017/09/13/隐藏，待整理/20170913防尾随问题 /","link":"","permalink":"http://gorgegao.club/2017/09/13/隐藏，待整理/20170913防尾随问题 /","excerpt":"问题：门禁刷卡进入，存在问题，A、B两人，A有正式门禁卡，A可刷卡进入，B无门禁身份；A刷卡进入后，由于门禁未及时关闭，B尾随进入。此时，门禁系统未录入尾随人员信息，存在安全隐患。","text":"问题：门禁刷卡进入，存在问题，A、B两人，A有正式门禁卡，A可刷卡进入，B无门禁身份；A刷卡进入后，由于门禁未及时关闭，B尾随进入。此时，门禁系统未录入尾随人员信息，存在安全隐患。 现有网络解决方案： 加装速通门(类似南京地铁站，翼闸防尾？)，限制时间，每次只能通过一个人，但是无法阻止两个人同时快速进入； 加装三辊闸防(上海地铁，南京火车站)，加装，每次只能一人通过； AB双门验证，A关闭后B门才开启，保证无法由人员被动方式通过门禁，提高安全系数，但是对刷卡方主动同意尾随也无法实现；案例：银行门禁方案案例说明：https://wenku.baidu.com/view/e09a670abb68a98271fefa62.html AB双门验证+体重验证，确认是否只有一个人； AB双门验证+红外感应，检测是否只有一个人体形状； 单门验证+人脸识别+红外识别。 补充：银行门禁示意图： 银行门禁使用流程： 参考文献：[1]王静. 高安全性门禁系统的研究[D].南京林业大学,2013. 文章分析传统门禁和识别方式的优缺点，根据现代化高安全性门禁的发展要去实现了将AB门安全地毯与卡式识别有机结合。通过刷卡、AB门安全地毯与卡式识别有机结合，刷卡认证、AB门认证、体重脚印认证三重综合管理的方案实现防尾随、反潜回、防胁迫功能。现有门禁系统的身份认证方式单一化和各种认证方式存在的不足，本课题致力于一种准确、安全、可靠、合理的高安全性门禁身份认证系统的研究。 门禁：出入口通道管理系统 门禁需提高部分:与门禁相配套的前端信息采集设备、指纹、掌型、面像、虹膜等前端生物识别设备目前仍需加强其实际应用以保证较高的安全性； 门禁系统发展： 传统门禁：门锁–&gt;机械装置-&gt;电子磁卡锁、电子密码锁。 高安全性门禁： 具备传统门禁的查询、监测、统计、考勤、遥控、卡、用户管理、系统维护；而且实现防尾随、反潜回、防胁迫(胁迫报警)等特殊功能。 识别方式：传统的密码门禁机卡式门禁安全性低，现在安全性逐渐使用唯一不可复制的生物识别方式配合使用，生物特征稳定、便捷、不易伪造；新技术一般使用虹膜、指纹、人脸特诊等； 作为整个安防体系的重要部分，门禁系统主要包括身份识别、认证系统和出入门系统。当今市场门禁系统种类繁多，主要有基于射频卡的，但是控制途经单一，而且多数门禁系统只是完成了基本的进出控制功能，却很少见到专门为大型特种门禁控制系统提供管理的高安全性门禁系统。 采用方法：AB双门+RFID内外门识别+地毯检测+重量检测，较为完善的解决尾随问题，但是实际实施状况还有复杂情况堪忧，有待从软件角度考虑？ P：软件方面的话，从人脸识别设备开始出发，人脸识别红外感应感应人体，感应到后进行预测分析，然后自动识别人脸？AB门识别到一个人脸后允许通过，多个人脸后进行警报处理。单门通过 人脸识别门禁+快速单人闸机，人脸识别如何实现 [2]李兴富,徐有明. 防尾随联动安全门状态监测控制系统的设计[J]. 桂林航天工业学院学报,2015,20(04):488-492. [2017-09-14].防尾随联动安全门状态监测控制系统的设计 针对高安全场所使用的防尾随联动安全门存在的误锁、误开、不能及时关闭，需要集中实时监控的情况和需求，设计了一种防尾随联动安全门状态监测控制系统。 硬件设计(未详细考虑)： 控制电路连接状态检测电路、故障检测电路、电源电路、通信电路、按键电路、显示电路。硬件电路不考虑情况下，安装位置类似银行设备，AB双门，AB门在平常状态只有一个门可以开启，正常状态下有警戒(双锁)、双门开、内门开歪门关、内门关外门开四种正常状态；异常状态包括关门超时、双开超时、不开超时、电源异常；报警状态包括紧急报警、电源报警。 软件设计：设计采用模块化 按键处理模块在调试模式下使按键模拟安全门的内开门、外开门、双锁、双开的控制指令，在征程工作状态仅用于控制显示器的亮灭。门状态处理模块实现检测门状态机警报状态的变化，从相应接口读取门状态机警报状态代码，判断后发给电脑判断，然后进行处理。 ，采用对程序执行循环计数方式的软件延时滤波设计方法，既实现了软件延时滤波，又不影响程序的实时性；利用片内ＲＡＭ 作计数器及定时标志，对单片机片内定时器产生的定时基准计数从而实现了多重定时，解决了单片机片内定时器数量有限及纯软件延时影响程序实时性的问题。 基于有限状态机的防尾随设计？有限状态机的转换？状态机的话 加入状态设计状态码 状态码 转台装换状态码的实施 状态移交 状态机转交的专利？ 状态码的切换 解决思路，在原本基础上加红外感应装置或者是加其他可以识别辨别人数的装置，在装置中统计人数，与人脸识别数目相对应；在单人刷脸成功进入情况下，配置单人人数；如多人刷脸成功，同时进入，则计算其中人员数目，如果数目相一致，则正常运行，如在AB门间检测到人员数目大于刷脸成功数目，即为发生尾随事件，进行尾随报警。 如果是单门的话，暂时无法进行配置，双门时难点问题在于如何进行统计人数，红外识别统计人数？视频监控使用算法计算人数等；待明天研究。","categories":[],"tags":[{"name":"门禁系统防尾随问题概述","slug":"门禁系统防尾随问题概述","permalink":"http://gorgegao.club/tags/门禁系统防尾随问题概述/"}]},{"title":"","slug":"RFID学习","date":"2017-09-07T02:11:55.659Z","updated":"2017-09-14T12:51:46.120Z","comments":true,"path":"2017/09/07/RFID学习/","link":"","permalink":"http://gorgegao.club/2017/09/07/RFID学习/","excerpt":"RFID 标签位置感知技术综述作者：邱兰馨, 黄樟钦, 梁笑轩摘要总结：位置信息中利用GPS、手机等其他设备可以进行定位，但室内“最后一米”定位采用RFID更为精确。这篇文章从 参数提取 和 位置估计 方面总结RFID标签位置感知技术关键，还介绍RFID的应用及未来发展方向。作者：yacogo链接：http://www.jianshu.com/p/abaff828100d來源：简书著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。 英文名：Indoor location-aware technology for RFID tag:","text":"RFID 标签位置感知技术综述作者：邱兰馨, 黄樟钦, 梁笑轩摘要总结：位置信息中利用GPS、手机等其他设备可以进行定位，但室内“最后一米”定位采用RFID更为精确。这篇文章从 参数提取 和 位置估计 方面总结RFID标签位置感知技术关键，还介绍RFID的应用及未来发展方向。作者：yacogo链接：http://www.jianshu.com/p/abaff828100d來源：简书著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。 英文名：Indoor location-aware technology for RFID tag: 名次解释： 名次 英文释义 解释 基站 base station RFID阅读器 待测目标 target RFID标签 锚节点 anchor 已知位置的标签 内容： 前提条件：基站位置已知（感应出的结果是基站的相对位置） 措施/方法： 基站在全局坐标系位置已知时，标签位置结果转换至全局坐标系下，现有 RFID 位置感知方法，多利用 RFID 系统通信过程中阅读器所接收到的标签响应情况，或是标签反射链路的信道参数来估计和反演标签所处的空间位置，主要包括参数提取和位置估计 参数提取研究概述早期：多采用标签的响应结果作为参数信息，根据 RFID 系统通信距离的有限性来大致估计标签距离。进阶：随着对定位准确度需求的提升，到达时延（ ToA/TDoA）、到达角度（ AoA）、到达信号强度（ RSS）、到达相位（ PoA/PDoA）等反映标签所处环境信息的信道参数陆续被用于反演标签位置。超阶：对多元参数进行综合分析，或是采用多径谱（ mulitpath profile） 作为参数信息的位置感知方法则显示出了更好的抗干扰能力。 最基本，通过判断标签在或者不在进行判断。实例运用：在博物馆内的自动语音导航，通过判断标签在或者不在进行标签相对位置估计。 通过RFID系统为用户提供的信号接收强度、到达相位等通道信息参数，进行更加深入、精准的研究。 2.1 信号到达时间 Bechteler提出 SAW ID-tags 方法利用信号到达时间（ToA). 计算距离： d=cτ&lt;sub&gt;n&lt;/sub&gt; 注：c为光速; τ标签发射信号的时间与该信号到达阅读器的时间差。 Stezer采用标签信号到达多个阅读器之间的相对时间差，分别求出标签到阅读器的相对距离，再根据阅读器之间已知的位置关系求解绝对距离。 评论：此种方法要求时间测量到达纳秒级，而且要实现时钟同步，实际情况中很难实现 2.2 信号接收强度 根据 Friis 电磁波自由空间传播模型，接收信号强度与标签-阅读器之间的距离 d 的四次方呈反比. 根据统计的对数距离路径损耗模型有: P(bB)=P0(dB)+10nlg(d/d0)+Xσ(dB) 评论：基于接收信号强度的位置感知方法是目前最为普遍的 位置估计研究概述由参数信息反演标签位置这一处理过程和相应的处理方法，可以大致归纳为几何估计法、指纹估计法、成本函数最小化和贝叶斯估计法四类。总体思路都是在空间内布置多个读卡器，根据读卡器强度参数确定位置。 几何估计法：计法借助阅读器和标签间的距离或角度关系求解非线性方程组来计算目标位置。 借鉴无线局域网定位原理为 RFID 位置感知提供了研究思路。 成本函数最小化估计法全息图谱方法、为代表。 代价函数最小化，将空间分成W*L个像素点并以Xsub(w,j)代表（w,l)处的位置 贝叶斯估计法:在移动轨迹跟踪中有较为广泛的应用 指纹估计发：建立指纹库，先根据测试数据、信号强度数据建立信号强度、信号强度值的概率分布状况，之后将待测标签的参数信息与待测标签与指纹库的信息进行匹配，在通过选中的参考标签对已知位置估计。 （匹配算法可根据机器学习只能怪的KNN、最大期望估计、支持向量机估计等） 其它相关技术除参数信息提取准确度、位置估计方法的有效性外，RFID位置感应技术还收到技术本省的影响和制约，如防碰撞协议，远距离通信技术和标签技术。 ####### 链路及防碰撞协议RFID是无线通信技术，由阅读器经过天线发送符合协议的电磁波唤醒标签，标签返回数据信息给阅读器。 标签天线的辐射方向往往在某个方向强，其它方向弱；但是一般理论上，都认为读卡器天线是全向的信号强度相同。 多个阅读器同时发送时信号碰撞问题导致信息采样缺失并给环境带来额外的射频干扰。 多个标签在同一时隙向阅读器发送信息，标签间也会产生冲突； 大规模环境下标签防碰撞方法对位置感知效率和精度也有重要影响。 ####### 远距离通信技术 通信距离较近是制约RFID位置感知技术的重要原因（无源的）采用高频10~11.1GHZ作为通信测试平台，影响较小。 ####### 标签技术 有源、无源、半有源标签等。 WISP标签是一种可编程的半有源标签，利用接受到的阅读器信号为自身集成的光学或声学传感器提供所需能量，从而利用可见光或超声波作为辅助信息进行读卡器感知，实现读卡器的感应。 RFID应用前景通过 RFID 位置感知技术获得贴标物体或人员的位置信息能够应用在许多实际场合中，大致可分为基于位置的自动化控制及服务、目标搜索与监控、活动识别与安全、增强现实及人机交互等。在控制方面， Wang 等[56]利用标签信息判断物体形状使机器人实现自动抓取；在服务方面，文献[5]根据 RFID 的响应范围，为靠近相应标签并持有专用 RFID 阅读器的游客自动提供展品的语音介绍。利用货架商品的位置变化，对消费者的行为进行分析挖掘，从而判断消费者对不同商品的偏好程度；在可视化方面， Malla 等[57]借助标签位置感知构建室内空间地图，并结合增强现实技术描绘和重建室内环境。 总结在具体实施过程中，通常根据应用场景的具体情况，从准确度、精确度、实时性、系统成本等方面来综合选择合适的参数及估计方法。","categories":[],"tags":[]},{"title":"20170731 软件需求与需求工程","slug":"20170731-软件需求与需求工程","date":"2017-07-31T05:06:33.000Z","updated":"2017-08-08T13:42:27.664Z","comments":true,"path":"2017/07/31/20170731-软件需求与需求工程/","link":"","permalink":"http://gorgegao.club/2017/07/31/20170731-软件需求与需求工程/","excerpt":"什么是软件需求 个人认为软件需求就是业务逻辑+实现方法； 在这里，作者认为然间需求是“业务知识+问题列表+其它因素”，具体是什么情况我们下面一一解读，一起分析。 业务知识：业务事件、业务实体和业务规则； 问题列表：在工作中遇到的困难与故障（软件开发时需要解决的东西）； 其它因素：一些设计约束和非功能性的东西。","text":"什么是软件需求 个人认为软件需求就是业务逻辑+实现方法； 在这里，作者认为然间需求是“业务知识+问题列表+其它因素”，具体是什么情况我们下面一一解读，一起分析。 业务知识：业务事件、业务实体和业务规则； 问题列表：在工作中遇到的困难与故障（软件开发时需要解决的东西）； 其它因素：一些设计约束和非功能性的东西。","categories":[],"tags":[]},{"title":"20170727  不同项目需求视图","slug":"20170727-不同项目需求视图","date":"2017-07-27T01:37:44.000Z","updated":"2017-07-31T05:15:12.104Z","comments":true,"path":"2017/07/27/20170727-不同项目需求视图/","link":"","permalink":"http://gorgegao.club/2017/07/27/20170727-不同项目需求视图/","excerpt":"信息系统需求视图 毫无疑问，不同向项目有不同的需求，但是需求之间有什么共通的东西呢。本章分析下需求中存在的一些能够共通的东西，尤其是在信息管理系统中一些需要注意的部分。","text":"信息系统需求视图 毫无疑问，不同向项目有不同的需求，但是需求之间有什么共通的东西呢。本章分析下需求中存在的一些能够共通的东西，尤其是在信息管理系统中一些需要注意的部分。 信息系统的本质—–数据信息化 namely : 将数据抽象汇总，形成明确的需求。 信息系统类别联机事物处理系统（OLTP）、管理信息系统（MIS）、主管信息系统（EIS）、决策支持系统(DSS)、专家系统、办公自动化系统（OA）等。 OLTP：包含数据输入输出的系统； MIS：查询、分析统计报表的系统； EIS：信息的查看管理系统； 1、联机处理系统—流程电子化构成三要素：人、过程、工具 在实际工作中， 人带着工具进行现实工作，但是需要将信息以输入输出的方式按流程录入系统。 eg:入库操作时，人持手持机带物资入库，将入库物资信息录入ERP系统。 流程分析时OLTP系统的关键线索和主要视图 从业务流程出发，而非是从结构划分开始。 从业务角度定软件操作流程，将软件设计思路一业务并发，而非是拿单个模块实现。 P:懂业务的程序员OR会写代码的PM。 个人建议做一个会写代码的PM，重心在PM中，然后各类代码前后端兼容，可以适应各种需求的程序。 2、管理信息系统—数据信息化 管理信息系统就是将OLCP产生的数据进行报表分析、查询，是数据的消费者，这部分消费信息甚至比报表信息更重要。 报表需求分析什么 在报表分析时考虑客户为什需要这么做，而非是客户要这么做就这么做。 报表需求考虑Why、What、How ##待插入图片 报表需求面向不同对象分析不同内容 面向管理人员：从业务视角出发分析 分析出业务事件视角（进度报表、异常报表）业务实体视角（常规报表及需求报表） 进程日志，对关键活动总结；对异常状况报表；对详细数据报表；对业务具体需求报表； Eg:现在我们系统只有日志，可以作为进度报表，但是极其简单； 异常报表，不太容易实现，现在仅仅只有警报一个方面； 详细数据报表，不太完整。 So：We need 研究实际的报表分析一下啊！！！ 面向决策者：按销售时间、产品维度、销售人员维度进行分析，分析整体数据的自然属性。 其它信息系统 决策支持系统（DSS）、专家系统、办公自动化系统 1). 决策支持系统——决策信息化 结构化问题：可以利用计算机流程直接生成报表解决的问题，（仓储报表、危险品预警等数据报表）； 非结构化问题：不能只通过计算机流程解决，需要人工参与(广告投放、等较复杂的场景)； Eg:非结构化问题举例，图2.9： 2). 专家系统——个人知识转化为企业知识 个人在企业的经验知识经过一定的积累，就成为相关方面的“专家”，专家系统即对专业知识进行统计分析，将其可以快速转化为企业知识的系统。 `专家系统主要是将个人经验高效快速转化为企业经验` 3). 办公自动化—–协同信息化 办公自动化系统，将串行的办公流程并行处理，解决问题。 信息系统多维视图信息系统的线索：人、事（过程）、物（数据）、接口 需求分析人员要具有这种能力：将实现的功能抽象成实际可以见到的管理层效果(如提高项目的什么什么效率，可以为公司带来什么什么效益，可以通过什么报表可以直接让领导层看到什么) P：领导层主要看到的是效益层的，主要通过决策、报表、图标让领导层直接看到效益。 还需要具备这种能力：将业务逻辑向开发或其他人员进行转述分析，让其明白功能；或者是直接将业务划分为不同那个模块进行讲述。 嵌入式系统的需求视图面向直接用户的嵌入式系统如银行ATM机、手机等；在树立需求时，采用层次结构梳理。 eg:手机在接听电话时，需要记录别人的手机号码时，原来需要找纸和笔；可以直接打开便签记录，或者语音识别自动记录； 面向特定设备的嵌入式开发有些嵌入式系统不会直接与用户产生交互，而是先通过与内部系统进行交互，然后在外部进行与用户交互； 如GPS模块、监控模块，先通过显示，然后在于外部的模块进行交互。 分析此类时，需按照对外接口及对内接口进行分析。 先分析对内接口，找到此类设备相互关联的外部系统，然后在分析内部功能及描述。 Eg:监控项目中，先分析内部GPS模块需要实现的额功能，对监控物资进行实时的定位，对GPS信号网络信号进行整理描述。外部接口：通过查看物资信息接口与查看物资信息的具体位置等。 总而言之 需求视图是啥玩意呢，要结合具体业务逻辑及用户对象，根据不同业务逻辑及对象设计或者是为其分类制作不同的产品。 对设计产品时的一些感想： 做产品，提供便利：做一个产品，最初级的要求就是先使用人、工具（过程）、物（数据）、接口理清楚所有的业务逻辑，然后将其以开发人员可以快速理解的代码逻辑形式理出来。 P：对现在最近做的管理系统还是其它的系统，都是首先在业务逻辑基础上，将其实现，如实现基本的CUID及日志、监控功能。 做产品，带去利益：然后呢，在其基础上，划分为数据管理，报表，最好还要对报表做分析，将其产生实时可见的数据、形象化的数据为公司提供改进意见，为其带来效益。 做产品，积累经验：然后呢，在基础上，将操作流程化、产生专家经验，使其可以快速让新员工上手，将企业经验迅速转化为个人经验，快速上手。或者是直接进行自动化管理，设计原来这部分员工。 对需求分析的一些感想： 还是那句话，首先从用户角度出发，多问问用户要的是什么东西，他们为什么要这个东西，要这个东西他们有什么用，如何才能在更加符合他们操作习惯的同时进行设计。 对现在的系统时，进行细微设计，如进行报表分析时。看面相的对象是普通使用人员还是高级管理人员，为普通管理人员则提供基本的便利使用，使其用起来更加的舒服既可以。对于高级管理人员呢，则需要做报表等可以直接见效益或总体直接产生影响的报表或者是系统，从这个角度去分析制作。 在分析具体业务逻辑时，分内部接口与外部接口，内部接口开发人员可见，外部接口具体业务 人员可见，对于外部接口一定要慎重考虑，外部接口和事件分析是要点中的要点！！ 需求视图找出需求分析时应该从哪几个角度分析（用户人员、业务逻辑外部接口、产品类型甚至是产品使用与语言及展现平台形式等）","categories":[],"tags":[]},{"title":"20170723 需求实践分析","slug":"20170723-需求实践分析","date":"2017-07-23T13:28:05.000Z","updated":"2017-07-23T14:34:13.766Z","comments":true,"path":"2017/07/23/20170723-需求实践分析/","link":"","permalink":"http://gorgegao.club/2017/07/23/20170723-需求实践分析/","excerpt":"软件需求最佳实践—-需求实践现状分析 软件项目成败的原因及思考~ 失败是因为需求变动、客户未参与、用户期望不切实际&amp;提供不需要的&amp;不完整的需求…那么原因呢，改进呢？","text":"软件需求最佳实践—-需求实践现状分析 软件项目成败的原因及思考~ 失败是因为需求变动、客户未参与、用户期望不切实际&amp;提供不需要的&amp;不完整的需求…那么原因呢，改进呢？ 软件项目失败带来的思考一副形象漫画 原因 沟通失真（用户–&gt;需求人员–&gt;设计人员–&gt;开发人员对需求理解逐层递减，最终减到8%左右）问题所在：交流存在失真解决方案：文档、重复（Review) 客户需求放大（用户要么说不，要么添油加醋） 问题所在：客户也不知道他要什么，希望以较小的成本获利，且对技术不了解，当了解当更好的方法时，会随时添加新需求。 解决方案：少向客户问他要什么，多问为什么他需要，真正动机是什么。 项目经理的需求控制 问题所在：中国实际中项目经理负责多个职位，在沟通中由于各种原因对需求进行误解。 解决方法：多问Why,为什么他们需要解决这种，为什么要做，从用户角度出发。 分析人员的技术加工 问题所在：需求分析，系统分析在技术层次，如在技术框架选型、技术能力中加东西。（P:选择Scala、选React） 解决方案：本质在于分析业务，对于实现的业务进行分析即可。 编码人员的断章取义 问题所在：理解误差 戒语：业务是需求之魂。 透过表象分析本质方法论与需求工作 需求分析人员对技术方法的评论在于适用性。白猫黑猫 ，抓到老鼠就是好猫~管你C/S，B/S，搞定用户就OK~一个小tip：工作经验不丰富的人，用C/S去吧，对浏览器熟悉点的，在用B/S,请不要问为什么，不太想解释太多什么叫地址栏，什么叫设置兼容模式。。 软件工程方法论现在在敏捷开发和 开发思想","categories":[],"tags":[]},{"title":"测试用例及测试的基本原则","slug":"blog","date":"2017-07-06T01:17:36.000Z","updated":"2017-07-08T09:18:18.675Z","comments":true,"path":"2017/07/06/blog/","link":"","permalink":"http://gorgegao.club/2017/07/06/blog/","excerpt":"软件测试用例编写规范测试用例准备编写根据需求规格说明书和设计说明书，详细理解用户的真正需求，并且对软件所实现的功能已经准确理解，然后着手制订测试用例。","text":"软件测试用例编写规范测试用例准备编写根据需求规格说明书和设计说明书，详细理解用户的真正需求，并且对软件所实现的功能已经准确理解，然后着手制订测试用例。 测试用例指定的原则测试用例要包括欲测试的功能、应输入的数据和预期的输出结果。测试数据应该选用少量、高效的测试数据进行尽可能完备的测试；基本目标是：设计一组发现某个错误或某类错误的测试数据，测试用例应覆盖方面： 正确性测试：测试用例首先要满足所有功能需求； 容错性测试：正常数据，正常显示数据，完成功能，异常数据，异常提示，非法数据，非法操作，警报处理； 完整（安全）性测试：有权限验证，对于无权限用户无法进行操作 ，或者有保障性操作； 接口间测试：各模块间的关联性需要考虑，数据输入、输出修改具有一致性； 数据库测试：依据数据库设计规范对软件系统的数据库结构、数据表及其之间的数据调用关系进行测试。（不太懂） 边界自分析法： 对边界值数据进行特殊注意，进行处理验证； 压力测试：输入多条记录测试； 等价划分：将数据分类，如正常类、异常类，有效类、无效类； 错误推测：根据直觉推测错误； 效率测试：尤其对数据库操作，进行预计时间测试； 可理解性：理解和使用该系统的难以度进行测试； 可移植性：不同操作系统及硬件环境下的运行情况； 回归测试：测试–修改–再测； 比较测试：将已经开发的产品或同类型的产品进行测试。 模块测试、集成测试： 1、2、6、8、9; 单元测试：重点测试5； 组合(集成)测试：重点测试数据输入输出及逻辑，即4; 系统测试： 3、7、10、11、12、14; 其中压力测试和可移植性测试如果是公司的系列产品，可以选用其中有代表性的产品进行一次代表性测试即可。 GMPS基础测试用例设计完成后，其他的测试项目只编写设计与之不同部分的测试用例。 P: 我司暂时处于初步测试阶段，对于测试，暂时只考虑模块、单元及系统测试，即使用正确性、完整性、接口、边界分析、压力、等价、错误推测及回归测试方法进行测试，别的暂时不考虑。 在后期需要完善阶段，对容错性数据要进行测试，进行修改整合；对数据库进行完善，进行数据库测试；对可理解性进行测试，完善功能； 在装机之后，需要考虑可移植性测试； 在上线之后，进行比较测试，完善产品。","categories":[],"tags":[]},{"title":"20170628","slug":"20170628","date":"2017-06-28T13:29:33.000Z","updated":"2017-09-14T13:07:26.978Z","comments":true,"path":"2017/06/28/20170628/","link":"","permalink":"http://gorgegao.club/2017/06/28/20170628/","excerpt":"产品经理基础阶段和产品苏伟互联网思维：","text":"产品经理基础阶段和产品苏伟互联网思维： eg:小米：1、专注2、极致3、口碑4、块 360：1、流量；2、用户至上，流量为王；3、利用互联网卖东西；广告、足够多的广告；增值服务、网游；4、免费是有条件的，足够一桌菜，免费送啤酒。 互联网核心：传统–互联网不可区分1、信息电子化、存储、传输；2、改变传输的效率，如信息交流（QQ..)、娱乐化、信息安全、云计算、大数据；3、信息流、物流的发展；4、物联网。 互联网思维听到第5节，没有实质性的东西 百度指数：一个类似百度搜索的搜索引擎。","categories":[],"tags":[{"name":"一代过去，一代又来，地却永远长存。日头出来，日头落下，急归所出之地。风往南刮，又往北转，不住的旋转，而且返回转行远道。江河都往海里流，海却不满。江河从何处流，仍归何处还。","slug":"一代过去，一代又来，地却永远长存。日头出来，日头落下，急归所出之地。风往南刮，又往北转，不住的旋转，而且返回转行远道。江河都往海里流，海却不满。江河从何处流，仍归何处还。","permalink":"http://gorgegao.club/tags/一代过去，一代又来，地却永远长存。日头出来，日头落下，急归所出之地。风往南刮，又往北转，不住的旋转，而且返回转行远道。江河都往海里流，海却不满。江河从何处流，仍归何处还。/"}]},{"title":"Hexo 博客无法上传的问题","slug":"blog-test","date":"2017-06-17T02:12:47.000Z","updated":"2017-07-06T01:59:48.737Z","comments":true,"path":"2017/06/17/blog-test/","link":"","permalink":"http://gorgegao.club/2017/06/17/blog-test/","excerpt":"github + Hexo 创建博客成功，已经可以在浏览器访问具有Hello Hexo的博客，但是在再次 hexo g，hexo d之后无法访问新创建的博客，新建的博客没有被提交到github中，尝试解决这个问题。","text":"github + Hexo 创建博客成功，已经可以在浏览器访问具有Hello Hexo的博客，但是在再次 hexo g，hexo d之后无法访问新创建的博客，新建的博客没有被提交到github中，尝试解决这个问题。 问题：博客可以在本地预览，但是不能通过 “hexo d”上传到github 报错提示：1234567891011121314151617E:\\junlegaoblog\\blog&gt;hexo s -p 5000E:\\junlegaoblog\\blog&gt;hexo new \"test\"INFO Created: E:\\junlegaoblog\\blog\\source\\_posts\\test-1.mdE:\\junlegaoblog\\blog&gt;hexo s -p 5000INFO Start processingERROR Process failed: _posts/first blog.mdTypeError: Cannot read property 'offset' of null at Object.exports.timezone (E:\\junlegaoblog\\blog\\node_modules\\hexo\\lib\\plugins\\processor\\common.js:44:40) at E:\\junlegaoblog\\blog\\node_modules\\hexo\\lib\\plugins\\processor\\post.js:83:42 at tryCatcher (E:\\junlegaoblog\\blog\\node_modules\\bluebird\\js\\release\\util.js:16:23) at Promise._settlePromiseFromHandler (E:\\junlegaoblog\\blog\\node_modules\\bluebird\\js\\release\\promise.js:509:35) at Promise._settlePromise (E:\\junlegaoblog\\blog\\node_modules\\bluebird\\js\\release\\promise.js:569:18) ....... 原因：因为在配_config.yml时配置错误。错误地方：timezone配置错误1234567# Sitetitle: junlegaosubtitle: \"道可道，非常道。名可名，非常名。\"description: \"无为而为之，为而无为也。\"author: \"樂\"language: zh-CNtimezone: Asia/Nanjing 注意上面的timezone,timezone为时区，博主以为是擅自将原来的 Asia/Shanghai修改为 Asia/Nanjing，导致出现这个问题。 P:问题很弱智，提出来供大家参考。同时，告诫诸位，在修改配置文件的时候，看清楚配置信心再去配置，不要导致博主这样的惨状发生，卡了好几天才发现，呜呜呜…","categories":[],"tags":[]},{"title":"Hexo+github 创建注意事项","slug":"first blog","date":"2017-06-15T13:40:36.000Z","updated":"2017-06-17T05:38:26.719Z","comments":true,"path":"2017/06/15/first blog/","link":"","permalink":"http://gorgegao.club/2017/06/15/first blog/","excerpt":"就想说github+hexo配置博客注意几点。","text":"就想说github+hexo配置博客注意几点。 1、仓库命名与用户名一致！仓库命名与用户名一致！仓库命名与用户名一致！ such as: 我的用户名为 junlegao 仓库名为 junlegao.github.io 2、发布时注意需进行对hexo 进行配置 即：npm install hexo-deployer-git –save 也可用 cnpm install hexo-deployer-git –save(淘宝仓配好后才可) 3、补充下hexo写博客流程。 新建博客 hexo new “New Post” 发布到服务 hexo server / hexo s 静态生成 hexo generate / hexo g 发布 hexo deploy / hexo d","categories":[],"tags":[]}]}