{"meta":{"title":"junlegao","subtitle":"道可道，非常道。名可名，非常名。","description":"无为而为之，为而无为也。","author":"樂","url":"http://gorgegao.club"},"pages":[{"title":"分类","date":"2017-06-15T13:28:48.000Z","updated":"2017-06-15T13:29:47.865Z","comments":true,"path":"categories/index.html","permalink":"http://gorgegao.club/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"","slug":"0404","date":"2018-04-04T00:31:40.966Z","updated":"2018-04-04T01:46:10.480Z","comments":true,"path":"2018/04/04/0404/","link":"","permalink":"http://gorgegao.club/2018/04/04/0404/","excerpt":"","text":"早晨听点新闻 from:36氪 美团全资收购膜拜团以27亿美元的作价全资收购摩拜 携程 获得网约车执照4月3日，携程集团宣布旗下的携程专车正式获得天津市代交通运输部颁发的“网约车牌照”。即日起，携程专车具有了网络预约出租车线上服务能力，可在全国范围通用。 在线旅游行业保险，马蜂窝取消发售保险默认勾选 今日头条全公司的员工总数已接近2万人，其中“销售的规模在1万人以上”。 据36氪消息，福布斯晚间发布2018全球最佳创投人榜单，本次17位中国投资人上榜，为史上最多一次。 苹果已经正式效仿Netflix的商业模式，进入了影视原创领域。近日媒体报道Netflix将收购法国导演吕克贝松旗下的制片公司，媒体也传出了苹果将收购一家好莱坞片商的消息。果进入 进入影视产业","categories":[],"tags":[]},{"title":"一点产听力，提高产品技能","slug":"余军的PM面试题","date":"2018-04-03T12:42:35.000Z","updated":"2018-04-03T12:51:41.900Z","comments":true,"path":"2018/04/03/余军的PM面试题/","link":"","permalink":"http://gorgegao.club/2018/04/03/余军的PM面试题/","excerpt":"早上听点产品~ From:产品方法论-喜马拉雅听 听喜马拉雅听中的一点产品知识，听起来很迷茫，但是其中一点对产品面试题的分析，留下点印象，随记之~","text":"早上听点产品~ From:产品方法论-喜马拉雅听 听喜马拉雅听中的一点产品知识，听起来很迷茫，但是其中一点对产品面试题的分析，留下点印象，随记之~ 余军的PM面试题：同理心环视天赋技能，如何提高产品能力。 如何在日常生活中，提高上你的产品技能~ 下载小而美的APP来源：APP store: 精品APP、从最美应用、next平台咨询 分析产品功能 大牛： 揣摩目标应用的用户群 可能是什么样的人 核心竞争力 主要功能的用户场景分别是什么 from this:作为一名普通用户进行使用APP，带着接下来几个问题： 这个APP怎么吸引你，为什么下载，是什么，对这个APP的感受，第一印象。 初次体验，有引导么，APP的整体感觉如何，是否感觉到智能高效呢？花费了多少时间呢，给你留下什么印象？ 再次使用，多久用一次，这款与其他APP相比如何，预测它会火么？ 注重把握身边的人 用眼睛去看 在每次应用更新后，去电子应用市场，关注用户评论，是否和自己的想法相同，身边的人如何使用APP，用户习惯如何？ 用耳朵聆听 对每次应用的APP，和周围人讨论它怎么样？ 定义周边的 用一句话给一个从未使用过电脑的人描述鼠标？ 听到：鼠标是人在电脑这个虚拟世界的手，通过它可以与这个世界交互。 From me：鼠标相当于电视上的遥控器，遥控器相当于电脑，可以操纵电视，换台，调设置；鼠标相当于电脑，可以和键盘一起控制电脑，emmmmm，如果了解科幻片的话，其中的点击虚拟屏幕就是现在鼠标控制的元凶。 点评：考察用一句话描述产品定位。产品再用户心智模型的第一反应，根据自己的知识经验进行描述。 如何对产品进行描述，注重以下几个点： 是什么行业，什么类型的产品 目标用户群是谁； 解决用户什么问题 给用户带什么价值 跟竞争对手的差异在哪 如何匹配产品与用户心智模型的链接最简单的方法就是比喻，将与原来的方法比对起来。 说说你平常用的软件，为什么喜欢？ 听到，鲜果阅读， 点评：考察队用户核心需求的把握能力，为什么喜欢，因为其解决一定的问题（需求痛点），给你带来了什么价值？鲜果阅读是聚合阅读，节约用户获取产品的时间价值，这是产品的核心。 如何今天与同学约好买手机，突然导师打电话有事去不了了，这个时候一直打不清楚电话，这个时候你该如何做？ From me: 点评：考察沟通能力与优先级排序能力.具体问题具体分析，一般需要分为几种场景啦讨论。such，导师的事情优先级高么，与同学之间还有其他方式么？ 说说12306不好用的原因。 听到，总的来说，归为用户体验不好，不支持大量订票购票操作，订票购票存在逻辑问题，存在订不到票的问题。 点评：没有解决用户在特定场景急切买到票的需求，用户在很多时候想不通过登录与复杂的流程进行购票，只想简单方便的买到。在票源紧张的时候还可以买到票，这是很多刷票软件诞生的原因。 日常提问综合案例题： 给你喜欢的APP增加一个功能，说明设计思路。 糗事百科，增加基于LBS（基于位置的服务）的发布糗事功能。发现身边的糗事，增加糗友无处不在。 点评： 考察根据产品定位增加产品功能，以及评估一个功能是否该做。评估的标准是产品定位、KANO 模型（对用户需求分类和优先排序的有用工具）、产品的价值。 中式款餐店旁边是肯德基，没有太多资金进行推广，如何进行引流？ 点评：考察是否有产品运营的思维低成本的有事件推广，技术工具、创业推广。技术运营的策略和思维： 开放平台 种子用户 媒介软文 技术工具 产品捆绑 广告植入 合作整合 社区推广 活动策划 创业腿长 事件营销 智能手机与电脑结合，摇一摇，有什么好玩的玩法！考察有木有理解移动互联的本质，即智能手机传感器的应用。手机端的特质，摇一摇AR等在手机中的应用~ 总结：产品职位的面试在于尝试洞悉出题者的动机，如同洞察用户的动机和核心需求，考察在于产品定位、核心需求、需求排序等问题","categories":[],"tags":[]},{"title":"产品经理职责及产品设计流程","slug":"重新分析互联网产品及职责","date":"2018-03-25T12:24:14.000Z","updated":"2018-04-04T07:07:56.728Z","comments":true,"path":"2018/03/25/重新分析互联网产品及职责/","link":"","permalink":"http://gorgegao.club/2018/03/25/重新分析互联网产品及职责/","excerpt":"在最近经历求职简历无回应，准备无从下手之际，重新看下产品经理的职责，设计一个产品需要做什么，从中找点启发，继续我的产品路~‘ 文章分为两部分，第一部分是来自人人都是产品经理老曹的分析，第二部分来自某培训机构产品经理内容介绍。","text":"在最近经历求职简历无回应，准备无从下手之际，重新看下产品经理的职责，设计一个产品需要做什么，从中找点启发，继续我的产品路~‘ 文章分为两部分，第一部分是来自人人都是产品经理老曹的分析，第二部分来自某培训机构产品经理内容介绍。 产品经理的主要职责：from：人人都是产品经理，老曹 产品经理岗位职责 市场调研 与用户和潜在用户交流 与直接面对客户的一线同事交流 研究市场分析报告及文章 研究市场分析报告及文章 使用竞争产品 仔细观察用户行为 产品定义及设计 定义产品指产品做什么内容(使用PRD描述) 市场愿景 竞品分析 产品的详细功能描述 产品优先级 产品用例 系统需求 性能需求 销售及技术支持需求 产品外观设计，用户界面设计，交互界面设计及用户体验设计 PRD 产品需求文档撰写 项目管理 沟通不同团队人员(工程师、QA、市场、销售、客服等)，在预算时间内发布产品 确保资源投入 制定项目计划 根据计划跟踪项目进展 辨别关键路劲 必要时真去追加投入 向主管汇报项目进展 产品宣传 向包括老板、销售、客服等沟通产品的优点、功能和目标市场，也可能向外界选厂 产品市场 产品生命周期管理指随着产品经历概念化、发布、成熟、退出整个生命周期中的产品管理活动。 产品定位 产品定价及促销 产品线管理 竞争策略 建立或收购合作伙伴 识别并建立合作关系 产品设计流程from西南科大产品培训的简单过程分析 step1:市场分析/用户分析以抖音、西瓜视频、快手、美拍、秒拍为例进行分析。 竞争对手：快手（竞品分析）特点分析：时间偏长 目标用户，用户群体可分为三类： 核心用户：严重短视频创作、拍摄上传的用户； 重点用户：使用短视频娱乐记录身边的趣事； 普通用户：普通浏览别人的视频。 step2:需求分析、功能设计需求：现代人“杀时间”的需求。 分析短视频的的优点、缺点及用户需求分析； 短视屏 优点 缺点 用户分类 用户需求 1 门槛低、用户多、入口全 质量差异大、运营成本高 拍摄、上推荐 贴纸/特效多，简介功能、多关注 2 直观小巧、耗费少、碎片化 拍摄、剪辑要求高 拍摄、记录生活 制作简单方便 3 信息大、强社交 同质化、创新少 观众 浏览快速简单 针对短视频的优缺点及需求扬弃； 短视屏 发挥优势 避开弱点 用户分类 满足需求 1 / 质量差异大、运营成本高 拍摄、上推荐 / 2 门槛15s 拍摄:倒计时，手机剪辑简洁化 拍摄、记录生活 左右滑动，跟随拍摄选择 3 评价、点赞、关注 小巧、便捷化管理 观众 无广告；全屏幕展示；双击收藏；点击关注，定制化推荐 step3:原型设计分析功能、使用Axure、墨刀等设计软件设计原型图(高保真)； 原型设计的目的： * 告诉程序员要做什么 * 告诉UI需如何设计 * 交互设计如何更美观 step4:项目评审在设计出产品基础上，与开发人员、运营人员、UE、UI、市场人员讨论项目可行性； 目的： 开发人员、UI人员清楚项目目的、规模及主要莫夸 开发、UI对存在漏洞提出补充； 开发、UI与产品规划时间流程； 与运营人员讨论项目是否符合市场预期。 step5 项目上线目的： 审核项目是否达标 准备市场，运营资料 解决问题 较差后台，准备查看数据，密切注意用户反馈 step6 分析数据、不断迭代 将项目分成若干小点 不断根据市场数据就差，快速反应 不断保持其在用户商店的活跃和评级 保持用户活跃度 保持团队活力","categories":[],"tags":[]},{"title":"shell 学习","slug":"shell-学习","date":"2018-03-20T06:57:34.000Z","updated":"2018-04-03T12:36:11.352Z","comments":true,"path":"2018/03/20/shell-学习/","link":"","permalink":"http://gorgegao.club/2018/03/20/shell-学习/","excerpt":"初学Shell脚本语言，了解一点。","text":"初学Shell脚本语言，了解一点。注意事项：1、执行脚本时需要执行的操作123shell #!/bin/bash echo &quot;Hello World !&quot; 2、变量在输出时需要在前加 “$”只读变量 readonly [+变量名]删除变量 unset [+变量名] shell数组 定义使用 数组名=(值1 值2 … 值n)12array_name=(value0 value1 value2 value3)echo $&#123;arry_name[@]&#125; #获取数据中所有值","categories":[],"tags":[]},{"title":"互联网长尾、闭环","slug":"互联网闭环","date":"2018-03-19T00:21:19.000Z","updated":"2018-04-03T12:48:14.037Z","comments":true,"path":"2018/03/19/互联网闭环/","link":"","permalink":"http://gorgegao.club/2018/03/19/互联网闭环/","excerpt":"看人人都是产品经理，学到两个新名词，互联网长尾时代、互联网闭环时代，mark下","text":"看人人都是产品经理，学到两个新名词，互联网长尾时代、互联网闭环时代，mark下 互联网长尾长尾或者长尾效应，指的是指那些原来不受到重视的销量小但种类多的产品或服务由于总量巨大，累积起来的总收益超过主流产品的现象。 eg:以互联网电商企业为利例，即不同于传统的二八效应，传统的二八效应认为80%的销售额来源于20%的用户。而长尾效应表示一半左右的销售量来源于比较热门的商品，另外一半来源于不热门的商品。 淘宝、美团、饿了么这些互联网企业则证实了互联网企业中存在的这些长尾效应，集合零散商家与小额用户，创造超越大规模商家的利益。 因此，淘宝电商、OTO时代应该是典型的互联网长尾时代。 产品经理中看到快手是互联网长尾时代到来的时候， O2O闭环O2O闭环经常被顾名思义地理解为包办整个商业链条的所有环节而不依赖第三方。 闭环，顾名思义，形成一个完成的闭圈。互联网内，指产品由引流到体验到反馈的一个闭环现象。闭环就是：引流——体验——反馈——再次引流的循环！（From :知乎 Firmin Peng） eg:O2O线上线下产品为例，以前的O2O从团购开始，线上购买，线下消费，通过奖励补贴吸引用户继续消费。闭环的核心在于形成对每一单交易的跟踪和记录，其形式上也许不需要封闭，但是订单追踪一定要从开始到获取结束。","categories":[],"tags":[]},{"title":"HTML 复习","slug":"HTML-复习","date":"2018-03-07T11:28:54.000Z","updated":"2018-04-03T12:37:31.486Z","comments":true,"path":"2018/03/07/HTML-复习/","link":"","permalink":"http://gorgegao.club/2018/03/07/HTML-复习/","excerpt":"HTML5 一些忘记的、新加的标签复习哈~","text":"HTML5 一些忘记的、新加的标签复习哈~ 一些少见的HTML标签HTML head 标签 描述 &lt;base&gt; 定义了页面链接标签的默认链接地址 HTML 列表 标签 描述 &lt;ol&gt; 有序列表 &lt;ul&gt; 无序列表 HTML 框架 标签 描述 iframe 通过使用框架，你可以在同一个浏览器窗口中显示不止一个页面。 HTML 字符实体不间断空格(Non-breaking Space)HTML 中的常用字符实体是不间断空格(&amp;nbsp;)。 HTML5 在原生HTML基础上增加很多元素 绘图的 canvas元素 媒体播放的vedio和audio元素 本地可存储 加入新的元素actile、footer、header、nav、section 加入新的表单控件 calendar、date、time、email、url、search HTML5 的改进 新元素 新属性 完全支持 CSS3 Video 和 Audio 2D/3D 制图 本地存储 本地 SQL 数据 Web 应用","categories":[],"tags":[]},{"title":"Hexo+github 创建注意事项","slug":"first blog","date":"2017-06-15T13:40:36.000Z","updated":"2017-06-17T05:38:26.719Z","comments":true,"path":"2017/06/15/first blog/","link":"","permalink":"http://gorgegao.club/2017/06/15/first blog/","excerpt":"就想说github+hexo配置博客注意几点。","text":"就想说github+hexo配置博客注意几点。 1、仓库命名与用户名一致！仓库命名与用户名一致！仓库命名与用户名一致！ such as: 我的用户名为 junlegao 仓库名为 junlegao.github.io 2、发布时注意需进行对hexo 进行配置 即：npm install hexo-deployer-git –save 也可用 cnpm install hexo-deployer-git –save(淘宝仓配好后才可) 3、补充下hexo写博客流程。 新建博客 hexo new “New Post” 发布到服务 hexo server / hexo s 静态生成 hexo generate / hexo g 发布 hexo deploy / hexo d","categories":[],"tags":[]}]}